[
  {
    "id": "https://en.wikipedia.org/wiki/Wind_power", 
    "contents": "Wind power is the use of air flow through wind turbines to mechanically power generators for electricity.Wind power, as an alternative to burning fossil fuels, is plentiful, renewable, widely distributed, clean, produces no greenhouse gas emissions during operation, consumes no water, and uses little land."
  }, 
  {
    "id": "http://www.awea.org/", 
    "contents": "The American Wind Energy Association (AWEA) is the premier national trade association that represents the interests of America’s wind energy industry."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Wind_power_in_Denmark", 
    "contents": "Denmark was a pioneer in developing commercial wind power during the 1970s, and today a substantial share of the wind turbines around the world are produced by Danish manufacturers such as Vestas and Siemens Wind Power …"
  }, 
  {
    "id": "http://gwec.net/", 
    "contents": "7 June, Hanoi – The Global Wind Energy Council (GWEC) opened its first ever wind power conference in Vietnam today, gathering leading national and international industry players to discuss the development of the sector with government."
  }, 
  {
    "id": "http://xant.com/", 
    "contents": "Buy micro grid wind power plant turbines/generators for home, farms, industries etc. We provide 100 KW, 95 KW mid size wind turbines with easy renewable energy technology."
  }, 
  {
    "id": "http://www.ewea.org/", 
    "contents": "EWEA is the voice of the wind industry, promoting wind power in Europe and worldwide. EWEA has over 600 members active in over 50 countries, making it the world's largest and most powerful wind energy network."
  }, 
  {
    "id": "http://ramblingsdc.net/Australia/WindPower.html", 
    "contents": "Informative and, hopefully, up to date pages on Australian wind power and wind farms. All the relevant facts plus a bit of opinion based …"
  }, 
  {
    "id": "http://www.windontario.ca/", 
    "contents": "Ontario Wind Turbines. The Ontario Green Energy Act is the largest transfer of wealth in Canadian history. It takes money from the people, including the poor and middle class, and gives it to large corporations."
  }, 
  {
    "id": "http://mdpub.com/Wind_Turbine/", 
    "contents": "Update: Here is a video of the wind turbine in operation. Update: Here is a video of me assembling and setting up the wind turbine on my remote off-grid property."
  }, 
  {
    "id": "http://www.dailymail.co.uk/home/moslive/article-1350811/In-China-true-cost-Britains-clean-green-wind-power-experiment-Pollution-disastrous-scale.html", 
    "contents": "In China, the true cost of Britain's clean, green wind power experiment: Pollution on a disastrous scale. By SIMON PARRY in China and ED DOUGLAS in Scotland"
  }, 
  {
    "id": "https://www.ge.com/renewableenergy/wind-energy/turbines", 
    "contents": "Wind turbine technology ranges from onshore to offshore turbines. View the wind turbine portfolio of GE, one of the leading suppliers of wind turbines."
  }, 
  {
    "id": "https://www.youtube.com/watch?v=qSWm_nprfqE", 
    "contents": "Jul 28, 2015 · Working of a wind turbine is illustrated in this video with the help of animation. The topic covered are blade design, use of brake, velocity sensor, yawing mechanism, blade …"
  }, 
  {
    "id": "https://windexchange.energy.gov/what-is-wind", 
    "contents": "Wind turbines convert the kinetic energy in the wind into mechanical power. This mechanical power can be used for specific tasks (such as grinding grain or pumping water), or can be converted into electricity by a generator."
  }, 
  {
    "id": "https://www.energy.gov/articles/how-wind-turbine-works", 
    "contents": "From massive wind farms generating power to small turbines powering a single home, wind turbines around the globe generate clean electricity for a variety of power needs. …"
  }, 
  {
    "id": "https://www.wholesalesolar.com/wind-generator-turbines", 
    "contents": "Small wind generators are a great supplement for solar power in areas with strong, steady winds. Be sure to check the start up speed of the wind turbine you want to buy!"
  }, 
  {
    "id": "https://www.motherearthnews.com/renewable-energy/wind-power/home-wind-power-zm0z13amzrob", 
    "contents": "Seeking residential wind power for energy self-sufficiency? Find out whether a home wind turbine is right for you."
  }, 
  {
    "id": "https://www.awea.org/all-about-wind", 
    "contents": "Wind power captures the natural wind in our atmosphere and converts it into mechanical energy then electricity. People started using wind power centuries ago with windmills, …"
  }, 
  {
    "id": "https://www.homedepot.com/p/Nature-Power-2000-Watt-Wind-Turbine-Power-Generator-70701/204334614", 
    "contents": "The wind turbine will produce more power up to 2000-Watt at 28 mph. If the wind dies down the turbine will continue to produce power in winds as low as 7 mph. This wind generator is used to charge 12-Volt batteries and mounts on …"
  }, 
  {
    "id": "http://bergey.com/", 
    "contents": "Bergey Windpower is the oldest and most experienced manufacturer of residential-sized wind turbines in the world. Thirty years ago Bergey pioneered the radically-simple “Bergey design” that has proven to provide the best reliability, performance, service life, and value of all of the hundreds of competitive products that have come and gone in that time."
  }, 
  {
    "id": "https://www.windpowerengineering.com/", 
    "contents": "Windpower Engineering & Development has windpower news, all aspects of wind energy and the issues that make the renewable industry function."
  }, 
  {
    "id": "https://www.walmart.com/c/kp/wind-turbines", 
    "contents": "You are eligible for a full refund if no ShippingPass-eligible orders have been placed.You cannot receive a refund if you have placed a ShippingPass-eligible order.In this case, the Customer Care team will remove your account from auto-renewal to ensure you are not charged for an additional year and you can continue to use the subscription ..."
  }, 
  {
    "id": "https://www.thoughtco.com/pros-and-cons-of-wind-power-1204181", 
    "contents": "Wind power: what is it, how does it work, and what are the pros and cons?"
  }, 
  {
    "id": "https://www.theguardian.com/environment/windpower", 
    "contents": "Letters: Whatever the WWF says, peak demand for gas-fired generation will be larger, says Steve Bolter, while Chris Underwood pours cold …"
  }, 
  {
    "id": "https://www.windpowermonthly.com/", 
    "contents": "Find news, insight & analysis on wind power companies, policy, technology, O&M & project development on Windpower Monthly"
  }, 
  {
    "id": "https://www.eia.gov/electricity/data/browser/", 
    "contents": "Energy Information Administration - EIA - Official Energy Statistics from the U.S. Government"
  }, 
  {
    "id": "http://georgiapower.com/", 
    "contents": "Georgia Power is the largest subsidiary of Southern Company, one of the nation's largest generators of electricity. The company is an investor-owned, tax-paying utility, serving 2.3 million customers in 155 of 159 counties in Georgia."
  }, 
  {
    "id": "http://www.aep.com/", 
    "contents": "Power generation, transmission, distribution & retail energy sales. AEP serves more than 5 million customers in 11 states."
  }, 
  {
    "id": "https://www.ucsusa.org/clean-energy/renewable-energy/public-benefits-of-renewable-power", 
    "contents": "Renewable energy—wind, solar, geothermal, hydroelectric, and biomass—provides substantial benefits for our climate, our health, and our economy."
  }, 
  {
    "id": "http://windcarrier.com/media/news/", 
    "contents": "German developer Innogy has completed turbine installation at its 353MW Galloper wind farm off the Suffolk coast of the UK. The project’s final Siemens Gamesa 6.3MW turbine was installed by Fred."
  }, 
  {
    "id": "https://about.bnef.com/new-energy-outlook/", 
    "contents": "BNEF New Energy Outlook is our annual long-term economic forecast of the world’s power sector."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Wind_power", 
    "contents": "Wind power is the use of air flow through wind turbines to mechanically power generators for electricity.Wind power, as an alternative to burning fossil fuels, is plentiful, renewable, widely distributed, clean, produces no greenhouse gas emissions during operation, consumes no water, and uses little land."
  }, 
  {
    "id": "http://www.awea.org/", 
    "contents": "The American Wind Energy Association (AWEA) is the premier national trade association that represents the interests of America’s wind energy industry."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Wind_power_in_Denmark", 
    "contents": "Denmark was a pioneer in developing commercial wind power during the 1970s, and today a substantial share of the wind turbines around the world are produced by Danish manufacturers such as Vestas and Siemens Wind Power …"
  }, 
  {
    "id": "http://gwec.net/", 
    "contents": "Wind Business Intelligence. The Global Wind Energy Council (GWEC) opened its first ever wind power conference in Vietnam today, gathering leading national and international industry players to discuss the development of the sector with government."
  }, 
  {
    "id": "http://xant.com/", 
    "contents": "Buy micro grid wind power plant turbines/generators for home, farms, industries etc. We provide 100 KW, 95 KW mid size wind turbines with easy renewable energy technology."
  }, 
  {
    "id": "http://www.ewea.org/", 
    "contents": "EWEA is the voice of the wind industry, promoting wind power in Europe and worldwide. EWEA has over 600 members active in over 50 countries, making it the world's largest and most powerful wind energy network."
  }, 
  {
    "id": "http://ramblingsdc.net/Australia/WindPower.html", 
    "contents": "Wind in the Bush aims to be the most informative, comprehensive, and up-to-date pages on Australian wind power and wind farms. The author is not beholden to any company, lobby group, or government."
  }, 
  {
    "id": "http://www.windontario.ca/", 
    "contents": "Ontario Wind Turbines. The Ontario Green Energy Act is the largest transfer of wealth in Canadian history. It takes money from the people, including the poor and middle class, and gives it to large corporations."
  }, 
  {
    "id": "http://mdpub.com/Wind_Turbine/", 
    "contents": "How to build an electricity producing wind turbine"
  }, 
  {
    "id": "http://www.dailymail.co.uk/home/moslive/article-1350811/In-China-true-cost-Britains-clean-green-wind-power-experiment-Pollution-disastrous-scale.html", 
    "contents": "In China, the true cost of Britain's clean, green wind power experiment: Pollution on a disastrous scale. By SIMON PARRY in China and ED DOUGLAS in Scotland"
  }, 
  {
    "id": "https://www.thefreedictionary.com/wind", 
    "contents": "wind 1 (wĭnd) n. 1. a. Moving air, especially a natural and perceptible movement of air parallel to or along the ground. b. A movement of air generated artificially, as by ..."
  }, 
  {
    "id": "https://www.vestas.com/", 
    "contents": "Vestas is the energy industry’s global partner on sustainable energy solutions. We design, manufacture, install, and service wind turbines across the globe, and with 92 GW of wind turbines in 79 countries, we have installed more wind power than anyone else."
  }, 
  {
    "id": "http://hint.fm/wind/", 
    "contents": "The wind map is a personal art project, not associated with any company. We've done our best to make this as accurate as possible, but can't make any guarantees about the correctness of the data or our software."
  }, 
  {
    "id": "https://www.nationalgeographic.com/science/", 
    "contents": "Exploring the latest in scientific discoveries from prehistoric life to missions to Mars."
  }, 
  {
    "id": "https://www.sciencedaily.com/terms/wind_power.htm", 
    "contents": "Most modern wind power is generated in the form of electricity by converting the rotation of turbine blades into electrical current by means of an electrical generator. In windmills (a much older technology), wind energy is used to turn mechanical machinery to do physical work, such as crushing grain or pumping water."
  }, 
  {
    "id": "https://www.siemens.com/global/en/home/markets/wind.html", 
    "contents": "Siemens turns wind into an asset. Wind energy solutions along the onshore and offshore value chain help the industry lead the way to a sustainable future."
  }, 
  {
    "id": "https://www.studentenergy.org/topics/wind-power", 
    "contents": "Wind speeds can vary throughout the day and year, causing intermittency issues for power grids. The price tag of wind power has traditionally been higher than …"
  }, 
  {
    "id": "https://www.ucsusa.org/clean-energy/renewable-energy/environmental-impacts-wind-power", 
    "contents": "Wind power generates electricity without toxic pollution or global warming emissions, but it does have some environmental impacts that should be recognized and mitigated."
  }, 
  {
    "id": "https://www.amazon.com/Thames-Kosmos-Wind-Power-2-0/dp/B003KYRSQC", 
    "contents": "Product Description. Thames & Kosmos Wind Power 2.0 From the Manufacturer. Electricity Generating Turbines. Build wind powered generators to energize your electric vehicles and charge your rechargeable batteries."
  }, 
  {
    "id": "http://cr.middlebury.edu/es/altenergylife/windpower.htm", 
    "contents": "Wind resources a categorized by wind-power density classes, wherein 1 is the lowest and 7 is the highest. Good wind resources generally fall above a class 3 level, with an average annual wind speed of at least 13 mph."
  }, 
  {
    "id": "http://wind.appstate.edu/wind-power/wind-turbines", 
    "contents": "Wind turbine technology is far more efficient, quiet, and sophisticated than similar technology just 10 years ago. Largely due to technological advancements, the cost of energy produced from wind turbines has fallen nearly 80% in the past two decades, making this renewable resource competitive with conventional sources of energy like …"
  }, 
  {
    "id": "http://www.alternative-energy-news.info/technology/wind-power/wind-turbines/", 
    "contents": " Wind turbines are used to generate electricity from the kinetic power of the wind. Historical they were more frequently used as a mechanical device to turn machinery. There are two main kinds of wind generators, those with a …"
  }, 
  {
    "id": "https://www.vestas.com/", 
    "contents": "Wind. It means the world to us. With installations in over 70 countries, Vestas is the only global energy company dedicated exclusively to wind energy."
  }, 
  {
    "id": "http://www.in.gov/oed/2413.htm", 
    "contents": " Wind power, electricity generated by capturing the wind's energy with modern wind turbines, is one of the lowest-cost renewable electricity alternatives currently available."
  }, 
  {
    "id": "https://www.ebay.com/sch/i.html?_nkw=wind+power+generator", 
    "contents": "Find great deals on eBay for wind power generator. Shop with confidence."
  }, 
  {
    "id": "https://www.magnet4sale.com/green-energy/wind-power/", 
    "contents": "Wind turbine and wind power blades magnet wire and energy savings wide variety of DIY wind power units at CMS Magnetics"
  }, 
  {
    "id": "https://www.windpowerexpo.org/", 
    "contents": "Exhibit Gain unmatched access to thousands of qualified buyers from every corner of the wind energy industry. A booth gives your company limitless opportunities to increase sales, reach new buyers, close deals, and strengthen your brand."
  }, 
  {
    "id": "http://energy.utah.gov/resource-areas/renewable-energy/resource-profile-wind-energy-utah/", 
    "contents": "Resource Profile: Wind Energy in Utah - Office of Energy | Four of the hundreds of wind turbines at First Wind's 306 MW Milford Wind Farm, in Millard County."
  }, 
  {
    "id": "http://cr.middlebury.edu/es/altenergylife/windpower.htm", 
    "contents": "Wind Energy. Wind power, or wind energy, is a renewable resource; it is from the sun. The intensity of solar radiation differs across the globe. Some areas receive intense amounts of sunlight, while others receive much less."
  }, 
  {
    "id": "https://www.ebay.com/sch/i.html?_nkw=wind+power+generator", 
    "contents": "Find great deals on eBay for wind power generator. Shop with confidence."
  }, 
  {
    "id": "https://www.magnet4sale.com/green-energy/wind-power/", 
    "contents": "Wind turbine and wind power blades magnet wire and energy savings wide variety of DIY wind power units at CMS Magnetics"
  }, 
  {
    "id": "https://www.soinc.org/wind-power-c", 
    "contents": "Teams will build a blade assembly that consists of any kind of propeller/pinwheel/rotor attached to a CD which will be used to capture wind power. Students will also be tested on their knowledge relating to alternative energy."
  }, 
  {
    "id": "http://windenergyfoundation.org/what-is-wind-energy/", 
    "contents": "The Wind Energy Foundation is a nonprofit dedicated to raising public awareness of wind as a clean energy source through communication, research and education."
  }, 
  {
    "id": "http://osceolaenergy.com/wind-power/", 
    "contents": "Is Wind Energy Right for You? A location assessment must be conducted before the integration of wind power; the location of your home or business is key to determining if a wind turbine is the right fit and will function optimally."
  }, 
  {
    "id": "https://www.merriam-webster.com/dictionary/wind%20turbine", 
    "contents": "Other New England states such as Maine, Massachusetts and Rhode Island have access to stiff winds off the Atlantic Ocean that can reliably power wind turbines. — stephen singer, courant.com, \"Connecticut Seeks Boost For New London Port For Wind Turbine Equipment Transit,\" 29 May 2018"
  }, 
  {
    "id": "http://energy.utah.gov/resource-areas/renewable-energy/resource-profile-wind-energy-utah/", 
    "contents": "Resource Profile: Wind Energy in Utah - Office of Energy | Four of the hundreds of wind turbines at First Wind's 306 MW Milford Wind Farm, in Millard County."
  }, 
  {
    "id": "https://www.mass.gov/info-details/wind-turbines", 
    "contents": "Studies, financing, requirements and Technical assistance on siting wind turbines. Brought to you by the Massachusetts Department of Environmental Protection, The Department of Energy Resources, and the Massachusetts Clean Energy Center. August 2015 - Kingston Wind Independence Turbine Acoustical ..."
  }, 
  {
    "id": "https://www.windpowerexpo.org/", 
    "contents": "Exhibit Gain unmatched access to thousands of qualified buyers from every corner of the wind energy industry. A booth gives your company limitless opportunities to increase sales, reach new buyers, close deals, and strengthen your brand."
  }, 
  {
    "id": "https://www.britannica.com/technology/wind-turbine", 
    "contents": "Wind turbine: Wind turbine, apparatus used to convert the kinetic energy of wind into electricity. Wind turbines come in several sizes, with small-scale models used for providing electricity to rural homes or cabins and community-scale models used for providing electricity to a small number of homes within a"
  }, 
  {
    "id": "https://www.sciencedaily.com/news/matter_energy/wind_energy/", 
    "contents": "Wind Energy Information. From offshore wind turbines to understanding wind turbulence, learn all about using the wind to our advantage. Also, wind testing buildings."
  }, 
  {
    "id": "https://www.americanthinker.com/articles/2018/06/magical_wind_power_illusions_versus_reality.html?share=pinterest", 
    "contents": "The primary reason why wind energy has been a success has nothing to do with wind energy! Instead, its success is 100% due to the fact that wind energy proponents are masterful lobbyists."
  }, 
  {
    "id": "http://www.dictionary.com/browse/wind-power", 
    "contents": "Wind power definition, power derived from wind: used to generate electricity or mechanical power. See more."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Wind_power", 
    "contents": "Wind power is the use of air flow through wind turbines to mechanically power generators for electricity.Wind power, as an alternative to burning fossil fuels, is plentiful, renewable, widely distributed, clean, produces no greenhouse gas emissions during operation, consumes no water, and uses little land."
  }, 
  {
    "id": "http://www.awea.org/", 
    "contents": "The American Wind Energy Association (AWEA) is the premier national trade association that represents the interests of America’s wind energy industry."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Wind_power_in_Denmark", 
    "contents": "Denmark was a pioneer in developing commercial wind power during the 1970s, and today a substantial share of the wind turbines around the world are produced by Danish manufacturers such as Vestas and Siemens Wind Power …"
  }, 
  {
    "id": "http://gwec.net/", 
    "contents": "7 June, Hanoi – The Global Wind Energy Council (GWEC) opened its first ever wind power conference in Vietnam today, gathering leading national and international industry players to discuss the development of the sector with government."
  }, 
  {
    "id": "http://xant.com/", 
    "contents": "Buy micro grid wind power plant turbines/generators for home, farms, industries etc. We provide 100 KW, 95 KW mid size wind turbines with easy renewable energy technology."
  }, 
  {
    "id": "http://www.ewea.org/", 
    "contents": "EWEA is the voice of the wind industry, promoting wind power in Europe and worldwide. EWEA has over 600 members active in over 50 countries, making it the world's largest and most powerful wind energy network."
  }, 
  {
    "id": "http://ramblingsdc.net/Australia/WindPower.html", 
    "contents": "Informative and, hopefully, up to date pages on Australian wind power and wind farms. All the relevant facts plus a bit of opinion based …"
  }, 
  {
    "id": "http://www.windontario.ca/", 
    "contents": "Ontario Wind Turbines. The Ontario Green Energy Act is the largest transfer of wealth in Canadian history. It takes money from the people, including the poor and middle class, and gives it to large corporations."
  }, 
  {
    "id": "http://mdpub.com/Wind_Turbine/", 
    "contents": "Update: Here is a video of the wind turbine in operation. Update: Here is a video of me assembling and setting up the wind turbine on my remote off-grid property."
  }, 
  {
    "id": "http://www.dailymail.co.uk/home/moslive/article-1350811/In-China-true-cost-Britains-clean-green-wind-power-experiment-Pollution-disastrous-scale.html", 
    "contents": "In China, the true cost of Britain's clean, green wind power experiment: Pollution on a disastrous scale. By SIMON PARRY in China and ED DOUGLAS in Scotland"
  }, 
  {
    "id": "https://www.thefreedictionary.com/wind", 
    "contents": "wind 1 (wĭnd) n. 1. a. Moving air, especially a natural and perceptible movement of air parallel to or along the ground. b. A movement of air generated artificially, as by ..."
  }, 
  {
    "id": "https://www.vestas.com/", 
    "contents": "Wind. It means the world to us. With installations in over 70 countries, Vestas is the only global energy company dedicated exclusively to wind energy."
  }, 
  {
    "id": "http://hint.fm/wind/", 
    "contents": "The wind map is a personal art project, not associated with any company. We've done our best to make this as accurate as possible, but can't make any guarantees about the correctness of the data or our software."
  }, 
  {
    "id": "https://www.nationalgeographic.com/science/", 
    "contents": "Exploring the latest in scientific discoveries from prehistoric life to missions to Mars."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Wind_power", 
    "contents": "Wind power is the use of air flow through wind turbines to mechanically power generators for electricity.Wind power, as an alternative to burning fossil fuels, is plentiful, renewable, widely distributed, clean, produces no greenhouse gas emissions during operation, consumes no water, and uses little land."
  }, 
  {
    "id": "http://www.awea.org/", 
    "contents": "The American Wind Energy Association (AWEA) is the premier national trade association that represents the interests of America’s wind energy industry."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Wind_power_in_Denmark", 
    "contents": "Denmark was a pioneer in developing commercial wind power during the 1970s, and today a substantial share of the wind turbines around the world are produced by Danish manufacturers such as Vestas and Siemens Wind Power …"
  }, 
  {
    "id": "http://gwec.net/", 
    "contents": "7 June, Hanoi – The Global Wind Energy Council (GWEC) opened its first ever wind power conference in Vietnam today, gathering leading national and international industry players to discuss the development of the sector with government."
  }, 
  {
    "id": "http://xant.com/", 
    "contents": "Buy micro grid wind power plant turbines/generators for home, farms, industries etc. We provide 100 KW, 95 KW mid size wind turbines with easy renewable energy technology."
  }, 
  {
    "id": "http://www.ewea.org/", 
    "contents": "EWEA is the voice of the wind industry, promoting wind power in Europe and worldwide. EWEA has over 600 members active in over 50 countries, making it the world's largest and most powerful wind energy network."
  }, 
  {
    "id": "http://ramblingsdc.net/Australia/WindPower.html", 
    "contents": "Informative and, hopefully, up to date pages on Australian wind power and wind farms. All the relevant facts plus a bit of opinion based …"
  }, 
  {
    "id": "http://www.windontario.ca/", 
    "contents": "Ontario Wind Turbines. The Ontario Green Energy Act is the largest transfer of wealth in Canadian history. It takes money from the people, including the poor and middle class, and gives it to large corporations."
  }, 
  {
    "id": "http://mdpub.com/Wind_Turbine/", 
    "contents": "Update: Here is a video of the wind turbine in operation. Update: Here is a video of me assembling and setting up the wind turbine on my remote off-grid property."
  }, 
  {
    "id": "http://www.dailymail.co.uk/home/moslive/article-1350811/In-China-true-cost-Britains-clean-green-wind-power-experiment-Pollution-disastrous-scale.html", 
    "contents": "In China, the true cost of Britain's clean, green wind power experiment: Pollution on a disastrous scale. By SIMON PARRY in China and ED DOUGLAS in Scotland"
  }, 
  {
    "id": "https://www.thefreedictionary.com/wind", 
    "contents": "wind 1 (wĭnd) n. 1. a. Moving air, especially a natural and perceptible movement of air parallel to or along the ground. b. A movement of air generated artificially, as by ..."
  }, 
  {
    "id": "https://www.vestas.com/", 
    "contents": "Wind. It means the world to us. With installations in over 70 countries, Vestas is the only global energy company dedicated exclusively to wind energy."
  }, 
  {
    "id": "http://hint.fm/wind/", 
    "contents": "The wind map is a personal art project, not associated with any company. We've done our best to make this as accurate as possible, but can't make any guarantees about the correctness of the data or our software."
  }, 
  {
    "id": "https://www.nationalgeographic.com/science/", 
    "contents": "Exploring the latest in scientific discoveries from prehistoric life to missions to Mars."
  }
]