[
  {
    "id": "https://www.webmd.com/men/guide/male-menopause", 
    "contents": "Unlike menopause in women, when hormone production stops completely, testosterone decline in men is a slower process. The testes, unlike the ovaries, do not run out of …"
  }, 
  {
    "id": "https://www.medicinenet.com/male_menopause/article.htm", 
    "contents": "Lower production of the male hormone testosterone (androgen) could lead to male menopause symptoms: fatigue, weakness, depression, and sexual dysfunction."
  }, 
  {
    "id": "https://www.healthline.com/health/menopause/male", 
    "contents": "Male menopause” is the more common term for andropause. It describes age-related changes in male hormone levels. The same group of symptoms is also known as testosterone deficiency, androgen deficiency, and late-onset hypogonadism."
  }, 
  {
    "id": "https://www.mayoclinic.org/healthy-lifestyle/mens-health/in-depth/male-menopause/art-20048056", 
    "contents": "The term \"male menopause\" is sometimes used to describe decreasing testosterone levels related to aging. Female menopause and so-called male menopause are two …"
  }, 
  {
    "id": "https://www.livescience.com/36014-male-menopause-real-signs.html", 
    "contents": "Both andropause and male menopause are used to describe decreasing levels of the male hormone testosterone that come with aging. Most men see testosterone levels drop as they get older. Some have described andropause as puberty in reverse."
  }, 
  {
    "id": "https://www.activebeat.co/your-health/11-true-facts-about-male-menopause/2/", 
    "contents": "Testosterone Naturally Declines As Men Age As the male body ages, testosterone levels gradually start a steady decline that can begin as early as age 30 without any related symptoms. The hormone will decrease by approximately about 1-percent per year with many men noticing the affects between the ages of 40 and 50-years old."
  }, 
  {
    "id": "https://www.medicalnewstoday.com/articles/266749.php", 
    "contents": "The male menopause is a term used to describe a set of symptoms including reduced libido, weight gain, fatigue, depression, and erectile dysfunction. The male menopause is a term used to describe a set of symptoms including reduced libido, weight gain, fatigue, depression, and erectile dysfunction."
  }, 
  {
    "id": "http://www.rightdiagnosis.com/m/male_menopause/symptoms.htm", 
    "contents": "About signs and symptoms of Male Menopause: The symptom information on this page attempts to provide a list of some possible signs and symptoms of Male Menopause. This signs and symptoms information for Male Menopause has been gathered from various sources, may not be fully accurate, and may not be the full list of Male Menopause …"
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Andropause", 
    "contents": "Popular interest in the concept of \"andropause\" was fueled by the 1998 book Male Menopause, written by Jed Diamond, a lay person. According to Diamond's view, andropause is a change of life in middle-aged men, which has hormonal, physical, psychological, interpersonal, social, sexual, and spiritual aspects."
  }, 
  {
    "id": "https://www.nhs.uk/conditions/male-menopause/", 
    "contents": "The \"male menopause\" (sometimes called the \"andropause\") is an unhelpful term sometimes used in the media to explain the above symptoms. This label is misleading because it suggests the symptoms are the result of a sudden drop in testosterone in middle age, similar to what occurs in the female menopause."
  }, 
  {
    "id": "http://www.epigee.org/menopause/male_menopause.html", 
    "contents": "Causes of Male Menopause. Male menopause can occur naturally in some men. More often than not, though, andropause is triggered by illness, depression, dementia, and …"
  }, 
  {
    "id": "https://www.webmd.com/menopause/qa/what-is-male-menopause", 
    "contents": "because men do not go through a well-defined period referred to as menopause, some doctors call this problem androgen (testosterone) decline in the aging male, or low testosterone. men do make less te"
  }, 
  {
    "id": "https://www.medicinenet.com/male_menopause/views.htm", 
    "contents": "Male menopause is also commonly referred to as low-T, andropause, or its medical name, late-onset hypogonadism. However, some medical experts argue that the analogy to the process in women (with some authors even using …"
  }, 
  {
    "id": "https://www.bodylogicmd.com/for-men/symptoms-of-andropause", 
    "contents": "Andropause symptoms due to declining hormone levels are common in men as they age. The modern lifestyle of high stress levels and poor fitness and nutrition habits paired with an increased life expectancy have a substantial affect on the male body."
  }, 
  {
    "id": "http://www.dailymail.co.uk/health/article-3003472/Grumpy-lethargic-low-libido-man-hit-male-menopause.html", 
    "contents": "Some experts - and men themselves - are convinced they go through the male equivalent of the menopause, blaming a drop in testosterone for a host of middle-age problems."
  }, 
  {
    "id": "https://www.huffingtonpost.com/entry/5-reasons-men-dont-want-to-deal-with-male-menopause_us_561547d7e4b021e856d31916", 
    "contents": "Oct 08, 2015 · When it comes to aging, women speak freely about menopausal mood swings, thinning hair, hot flashes, exhaustion, weight gain, etc. But women aren't the only ones who have to deal with hormonal changes as they age. Many men suffer from andropause -- frequently referred to as male menopause -- which ..."
  }, 
  {
    "id": "https://www.merriam-webster.com/dictionary/male%20menopause", 
    "contents": "Seen and Heard. What made you want to look up male menopause?Please tell us where you read or heard it (including the quote, if possible)."
  }, 
  {
    "id": "https://www.nhs.uk/conditions/male-menopause/", 
    "contents": "Read about male menopause, where some men develop depression, loss of sex drive, erectile dysfunction and other physical and emotional symptoms when they reach their late 40s to early 50s. Read about male menopause, where some men develop depression, loss of sex drive, erectile dysfunction and other physical and emotional symptoms …"
  }, 
  {
    "id": "https://medical-dictionary.thefreedictionary.com/male+menopause", 
    "contents": "a late middle-age psychogenic condition affecting some men, who experience anxiety over diminished potency, increased fatigue, thinning and graying hair, and other signs of aging. Also called male climacterium. A popular term for the male equivalent of menopause, which occurs with increased age and ..."
  }, 
  {
    "id": "http://www.lifeextension.com/Magazine/2015/6/Male-Menopause/Page-01", 
    "contents": "In his new book, The Truth About Men and Sex, Dr. Abraham Morgentaler, associate professor at Harvard Medical School, writes about the benefits of testosterone supplementation for aging men."
  }, 
  {
    "id": "http://www.totalhealthinstitute.com/male-menopause/", 
    "contents": "Male menopause is rarely discussed in the medical community. While female menopause is an accepted medical condition with an array of treatments and therapies, male menopause is often dismissed as a figment of the patient’s imagination."
  }, 
  {
    "id": "https://health.howstuffworks.com/wellness/women/menopause/menopause-definition2.htm", 
    "contents": "Male Menopause: A Recent Concept. Male menopause is a relatively recent concept referring to a kind of emotional or psychological crisis that occurs for some men during their 40s, 50s or early 60s."
  }, 
  {
    "id": "http://www.mydr.com.au/seniors-health/male-menopause", 
    "contents": "Many men report symptoms in their 40s and 50s that may caused by ageing or declining testoterone. Find out about the symptoms and how to help."
  }, 
  {
    "id": "https://www.drugs.com/mca/male-menopause-myth-or-reality", 
    "contents": "The term \"male menopause\" is sometimes used to describe decreasing testosterone levels related to aging. Female menopause and so-called male menopause are two …"
  }, 
  {
    "id": "http://www.diamondinstitute.com/", 
    "contents": "Welcome to The Diamond Institute for Infertility and Menopause of New Jersey, Specializing in IVF - in vitro fertilization and other infertility treatments."
  }, 
  {
    "id": "http://www.safemenopausesolutions.com/ageofmenopause.html", 
    "contents": "What is the average age of menopause? We will provide the answer for you here plus menopause defined. If you are having age and first signs of menopause we provide solutions without the side effects."
  }, 
  {
    "id": "http://www.aboutcancer.com/", 
    "contents": "About Cancer: Cancer information and Treatment Cancer Videos or go to youtube site Best Web Sites Specific Treatment Techniques Cyberknife and here Gamma knife"
  }, 
  {
    "id": "http://drkomer.com/", 
    "contents": "The Komer Clinics offer innovative wellness programmes, treatment and research on women's health, men's health and brain health including research, consulting and …"
  }, 
  {
    "id": "http://patients.gi.org/topics/gallstone-pancreatitis/", 
    "contents": "Gallstone pancreatitis is inflammation of the pancreas that results from blockage of the pancreas duct by a gallstone. This occurs at the level of the sphincter of Oddi, a round muscle located at the opening of the bile duct into the small intestine."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Hormone_replacement_therapy_(menopause)", 
    "contents": "Hormone replacement therapy (HRT) in menopause is medical treatment in postmenopausal, perimenopausal, and surgically menopausal women. Its goal is to mitigate discomfort caused by diminished circulating estrogens and progesterone in menopause."
  }, 
  {
    "id": "http://www.helpfornightsweats.com/", 
    "contents": "Help For Night Sweats provides the most comprehensive yet accessible resource on night sweats causes, symptoms and treatment."
  }, 
  {
    "id": "http://www.houstonacupunctureherb.com/", 
    "contents": "Acupuncture in Houston, TX, Houston acupuncture treats infertility, low back pain, fertility, pain, migraine headache, PMS, breeching baby or breech pregnancystress, anxiety, endometriosis, neck pain, shoulder pain, allergy, iui/ivf acupuncture, quite/stop smoking, weight loss/overweight, sports injuries, hot flushes, fibromyalgia, hot flash ..."
  }, 
  {
    "id": "https://www.amazon.com/New-Menopausal-Years-Alternative-Approaches/dp/1888123036", 
    "contents": "New Menopausal Years: Alternative Approaches for Women 30-90 (Wise Woman Herbal) [Susun S. Weed] on Amazon.com. *FREE* shipping on qualifying offers. The best book on menopause is now better."
  }, 
  {
    "id": "http://www.lifeextension.com/Magazine/2015/6/Male-Menopause/Page-01", 
    "contents": "In his new book, The Truth About Men and Sex, Dr. Abraham Morgentaler, associate professor at Harvard Medical School, writes about the benefits of testosterone supplementation for aging men."
  }, 
  {
    "id": "https://www.cbsnews.com/news/male-menopause/", 
    "contents": "Hot flashes, mood swings, forgetfulness: The symptoms of menopause are notorious. As it turns out, women aren't the only ones who go through these mid-life changes. So do men. But, is there really such a thing as male menopause? That's among the topics explored in the new book, \"From Boys to Men: A ..."
  }, 
  {
    "id": "https://www.huffingtonpost.com/entry/5-reasons-men-dont-want-to-deal-with-male-menopause_us_561547d7e4b021e856d31916", 
    "contents": "Oct 08, 2015 · Many men suffer from andropause -- frequently referred to as male menopause -- which occurs when their hormone production drops. Huff/Post50 spoke to Dr. David Borenstein, an integrative medicine doctor, about the reasons why there is less transparency about andropause."
  }, 
  {
    "id": "https://www.wikihow.com/Understand-Male-Menopause", 
    "contents": "Most men can produce sperm very late in life, so male menopause is a much more gradual process than female menopause, which occurs over a distinct, much briefer time period. 2 Know the symptoms of male menopause."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Andropause", 
    "contents": "Late-onset hypogonadism is an endocrine condition as well as a result of aging. The terms \"male menopause\" and \"andropause\" are used in the popular media and are misleading, as they imply a sudden change in hormone levels similar to what women experience in menopause."
  }, 
  {
    "id": "https://www.babymed.com/menopause/male-menopause", 
    "contents": "Male menopause is not commonly diagnosed, which could mean being treated for depression as a standalone symptom. As is the case with erectile dysfunction, treatment for depression can be far more risky than testosterone supplementation."
  }, 
  {
    "id": "https://www.activebeat.com/your-health/11-true-facts-about-male-menopause/4/", 
    "contents": "4 4. Male Menopause Can Affect Sleep Another common sign of andropause is insomnia, trouble falling asleep, disturbed sleep, or interrupted sleep patterns (i.e."
  }, 
  {
    "id": "https://www.britannica.com/science/male-menopause", 
    "contents": "In menopause The term male menopause is sometimes used to describe an equivalent aging-related decline in testicular function that results in testosterone deficiency in men. This process is alternatively referred to as late-onset hypogonadism or andropause."
  }, 
  {
    "id": "http://www.homeremedycentral.com/en/home-remedies/natural-cure/male-menopause.html", 
    "contents": "Male Menopause We don’t generally hear much about it, but male menopause can be a real and viable problem for those who suffer from it. Unlike meno..."
  }, 
  {
    "id": "https://www.consumerhealthdigest.com/menopause-center/male-menopause-symptoms.html", 
    "contents": "The difference is while every woman will go over menopause, only a handful of men will experience male menopause symptoms. Know about male menopause symptoms."
  }, 
  {
    "id": "http://menalive.com/male-menopause/", 
    "contents": "Male Menopause or Andropause is a multi-dimensional change of life with hormonal, physical, psychological, social, sexual, and spiritual aspects."
  }, 
  {
    "id": "https://www.guystuffcounseling.com/counseling-men-blog/how-to-recognize-male-menopause-symptoms", 
    "contents": "What are the real-life Male Menopause Symptoms? Learn from these true stories and an expert in men's health."
  }, 
  {
    "id": "http://www.health.com/health/condition-article/0,,20408367,00.html", 
    "contents": "The symptoms of male menopause and what can be done for treatment."
  }, 
  {
    "id": "http://observer.com/2017/10/male-menopause-does-exist-these-are-the-symptoms/", 
    "contents": "Menopause in men is very different to what women experience, but as they age, men will also see changes from a decline in testosterone."
  }, 
  {
    "id": "https://www.healthline.com/health/menopause/male", 
    "contents": "“Male menopause” is a common name for andropause, a drop in testosterone that many men experience as they get older. Learn about symptoms and treatment."
  }, 
  {
    "id": "https://www.healthline.com/health/warning-signs-male-menopause", 
    "contents": "Is male menopause a myth, or should you be worried? Learn how declining levels of testosterone can affect your sex drive, sleep habits, and more as you age."
  }, 
  {
    "id": "https://www.livescience.com/36014-male-menopause-real-signs.html", 
    "contents": "In men, testosterone levels can drop slowly over time, leading to testosterone deficiency, androgen decline in the aging male (ADAM) or late onset hypogonadism (LOH)."
  }, 
  {
    "id": "https://www.mayoclinic.org/healthy-lifestyle/mens-health/in-depth/male-menopause/art-20048056", 
    "contents": "Male menopause is a catchy phrase, but it isn't necessarily accurate. Here's why."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Andropause", 
    "contents": "Terminology. Late-onset hypogonadism is an endocrine condition as well as a result of aging.. The terms \"male menopause\" and \"andropause\" are used in the popular media and are misleading, as they imply a sudden change in hormone levels similar to what women experience in menopause."
  }, 
  {
    "id": "https://www.nhs.uk/conditions/male-menopause/", 
    "contents": "Read about male menopause, where some men develop depression, loss of sex drive, erectile dysfunction and other physical and emotional symptoms when they reach their late 40s to early 50s."
  }, 
  {
    "id": "https://www.amazon.com/Surviving-Male-Menopause-Guide-Women/dp/1570714339", 
    "contents": "Surviving Male Menopause. A Guide for Women and Men [Jed Diamond] on Amazon.com. *FREE* shipping on qualifying offers. In his earlier book Male Menopause, Jed Diamond exposed the worldwide reality that the often-joked-about phenomenon of male menopause is indeed a medical"
  }, 
  {
    "id": "http://menalive.com/", 
    "contents": "MenAlive is dedicated to providing solutions to stress related problems for men including male depression, chronic pain, andropause (male menopause), irritable male …"
  }, 
  {
    "id": "http://doctorstevenpark.com/the-male-menopause-myth", 
    "contents": "It's commonly known that women going through menopause experience hot flashes, night sweats, moods swings, irritability, insomnia and weight gain, but these"
  }, 
  {
    "id": "http://whymyexsucks.com/the-top-5-natural-male-menopause-cures-that-work/", 
    "contents": "Men undergo male menopause, called andropause, and it can wreak havoc in their lives, so here are five natural cures you can try that really work."
  }, 
  {
    "id": "http://www.healthywomen.org/condition/menopause", 
    "contents": "Overview. What Is It? Menopause is a natural part of the female reproductive cycle when monthly menstrual periods end permanently, signifying the end of childbearing years."
  }, 
  {
    "id": "http://www.pfrcivf.com/", 
    "contents": "Prashanth Fertility is the leading fertility centre that provides world class Treatment for both men and women with special care for their success in Fertility"
  }, 
  {
    "id": "http://www.vermont.gov/portal/government/", 
    "contents": "The Official Website of the State of Vermont - Your gateway to information about living, working, visiting, and doing business in Vermont, and to Vermont state government."
  }, 
  {
    "id": "http://www.dailymail.co.uk/health/article-3718515/Should-taking-testosterone-pills-Experts-reveal-avoid-male-menopause.html", 
    "contents": "Should YOU be using testosterone gel? Experts reveal how to avoid the 'male menopause' In most of Europe, one fifth of men over 50 have a testosterone deficiency"
  }, 
  {
    "id": "https://www.healthline.com/health/menopause/male", 
    "contents": "“Male menopause” is a common name for andropause, a drop in testosterone that many men experience as they get older. Learn about symptoms and treatment."
  }, 
  {
    "id": "https://www.healthline.com/health/warning-signs-male-menopause", 
    "contents": "Is male menopause a myth, or should you be worried? Learn how declining levels of testosterone can affect your sex drive, sleep habits, and more as you age."
  }, 
  {
    "id": "https://www.livescience.com/36014-male-menopause-real-signs.html", 
    "contents": "In men, testosterone levels can drop slowly over time, leading to testosterone deficiency, androgen decline in the aging male (ADAM) or late onset hypogonadism (LOH)."
  }, 
  {
    "id": "https://www.mayoclinic.org/healthy-lifestyle/mens-health/in-depth/male-menopause/art-20048056", 
    "contents": "Male menopause is a catchy phrase, but it isn't necessarily accurate. Here's why."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Andropause", 
    "contents": "Terminology. Late-onset hypogonadism is an endocrine condition as well as a result of aging.. The terms \"male menopause\" and \"andropause\" are used in the popular media and are misleading, as they imply a sudden change in hormone levels similar to what women experience in menopause."
  }, 
  {
    "id": "https://www.nhs.uk/conditions/male-menopause/", 
    "contents": "Read about male menopause, where some men develop depression, loss of sex drive, erectile dysfunction and other physical and emotional symptoms when they reach their late 40s to early 50s."
  }, 
  {
    "id": "https://www.amazon.com/Surviving-Male-Menopause-Guide-Women/dp/1570714339", 
    "contents": "Surviving Male Menopause. A Guide for Women and Men [Jed Diamond] on Amazon.com. *FREE* shipping on qualifying offers. In his earlier book Male Menopause, Jed Diamond exposed the worldwide reality that the often-joked-about phenomenon of male menopause is indeed a medical"
  }, 
  {
    "id": "http://menalive.com/", 
    "contents": "MenAlive is dedicated to providing solutions to stress related problems for men including male depression, chronic pain, andropause (male menopause), irritable male …"
  }, 
  {
    "id": "http://doctorstevenpark.com/the-male-menopause-myth", 
    "contents": "It's commonly known that women going through menopause experience hot flashes, night sweats, moods swings, irritability, insomnia and weight gain, but these"
  }, 
  {
    "id": "http://whymyexsucks.com/the-top-5-natural-male-menopause-cures-that-work/", 
    "contents": "Men undergo male menopause, called andropause, and it can wreak havoc in their lives, so here are five natural cures you can try that really work."
  }, 
  {
    "id": "http://www.healthywomen.org/condition/menopause", 
    "contents": "Overview. What Is It? Menopause is a natural part of the female reproductive cycle when monthly menstrual periods end permanently, signifying the end of childbearing years."
  }, 
  {
    "id": "http://www.pfrcivf.com/", 
    "contents": "Prashanth Fertility is the leading fertility centre that provides world class Treatment for both men and women with special care for their success in Fertility"
  }, 
  {
    "id": "http://www.vermont.gov/portal/government/", 
    "contents": "The Official Website of the State of Vermont - Your gateway to information about living, working, visiting, and doing business in Vermont, and to Vermont state government."
  }, 
  {
    "id": "http://www.dailymail.co.uk/health/article-3718515/Should-taking-testosterone-pills-Experts-reveal-avoid-male-menopause.html", 
    "contents": "Should YOU be using testosterone gel? Experts reveal how to avoid the 'male menopause' In most of Europe, one fifth of men over 50 have a testosterone deficiency"
  }, 
  {
    "id": "https://www.healthline.com/health/menopause/male", 
    "contents": "“Male menopause” is a common name for andropause, a drop in testosterone that many men experience as they get older. Learn about symptoms and treatment."
  }, 
  {
    "id": "https://www.healthline.com/health/warning-signs-male-menopause", 
    "contents": "Is male menopause a myth, or should you be worried? Learn how declining levels of testosterone can affect your sex drive, sleep habits, and more as you age."
  }, 
  {
    "id": "https://www.livescience.com/36014-male-menopause-real-signs.html", 
    "contents": "In men, testosterone levels can drop slowly over time, leading to testosterone deficiency, androgen decline in the aging male (ADAM) or late onset hypogonadism (LOH)."
  }, 
  {
    "id": "https://www.mayoclinic.org/healthy-lifestyle/mens-health/in-depth/male-menopause/art-20048056", 
    "contents": "Male menopause is a catchy phrase, but it isn't necessarily accurate. Here's why."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Andropause", 
    "contents": "Terminology. Late-onset hypogonadism is an endocrine condition as well as a result of aging.. The terms \"male menopause\" and \"andropause\" are used in the popular media and are misleading, as they imply a sudden change in hormone levels similar to what women experience in menopause."
  }, 
  {
    "id": "https://www.nhs.uk/conditions/male-menopause/", 
    "contents": "Read about male menopause, where some men develop depression, loss of sex drive, erectile dysfunction and other physical and emotional symptoms when they reach their late 40s to early 50s."
  }, 
  {
    "id": "https://www.amazon.com/Surviving-Male-Menopause-Guide-Women/dp/1570714339", 
    "contents": "Surviving Male Menopause. A Guide for Women and Men [Jed Diamond] on Amazon.com. *FREE* shipping on qualifying offers. In his earlier book Male Menopause, Jed Diamond exposed the worldwide reality that the often-joked-about phenomenon of male menopause is indeed a medical"
  }, 
  {
    "id": "http://menalive.com/", 
    "contents": "MenAlive is dedicated to providing solutions to stress related problems for men including male depression, chronic pain, andropause (male menopause), irritable male …"
  }, 
  {
    "id": "http://doctorstevenpark.com/the-male-menopause-myth", 
    "contents": "It's commonly known that women going through menopause experience hot flashes, night sweats, moods swings, irritability, insomnia and weight gain, but these"
  }, 
  {
    "id": "http://whymyexsucks.com/the-top-5-natural-male-menopause-cures-that-work/", 
    "contents": "Men undergo male menopause, called andropause, and it can wreak havoc in their lives, so here are five natural cures you can try that really work."
  }, 
  {
    "id": "http://www.healthywomen.org/condition/menopause", 
    "contents": "Overview. What Is It? Menopause is a natural part of the female reproductive cycle when monthly menstrual periods end permanently, signifying the end of childbearing years."
  }, 
  {
    "id": "http://www.pfrcivf.com/", 
    "contents": "Prashanth Fertility is the leading fertility centre that provides world class Treatment for both men and women with special care for their success in Fertility"
  }, 
  {
    "id": "http://www.vermont.gov/portal/government/", 
    "contents": "The Official Website of the State of Vermont - Your gateway to information about living, working, visiting, and doing business in Vermont, and to Vermont state government."
  }, 
  {
    "id": "http://www.dailymail.co.uk/health/article-3718515/Should-taking-testosterone-pills-Experts-reveal-avoid-male-menopause.html", 
    "contents": "Should YOU be using testosterone gel? Experts reveal how to avoid the 'male menopause' In most of Europe, one fifth of men over 50 have a testosterone deficiency"
  }, 
  {
    "id": "https://www.healthline.com/health/menopause/male", 
    "contents": "“Male menopause” is a common name for andropause, a drop in testosterone that many men experience as they get older. Learn about symptoms and treatment."
  }, 
  {
    "id": "https://www.healthline.com/health/warning-signs-male-menopause", 
    "contents": "Is male menopause a myth, or should you be worried? Learn how declining levels of testosterone can affect your sex drive, sleep habits, and more as you age."
  }, 
  {
    "id": "https://www.livescience.com/36014-male-menopause-real-signs.html", 
    "contents": "In men, testosterone levels can drop slowly over time, leading to testosterone deficiency, androgen decline in the aging male (ADAM) or late onset hypogonadism (LOH)."
  }, 
  {
    "id": "https://www.mayoclinic.org/healthy-lifestyle/mens-health/in-depth/male-menopause/art-20048056", 
    "contents": "Male menopause is a catchy phrase, but it isn't necessarily accurate. Here's why."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Andropause", 
    "contents": "Terminology. Late-onset hypogonadism is an endocrine condition as well as a result of aging.. The terms \"male menopause\" and \"andropause\" are used in the popular media and are misleading, as they imply a sudden change in hormone levels similar to what women experience in menopause."
  }, 
  {
    "id": "https://www.nhs.uk/conditions/male-menopause/", 
    "contents": "Read about male menopause, where some men develop depression, loss of sex drive, erectile dysfunction and other physical and emotional symptoms when they reach their late 40s to early 50s."
  }, 
  {
    "id": "https://www.amazon.com/Surviving-Male-Menopause-Guide-Women/dp/1570714339", 
    "contents": "Surviving Male Menopause. A Guide for Women and Men [Jed Diamond] on Amazon.com. *FREE* shipping on qualifying offers. In his earlier book Male Menopause, Jed Diamond exposed the worldwide reality that the often-joked-about phenomenon of male menopause is indeed a medical"
  }, 
  {
    "id": "http://menalive.com/", 
    "contents": "MenAlive is dedicated to providing solutions to stress related problems for men including male depression, chronic pain, andropause (male menopause), irritable male …"
  }, 
  {
    "id": "http://doctorstevenpark.com/the-male-menopause-myth", 
    "contents": "It's commonly known that women going through menopause experience hot flashes, night sweats, moods swings, irritability, insomnia and weight gain, but these"
  }, 
  {
    "id": "http://whymyexsucks.com/the-top-5-natural-male-menopause-cures-that-work/", 
    "contents": "Men undergo male menopause, called andropause, and it can wreak havoc in their lives, so here are five natural cures you can try that really work."
  }, 
  {
    "id": "http://www.healthywomen.org/condition/menopause", 
    "contents": "Overview. What Is It? Menopause is a natural part of the female reproductive cycle when monthly menstrual periods end permanently, signifying the end of childbearing years."
  }
]