[
  {
    "id": "https://www.awea.org/wind-power-101", 
    "contents": "Wind power is the ability to make electricity using the air flows that occur naturally in the earth's atmosphere. Wind turbine blades capture kinetic energy from the wind and turn it into mechanical energy, spinning a generator that creates electricity."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Wind_power", 
    "contents": "Wind power is the use of air flow through wind turbines to mechanically power generators for electricity. Wind power, as an alternative to burning fossil fuels, is plentiful, renewable, widely distributed, clean, produces no greenhouse gas emissions during operation, consumes no water, and uses little land."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Wind_power", 
    "contents": "Read Third German onshore auction launched and other wind energy news & \nanalysis on Windpower Monthly."
  }, 
  {
    "id": "https://windexchange.energy.gov/what-is-wind", 
    "contents": "Wind power or wind energy describes the process by which the wind is used to generate mechanical power or electricity. Wind turbines convert the kinetic energy in the wind into mechanical power."
  }, 
  {
    "id": "http://windeis.anl.gov/guide/basics/", 
    "contents": "Basic information on wind energy and wind power technology, resources, and \nissues of concern."
  }, 
  {
    "id": "https://www.nationalgeographic.com/environment/global-warming/wind-power/", 
    "contents": "Wind power offers a sustainable option in the pursuit of renewable energy."
  }, 
  {
    "id": "https://www.windpowerexpo.org/", 
    "contents": "Sponsoring AWEA WINDPOWER 2019 gives you the opportunity to broadcast \nyour company brand. This type of exposure is invaluable to companies that want\n ..."
  }, 
  {
    "id": "https://cleantechnica.com/world-wind-power/", 
    "contents": "World wind power has been growing fast in recent years. Here's info about wind \npower and why wind power is so popular. (We also dispel some big wind myths.)"
  }, 
  {
    "id": "https://www.theguardian.com/environment/windpower", 
    "contents": "Climate Consensus - the 97% Study: wind and solar can power most of the \nUnited States. John Abraham: Wind, solar, and storage could meet 90–100% of ..."
  }, 
  {
    "id": "https://www.theguardian.com/environment/windpower", 
    "contents": ""
  }, 
  {
    "id": "http://www.nytimes.com/topic/subject/wind-power", 
    "contents": "News about wind power. Commentary and archival information about wind \npower from The New York Times."
  }, 
  {
    "id": "https://www.vox.com/energy-and-environment/2018/5/2/17290880/wind-power-renewable-energy-maps", 
    "contents": "May 2, 2018 ... Wind turbines have cropped up like dandelions across large areas of the United \nStates, and thousands more are coming. The US Department ..."
  }, 
  {
    "id": "https://www.cnbc.com/2018/06/04/from-china-to-brazil-these-are-the-world-titans-of-wind-power.html", 
    "contents": "Jun 4, 2018 ... Sustainable Energy takes a look at 10 countries embracing wind power."
  }, 
  {
    "id": "http://www.alliantenergykids.com/energyandtheenvironment/renewableenergy/022397", 
    "contents": "Using the wind to create electricity has been around for a long time, you've \nprobably seen windmills on farms. When the wind turns the blades of a windmill,\n ..."
  }, 
  {
    "id": "https://www.britannica.com/science/wind-power", 
    "contents": "May 4, 2018 ... Wind power, form of energy conversion in which turbines convert the kinetic \nenergy of wind into mechanical or electrical energy that can be ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3DSQpbTTGe_gk", 
    "contents": "Nov 26, 2012 - 3 min - Uploaded by NOVA PBS OfficialWind is a valuable renewable energy source. Limitations like cost and space  needed to build ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3DWlxz-KzebbQ", 
    "contents": "Jun 22, 2016 - 3 min - Uploaded by BloombergHello World's Ashlee Vance paid a recent visit to Iceland's capital city of  Reykjavik to see the ..."
  }, 
  {
    "id": "https://www.thewindpower.net/", 
    "contents": "The Wind Power is a comprehensive database of detailed raw statistics on the \nrapidly growing sphere of wind energy and its supporting markets. It containts ..."
  }, 
  {
    "id": "https://www.windpowermonthly.com/", 
    "contents": "Find news, insight & analysis on wind power companies, policy, technology, O&M \n& project development on Windpower Monthly."
  }, 
  {
    "id": "https://www.ge.com/renewableenergy/wind-energy/technology/what-is-wind-energy", 
    "contents": "Learn how wind turbines work, their environmental benefits, and how GE uses \nwind power to convert wind currents into valuable electricity."
  }, 
  {
    "id": "https://science.howstuffworks.com/environmental/green-science/wind-power.htm", 
    "contents": "When air moves quickly, that motion means kinetic energy, which can be \ncaptured. Learn how the simplest possible wind-energy turbine works."
  }, 
  {
    "id": "https://globalwindpower.com/", 
    "contents": "“I consider Global Wind power a very professional wind project developer, able to \n... of wind park implementation to the Technical and Commercial Management."
  }, 
  {
    "id": "https://www.bloomberg.com/news/articles/2018-06-07/u-k-wind-drought-heads-into-9th-day-with-no-relief-for-weeks", 
    "contents": "Jun 6, 2018 ... The wind drought has pushed up day-ahead power prices to the highest level for \nthe time of year for at least a decade. Apart from a surge ..."
  }, 
  {
    "id": "https://environmentamerica.org/reports/ame/wind-power-spare-enormous-energy-potential-atlantic-offshore-wind", 
    "contents": "Mar 22, 2018 ... The Atlantic coast states are dependent on fossil fuels, which pollute our air, put \nour health at risk, and contribute to global warming."
  }, 
  {
    "id": "http://www.ewea.org/", 
    "contents": "EWEA is the voice of the wind industry, promoting wind power in Europe and \nworldwide. EWEA has over 600 members active in over 50 countries, making it \nthe ..."
  }, 
  {
    "id": "https://www.washingtonpost.com/news/wonk/wp/2018/05/11/every-one-of-americas-57636-wind-turbines-mapped/", 
    "contents": "May 11, 2018 ... But a Washington Post analysis of a massive new U.S. Geological Survey \ndatabase of over 57,000 commercial wind turbines suggests that the ..."
  }, 
  {
    "id": "https://www.reuters.com/article/us-china-power-wind/china-to-tackle-wasted-energy-in-new-wind-farm-rules-idUSKCN1IQ04T", 
    "contents": "May 24, 2018 ... China's energy regulator has ordered local authorities to take heed of the grid \ncapacity when selecting new wind power projects, in an attempt ..."
  }, 
  {
    "id": "https://oilprice.com/Alternative-Energy/Wind-Power/US-Wind-Energy-Demand-Surges.html", 
    "contents": "May 7, 2018 ... Exceptional demand for wind energy has boosted the amount of commissioned \nprojects in 2018 which is now exceeding 30GW."
  }, 
  {
    "id": "https://www.brainpop.com/science/energy/windenergy/", 
    "contents": "What's that blowin' in the wind? It's the power of wind energy! In this BrainPOP \nmovie, Tim and Moby will tell you everything you've ever wanted to know about ..."
  }, 
  {
    "id": "https://www.independent.co.uk/topic/wind-power", 
    "contents": "All the latest breaking news on Wind Power. Browse The Independent's complete \ncollection of articles and commentary on Wind Power."
  }, 
  {
    "id": "https://www.soinc.org/wind-power-c", 
    "contents": "Teams will build a blade assembly that consists of any kind of propeller/pinwheel/\nrotor attached to a CD which will be used to capture wind power. Students will ..."
  }, 
  {
    "id": "https://www.renewableenergyworld.com/wind-power/tech.html", 
    "contents": "Read breaking wind energy news, wind power, wind farm, wind turbine and wind \ngenerator information and articles - Renewableenergyworld.com."
  }, 
  {
    "id": "http://www.windenergy.com/", 
    "contents": "Renewable energy where you need it: The world's leading supplier of small wind \nturbines & wind-solar hybrid systems for homes, businesses, industry, sailing ..."
  }, 
  {
    "id": "http://windenergyfoundation.org/", 
    "contents": "The Wind Energy Foundation is a nonprofit dedicated to raising public \nawareness of wind as a clean energy source through communication, research \nand ..."
  }, 
  {
    "id": "https://www.deif.com/wind-power", 
    "contents": "DEIF Wind Power Technology is a globally represented with subsidiaries and \ndistributors in Europe and Asia. Headquarters is situated in Skive, Denmark."
  }, 
  {
    "id": "https://blogs.scientificamerican.com/plugged-in/wind-energy-is-one-of-the-cheapest-sources-of-electricity-and-its-getting-cheaper/", 
    "contents": "Aug 28, 2017 ... A comprehensive survey of the wind industry shows wind energy is routinely \npurchased in bulk for just two cents per kilowatt-hour—and ..."
  }, 
  {
    "id": "https://www.greentechmedia.com/articles/read/germany-faces-a-gigawatt-scale-loss-of-onshore-wind-power", 
    "contents": "May 25, 2018 ... Under Germany's Renewable Energy Act, which took effect in 2000, renewable \nenergy sources, including onshore wind turbines, secured ..."
  }, 
  {
    "id": "http://icewind.is/en/wind-power/", 
    "contents": "IceWind specializes in designing and manufacturing small scale vertical axis \nwind turbines for providing 100% green energy in extreme weather conditions as\n ..."
  }, 
  {
    "id": "https://www.drawdown.org/solutions/electricity-generation/wind-turbines-onshore", 
    "contents": "Wind energy is at the crest of initiatives to address global warming in the coming \nthree decades. Today, 314,000 wind turbines supply nearly 4 percent of global ..."
  }, 
  {
    "id": "http://www.alternative-energy-news.info/technology/wind-power/", 
    "contents": "News and Information about Wind Energy Technologies."
  }, 
  {
    "id": "https://insideclimatenews.org/news/27032018/wind-power-blades-capacity-clean-energy-technology-jobs-ge-siemens-leeward-midamerican-repowering", 
    "contents": "Mar 28, 2018 ... Old wind farms that have towered over the same fields for more than a decade \nmay be generating more power now than ever before."
  }, 
  {
    "id": "http://www.windpower.org/en", 
    "contents": "Denmark is home to some of the world's leading wind energy companies. View \nmembers > The wind industry plays a crucial role for the Danish economy with ..."
  }, 
  {
    "id": "https://qz.com/1290429/three-us-states-signed-up-for-1200-mw-of-offshore-wind-power-this-week/", 
    "contents": "May 27, 2018 ... Three northeastern US states this week signed up for a cumulative 1200 \nmegawatts (MW) of offshore wind power, and hinted at even more ..."
  }, 
  {
    "id": "https://www.windpowerengineering.com/projects/test-measurement/new-wind-turbines-prove-efficient-in-low-winds/", 
    "contents": "Jun 11, 2018 ... VTT has investigated Finland's wind-power potential and ..."
  }, 
  {
    "id": "https://www.ucsusa.org/clean-energy/renewable-energy/how-wind-energy-works", 
    "contents": "How Wind Energy Works, part of the energy 101 series. Information on \nrenewable energy, including wind and solar power; nuclear-power safety issues \nand ..."
  }, 
  {
    "id": "https://windeurope.org/about-wind/daily-wind/", 
    "contents": "Windeurope power numbers daily With data from ... How much wind was in \nEurope's electricity yesterday? ... Share of wind energy in electricity demand. 6.8\n%."
  }, 
  {
    "id": "https://www.lmwindpower.com/", 
    "contents": "We build reliable rotor blades to reduce the cost of energy and power a cleaner \nworld with wind turbines. Join us as we make the Case for Wind: a powerful ..."
  }, 
  {
    "id": "http://www.abb.com/windpower", 
    "contents": "ABB helps customers along the complete value-chain to generate, connect, \nmonitor and control power from wind farms as well as to maintain and optimize \ntheir ..."
  }, 
  {
    "id": "https://www.bp.com/en_us/bp-us/what-we-do/wind.html", 
    "contents": "In the United States, its renewable assets include 14 onshore wind farms located \neverywhere from the Hawaiian island of Maui to the hills of northeast ..."
  }, 
  {
    "id": "https://www.bbc.com/news/business-41220948", 
    "contents": "Energy from offshore wind in the UK will be cheaper than electricity from new \nnuclear power for the first time. The cost of subsidies for new offshore wind farms\n ..."
  }, 
  {
    "id": "https://www.xcelenergy.com/energy_portfolio/renewable_energy/wind", 
    "contents": "We are fortunate to operate in parts of the country rich in wind, and we're putting \nthis resource to work for customers. As a national leader in wind power for over ..."
  }, 
  {
    "id": "http://www.primuswindpower.com/", 
    "contents": "Primus Wind Power is the leader in portable wind power turbines and maker of \nthe of Air Breeze Turbine, Air 30 Turbine & Air 40 Turbine."
  }, 
  {
    "id": "https://www.cbsnews.com/news/texas-leader-in-renewable-energy-wind-turbines/", 
    "contents": "4 days ago ... Traditionally conservative state is leading the way in renewable energy. Why? \nOne mayor says it's just good business."
  }, 
  {
    "id": "https://www.motherearthnews.com/renewable-energy/wind-power/home-wind-power-zm0z13amzrob", 
    "contents": "Seeking residential wind power for energy self-sufficiency? Find out whether a \nhome wind turbine is right for you."
  }, 
  {
    "id": "https://onlinelibrary.wiley.com/journal/10991824", 
    "contents": "Wind Energy offers a major forum for the reporting of advances in this rapidly \ndeveloping technology with the goal of realising the world-wide potential to ..."
  }, 
  {
    "id": "http://www.wired.co.uk/article/biggest-wind-turbine-scotland-aberdeen-vattenfall-energy", 
    "contents": "Apr 22, 2018 ... When completed this summer, the record-breaking wind farm will be able to \ngenerate more than 70 per cent of Aberdeen's domestic electricity ..."
  }, 
  {
    "id": "http://www.pbs.org/now/classroom/wind.html", 
    "contents": "High school lesson plan on wind power technology."
  }, 
  {
    "id": "https://www.coursera.org/learn/wind-energy", 
    "contents": "Wind Energy from Technical University of Denmark (DTU). How tall is a modern \nwind turbine and how can it possibly generate power from the wind? This course\n ..."
  }, 
  {
    "id": "https://www.eia.gov/energyexplained/index.php%3Fpage%3Dwind_home", 
    "contents": "Dec 5, 2017 ... Wind is caused by uneven heating of the earth's surface by the sun. Because the \nearth's surface is made up of different types of land and water, ..."
  }, 
  {
    "id": "http://www.dictionary.com/browse/wind-power", 
    "contents": "Wind power definition, power derived from wind: used to generate electricity or \nmechanical power. See more."
  }, 
  {
    "id": "https://4-h.org/parents/curriculum/wind-energy/", 
    "contents": "The Power of the Wind teaches youth to design, create, build, and test wind \npowered devices and explore wind as a potential energy source in your \ncommunity."
  }, 
  {
    "id": "http://www.latimes.com/opinion/op-ed/la-oe-bryce-backlash-against-wind-energy-20170227-story.html", 
    "contents": "Feb 27, 2017 ... Urban voters may like the idea of using more wind and solar energy, but the push \nfor large-scale renewables is creating land-use conflicts in ..."
  }, 
  {
    "id": "https://www.engie.com/en/businesses/electricity/onshore-wind-power/how-do-wind-power-plants-work/", 
    "contents": "When the wind, a natural form of energy, is capable of creating electricity or a \nmechanical force, this is wind power. Find out how wind farms work, those \ndevices ..."
  }, 
  {
    "id": "http://www.nablawindpower.com/", 
    "contents": "Nabla Wind Power is a Wind Engineering ISP focused in offering Services for \nWind Turbines Design Life Detection and Extension."
  }, 
  {
    "id": "http://gwec.net/global-figures/graphs/", 
    "contents": "Global statistics. GWEC produces graphs showing the exciting growth of the wind \npower industry around the world. Media, companies, research institutes and ..."
  }, 
  {
    "id": "https://www.acciona.com/renewable-energy/wind-power/", 
    "contents": "In last years people have begun to give more importance to wind power as an \nalternative to fossil fuels. What do you think? Learn more about wind energy."
  }, 
  {
    "id": "https://www.siemens.com/global/en/home/markets/wind.html", 
    "contents": "Siemens turns wind into an asset. Wind energy solutions along the onshore and \noffshore value chain help the industry lead the way to a sustainable future."
  }, 
  {
    "id": "https://www.studentenergy.org/topics/wind-power", 
    "contents": "Wind Energy refers to technology that converts the air's motion into mechanical \nenergy usually for electricity production."
  }, 
  {
    "id": "https://www.audubon.org/conservation/audubons-position-wind-power", 
    "contents": "Audubon strongly supports properly sited wind power as a renewable energy \nsource that helps reduce the threat posed to birds and people by climate change."
  }, 
  {
    "id": "http://www.windenergy.org.nz/wind-energy/nz-windfarms", 
    "contents": "New Zealand has 17 wind farms operating. These wind farms currently have a \ncombined installed capacity of 690 megawatts. They supply around 6% of New ..."
  }, 
  {
    "id": "https://www.in.gov/oed/2413.htm", 
    "contents": "Wind power, electricity generated by capturing the wind's energy with modern \nwind turbines, is one of the lowest-cost renewable electricity alternatives currently\n ..."
  }, 
  {
    "id": "https://www.nrel.gov/wind/", 
    "contents": "NREL innovates to bring wind energy research, development, and deployment to \nmarket."
  }, 
  {
    "id": "http://www.cielowind.com/", 
    "contents": "Cielo Wind Power, LP (Cielo), is committed to developing, owning and operating \nthe most cost-effective and environmentally responsible wind power facilities ..."
  }, 
  {
    "id": "http://wwf.panda.org/knowledge_hub/teacher_resources/project_ideas/green_power/", 
    "contents": "'Green electricity' is power produced from sources that do not harm the \nenvironment. Green power production technologies are those that that clearly \nreduce the ..."
  }, 
  {
    "id": "https://www.vttresearch.com/services/low-carbon-energy/wind-energy", 
    "contents": "By 2030 wind power will grow to a major generation technology, expected to \nproduce around 15 % of global electricity."
  }, 
  {
    "id": "https://emp.lbl.gov/projects/wind-neighbor-survey", 
    "contents": "The installed wind power capacity in the United States through the end of 2016 \nwas capable of supplying approximately 6.2% of the nation's electricity demand ..."
  }, 
  {
    "id": "https://www.midamericanenergy.com/wind-energy.aspx", 
    "contents": "In August 2016, The Iowa Utilities Board approved our request to invest $3.6 \nbillion to install additional wind turbines in Iowa by year-end 2019. The project ..."
  }, 
  {
    "id": "https://pse.com/aboutpse/EnergySupply/Pages/Wind-Power.aspx", 
    "contents": "Wind Power. PSE: a leader in delivering clean, renewable energy. Puget Sound \nEnergy is the Pacific Northwest's largest utility producer of renewable energy."
  }, 
  {
    "id": "https://www.newlook.dteenergy.com/wps/wcm/connect/dte-web/home/community-and-news/common/renewable-energy/wind-energy", 
    "contents": "DTE Energy, the largest investor in renewable energy in Michigan, is helping to \nmake eco-friendly wind power a major force in our clean energy future."
  }, 
  {
    "id": "https://www.bostonglobe.com/business/2018/05/23/two-big-wind-farms-rise-off-coast-martha-vineyard/vLmWsUSdLzrh6M3CCZK2YL/story.html", 
    "contents": "May 23, 2018 ... Officials in Massachusetts and Rhode Island announced contracts Wednesday \nfor two massive offshore wind farms off Martha's Vineyard, ..."
  }, 
  {
    "id": "http://www.bbc.co.uk/climate/adaptation/wind_power.shtml", 
    "contents": "Wind Power. windy beach The UK's position in the world makes it one of the best \nlocations for using renewable energy – we certainly get wind and occasionally ..."
  }, 
  {
    "id": "http://www.hitachi.com/products/power/wind-turbine/index.html", 
    "contents": "Hitachi has begun by getting to know the wind.Wind flow and wind direction \nchange virtually every second.The power of wind can be harnessed and \nconverted ..."
  }, 
  {
    "id": "https://www.khanacademy.org/partner-content/nova/energy/v/windpower", 
    "contents": "Nov 26, 2012 - 3 minUnlike the water-pumping windmills that inspired them, modern wind turbines  generate ..."
  }, 
  {
    "id": "https://orsted.com/en/Our-business/Wind-Power", 
    "contents": "As a global leader within clean energy, we contribute to transforming the world's \nenergy systems from fossil based to carbon neutral sources of energy."
  }, 
  {
    "id": "https://www.cleanenergycouncil.org.au/technologies/wind-energy.html", 
    "contents": "Wind power is currently the cheapest source of large-scale renewable energy. It \ninvolves generating electricity from the naturally occurring power of the wind."
  }, 
  {
    "id": "http://www.irena.org/wind", 
    "contents": "Wind power is one of the fastest-growing renewable energy technologies. Usage \nis on the rise worldwide, in part because costs are falling."
  }, 
  {
    "id": "https://arstechnica.com/science/2018/04/the-value-of-offshore-wind-energy-what-the-us-is-missing-out-on/", 
    "contents": "Apr 26, 2018 ... The US is a latecomer to the world of offshore wind. The first commercial offshore \nwind farm in the US, a small, five-turbine, 30MW installation ..."
  }, 
  {
    "id": "http://theconversation.com/are-public-objections-to-wind-farms-overblown-95728", 
    "contents": "May 2, 2018 ... While most surveys suggest that the public generally supports wind and solar \npower, opposition from local communities and residents ..."
  }, 
  {
    "id": "http://energy.sandia.gov/energy/renewable-energy/wind-power/", 
    "contents": "Increasing the amount of electricity produced from a given thermal energy input. \n... Wind Energy Tara Camacho-Lopez 2018-04-16T18:29:55+00:00 ..."
  }, 
  {
    "id": "http://www.nmcc.edu/academics/programs/academic-programs/wind-power-technology/", 
    "contents": "The program offers broad fundamental training in the electrical, electronic, and \nmechanical aspects of the wind power industry, with a focus on wind turbine ..."
  }, 
  {
    "id": "https://www.pnm.com/solar-and-wind-energy", 
    "contents": "Solar & Wind Energy. PNM is committed to renewable energy and to New \nMexico's future. We're constantly expanding our renewable energy capacity while\n ..."
  }, 
  {
    "id": "https://www.en.aau.dk/education/master/energy-engineering/specialisations/wind-power-systems", 
    "contents": "This specialisation focuses on for example generators, power electronics, control \nengineering and power system technology related to wind power applications."
  }, 
  {
    "id": "http://www.greenbyte.com/resources/evolution-of-wind-power/", 
    "contents": "This interactive infographic shows the cumulative installed wind power capacity \nper country, continent and the world as a whole between 1981-2017. Drag the ..."
  }, 
  {
    "id": "http://www.clipperwind.com/", 
    "contents": "Energy drives our world and our economy. Wind energy - clean, renewable and \ncost competitive - is a practical solution. We believe sustaining cost effective ..."
  }, 
  {
    "id": "http://blogs.edf.org/energyexchange/2018/04/17/as-moratorium-on-north-carolina-wind-power-winds-down-economic-opportunity-appears-on-the-horizon/", 
    "contents": "Apr 17, 2018 ... At the Amazon Wind Farm, landowners collect $6,000 in lease ... The most \ncommon concern about wind power last session seemed to stem ..."
  }, 
  {
    "id": "https://www.energymatters.com.au/components/wind-energy/", 
    "contents": "Wind power involves converting wind energy into electricity by using wind \nturbines. A wind turbine is composed of 3 propellers-like blades called a rotor."
  }, 
  {
    "id": "https://www.eon.com/en/new-energy/new-energy-world/5-myths-of-wind-energy.html", 
    "contents": "Given the allegations that we have read on our social media channels against \nwind energy, it only seems slightly exaggerated. To us, the different regional ..."
  }, 
  {
    "id": "https://www.duke-energy.com/our-company/about-us/businesses/renewable-energy/wind-energy", 
    "contents": "Duke Energy Renewables generates more than 1600 megawatts of wind power \nat 15 wind farms across the country, providing enough zero-carbon energy to ..."
  }, 
  {
    "id": "http://www.newsweek.com/whats-true-cost-wind-power-321480", 
    "contents": "Apr 11, 2015 ... Most cost estimates for wind power disregard the heavy burden of these \nsubsidies on US taxpayers. But if Americans realized the full cost of ..."
  }, 
  {
    "id": "https://www.eniday.com/en/technology_en/gas-wind-allies/", 
    "contents": "The best backup to integrate wind power's intermittency issues is natural gas."
  }
]