[
  {
    "id": "https://www.yelp.com/search%3Ffind_desc%3Dland%2Bsurveyor%26find_loc%3DSan%2BFrancisco%252C%2BCA", 
    "contents": "Reviews on Land surveyor in San Francisco, CA - Geometrix Surveying \nEngineering, Foresight Land Surveying, American Land Surveying, Westover \nSurveying, ..."
  }, 
  {
    "id": "http://www.flsurveys.com/", 
    "contents": "Foresight Land Surveying is a San Francisco bay area based firm providing land surveying and mapping services to the Bay Area and beyond. ... Licensed surveyors: A licensed land surveyor performs every step of your project from research and contract preparation, to overall execution and final product delivery."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Surveying", 
    "contents": "Surveying or land surveying is the technique, profession, and science of determining the terrestrial or three-dimensional positions of points and the distances and angles between them. A land surveying professional is called a land surveyor."
  }, 
  {
    "id": "https://www.meridiansurvey.com/", 
    "contents": "Meridian Survey is a San Francisco Bay Area Licensed Land Surveyor Offering \nHydrographic/Bathymetric, Topographic, ADA, SFO, SF HRC LBE, DRONE, ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3DSPCewaAfqPA", 
    "contents": "Jul 26, 2017 - 6 min - Uploaded by Practical EngineeringA primer on one of the most important companions to civil engineering: land surveyors. First ..."
  }, 
  {
    "id": "http://www.sflandsurveyor.com/", 
    "contents": "Knob. Seher Logo Serving the Bay Area. Professional Land Surveyor. Surveying \nServices. Condo Conversion. Philosophy. Projects. Contact. Portfolio ..."
  }, 
  {
    "id": "https://www.homeadvisor.com/cost/architects-and-engineers/hire-a-land-surveyor/", 
    "contents": "A land survey, in the simplest terms, defines the boundaries of your plot. It is an assessment performed by a professional surveyor."
  }, 
  {
    "id": "http://www.geometrixsurvey.com/", 
    "contents": "Geometrix Surveying Engineering Inc. offers professional land surveying services \nto the San Francisco Bay Area. We are responsive and highly experienced."
  }, 
  {
    "id": "https://www.westoversurveying.com/", 
    "contents": "Professional Land Surveyors In San Francisco and the Bay Area with over 30 \nyears experience. Boundary, condominium, topographic, ALTA and monitoring ..."
  }, 
  {
    "id": "http://www.calvadasurveying.com/san-francisco-land-surveyor.php", 
    "contents": "Find San Francisco land surveyors at Calvada Surveying, Inc. We, as a leading \nland surveyor provide professional land surveying services in San Francisco, ..."
  }, 
  {
    "id": "http://www.bgtsurveying.com/", 
    "contents": "BGT Land Surveying is a full service land surveying firm providing exceptional \nprofessional services to private, commercial, and public entities in their ..."
  }, 
  {
    "id": "http://www.lastevensinc.com/", 
    "contents": "land surveyors provide regulation specific services needed for FEMA regulations \npertaining to Flood Insurance, the National Flood Insurance Program, NFIP, ..."
  }, 
  {
    "id": "https://www.pointtopointsurvey.com/", 
    "contents": "Point to Point Land Surveyors, Inc. has more than a century of combined \nexperience and is the land surveying firm of choice across multiple states."
  }, 
  {
    "id": "https://www.plso.org/", 
    "contents": "Professional Land Surveyors of Oregon. Keep on track for the career you want by \nnetworking and collaborating with your professional community."
  }, 
  {
    "id": "https://www.plso.org/education%26careers", 
    "contents": "What are the steps to becoming a professional land surveyor in Oregon? 1. \nEducation (Check out Scholarship Opportunities Here). Four-Year Program."
  }, 
  {
    "id": "https://www.mckissock.com/land-surveyor/", 
    "contents": "McKissock offers high-quality Continuing Education Land Surveyor Courses. \nComplete your continuing education courses with an education provider you can\n ..."
  }, 
  {
    "id": "https://nvbpels.org/professionals/land-surveyors", 
    "contents": "Become a professional land surveyor in Nevada by applying for a comity license. \n... the state-specific survey exam prior to becoming a licensed land surveyor in ..."
  }, 
  {
    "id": "https://westwoodps.com/about-us/media/corporate-surveying-topics/endangered-species-land-surveyor", 
    "contents": "Apr 12, 2018 ... The Minnesota Society of Professional Surveyors (MSPS) launched a letter \ncampaign recently on behalf of Minnesota-based College, St. Cloud ..."
  }, 
  {
    "id": "https://www.plsc.net/", 
    "contents": "This content review survey is being sent to surveying practitioners, ... \nPennsylvania Society of Land Surveyors Summer Conference 2018, 23 Aug \n2018."
  }, 
  {
    "id": "https://www.indeed.com/q-Land-Surveyor-l-South-Carolina-jobs.html", 
    "contents": "21 Land Surveyor jobs available in South Carolina on Indeed.com. Search from \nLand Surveyor, Associate, Assistant Technician, Construction Coordinator, ..."
  }, 
  {
    "id": "https://www.dllr.state.md.us/cgi-bin/ElectronicLicensing/OP_search/OP_search.cgi%3Fcalling_app%3DLS::LS_qselect", 
    "contents": "If you have any questions about performing the search or the results you receive, \nyou may contact the Maryland Board for Professional Land Surveyors, ..."
  }, 
  {
    "id": "https://www.mnsurveyor.com/%3Fcollege_universities", 
    "contents": "The Minnesota Land Surveyors (MLS) Foundation gives scholarships annually to \nstudents pursuing careers in surveying. For further information and application ..."
  }, 
  {
    "id": "https://www.mnsurveyor.com/%3Fpage%3Dyour_land_and_survey", 
    "contents": "Professional land surveying and mapping services will involve less time, concern \nand expense than moving a building or other improvements, revising your land ..."
  }, 
  {
    "id": "https://www.bergerlandsurveying.com/", 
    "contents": "830-217-4228 - FREE estimates. Locally owned for 13 years. Land surveying. \nTitle surveys. Boundary surveys. Topographic surveys. Residential lot surveys."
  }, 
  {
    "id": "https://www.idfpr.com/profs/landsurv.asp", 
    "contents": "Land Surveyor Professions Licensed by IDFPR: Land Surveyor, Licensed; \nDesign Firm, Registered; Surveyor Intern. License Information. Professional Land\n ..."
  }, 
  {
    "id": "https://www.canyons.edu/Departments/SURV/Pages/Land-Surveying-Degree-Certificate.aspx", 
    "contents": "The focus of the Land Surveying program is to provide the student with a \nthorough background in land surveying and mapping in addition to an \nintroduction to ..."
  }, 
  {
    "id": "https://issuu.com/landsurveyor", 
    "contents": "I am the administrator of Land Surveyors United social network, where \nprofessional land surveyors come to discuss the industry, problems and solutions \nin the ..."
  }, 
  {
    "id": "https://www.onetonline.org/link/summary/17-1022.00", 
    "contents": "Sample of reported job titles: City Surveyor, County Surveyor, Land Surveyor, \nMine Surveyor, Registered Land Surveyor, Survey Manager, Survey Party Chief,\n ..."
  }, 
  {
    "id": "https://www.sec.state.vt.us/professional-regulation/list-of-professions/land-surveyors.aspx", 
    "contents": "Feb 13, 2018 ... The Board of Land Surveying is a seven-member board created by the \nlegislature whose members are appointed by the governor to administer ..."
  }, 
  {
    "id": "http://www.maine.gov/pfr/professionallicensing/professions/surveyors/exam_pls.html", 
    "contents": "Professional Land Surveyor Examinations. Maine Specific Multiple Choice Exam \nDates. April 13, 2018. Application Deadline: March 1st. October 19, 2018."
  }, 
  {
    "id": "https://mn.gov/elicense/a-z/%3Fid%3D1083-231700", 
    "contents": "Land Surveyor In-Training under the direct supervision of a licensed land \nsurveyor. Minnesota Board of Architecture, Engineering, Land Surveying, \nLandscape ..."
  }, 
  {
    "id": "https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1300/land-surveying-series-1373/", 
    "contents": "Degree: land surveying; or civil engineering with a surveying option/emphasis. \nThe civil engineering major must have included at least 6 semester hours of ..."
  }, 
  {
    "id": "https://www.co.dunn.wi.us/index.asp%3FSEC%3DDA28BFFB-56B2-45DB-9476-6A1EED918482%26Type%3DB_BASIC", 
    "contents": "The County Surveyor performs assigned duties and executes surveys required \nby the county. The County Surveyor DOES NOT work as a private land surveyor ..."
  }, 
  {
    "id": "http://dlr.sd.gov/btp/land_surveyors.aspx", 
    "contents": "The South Dakota Board of Technical Professions licenses and regulates the \nprofessions of architects, professional engineers, land surveyors, landscape ..."
  }, 
  {
    "id": "http://www.dol.wa.gov/business/engineerslandsurveyors/survintraining.html", 
    "contents": ""
  }, 
  {
    "id": "http://www.lemke-ls.com/", 
    "contents": "Lemke Land Surveying provides professional land surveying services to the \nOklahoma and Texas region."
  }, 
  {
    "id": "http://welchinc.com/", 
    "contents": "Land surveying firm Welch Surveyors WBE/DBE operates in West Bridgewater, \nMassachusetts MA, Rhode Island RI, Connecticut CT, New Hampshire NH, Title ..."
  }, 
  {
    "id": "https://www.matc.edu/tas/certificates/land-surveying.cfm", 
    "contents": "Map this path to success: In conjunction with an associate degree in Civil \nEngineering Technology, this advanced certificate meets the land surveyor \nregistration ..."
  }, 
  {
    "id": "https://www.ksls.com/Find-A-Surveyor", 
    "contents": "Kansas Society of Land Surveyors - Association for Land Surveyors."
  }, 
  {
    "id": "https://mjslandsurvey.com/", 
    "contents": "We specialize in a full range of surveying services including: title surveys, \nboundary surveys, topographic surveys, FEMA elevation certificates & site plans."
  }, 
  {
    "id": "https://www.carowlandsurveying.com/", 
    "contents": "Carow Land Surveying – professional land surveyors in Wisconsin. Land surveys \nthat include elevation, boundary, plat map surveys, construction staking ..."
  }, 
  {
    "id": "https://www.ok.gov/pels/Applicants/Land_Surveyor_Intern_Application/index.html", 
    "contents": "FS Information / Application for Certification as a Land Surveyor Intern. Beginning \nJanuary 2, 2014, all FS examinations are now administered via computer ..."
  }, 
  {
    "id": "https://degrees.lsc.edu/land-surveyor/", 
    "contents": "Overview. Want to be a land surveyor or civil engineer? Start your education at \nLake Superior College in Duluth, MN, then continue to a four-year college."
  }, 
  {
    "id": "https://www.oplc.nh.gov/land-surveyors/", 
    "contents": "The purpose of the Board of Land Surveyors is to regulate the licensing of land \nsurveyors and the practice of land surveying in the State of New Hampshire."
  }, 
  {
    "id": "http://www.sctcc.edu/degrees-programs/land-surveyingcivil-engineering", 
    "contents": "If you love the outdoors and the idea of not being chained to a desk, the Land \nSurveying and Civil Engineering Technology program may be the perfect fit."
  }, 
  {
    "id": "https://www.linkedin.com/jobs/view/land-surveyor-geodesist-survey-technician-at-swift-navigation-711471876", 
    "contents": "May 23, 2018 ... Posted 26 days ago. Swift Navigation is looking for a survey professional to assist \nwith GNSS station management. At S...See this and similar ..."
  }, 
  {
    "id": "https://www.nebraskasurveys.com/", 
    "contents": "MISSION STATEMENT Our mission is to provide professional land surveying \nservices throughout Nebraska for all types of land development, from concept"
  }, 
  {
    "id": "https://www.coloradomesa.edu/wccc/programs/land-surveying-geomatics.html", 
    "contents": "Land Surveying involves the scientific process of measuring the three-\ndimensional aspects of land, which includes the horizontal distance, direction, \nangles and ..."
  }, 
  {
    "id": "http://www.arcamonesurveyors.com/", 
    "contents": "Arcamone Land Surveyors, LLC would like to provide you with timely, accurate, \nand quality land surveying services, which include: Property Surveys"
  }, 
  {
    "id": "https://www.macomb.edu/future-students/programs/land-surveying-technology.html", 
    "contents": "Land Surveying Technology - Office Technician. In this program, you will be \nintroduced to the surveying principles and techniques used in the construction of\n ..."
  }, 
  {
    "id": "https://www.dec.ny.gov/about/46219.html", 
    "contents": "Detailed qualifications for Land Surveyor job postings."
  }, 
  {
    "id": "https://www.bls.gov/ooh/architecture-and-engineering/surveyors.htm", 
    "contents": "Apr 24, 2018 ... Surveyors make precise measurements to determine property boundaries. They \nprovide data relevant to the shape and contour of the Earth's ..."
  }, 
  {
    "id": "https://www.wemapit.com/", 
    "contents": "Plisga & Day provide quality land surveying, GPS mapping, title research, \nconstruction layout, photo control, municipal GIS services, flood mapping and \nmany ..."
  }, 
  {
    "id": "http://www.meridianlandsurveying.com/", 
    "contents": "Meridian Land Surveying offers Professional Land Surveying Services in the St \nLouis and St Charles Metro areas and throughout the State of Missouri."
  }, 
  {
    "id": "https://psls.org/Resources/Documents/EngLSGeo%2520Act%2520367%255B1%255D.pdf", 
    "contents": "Land Surveyors and Geologists. Commonwealth of Pennsylvania. Printed in \nSeptember 2012. Engineer,. Land Surveyor. And Geologist. Registration Law."
  }, 
  {
    "id": "http://www.gvglandsurveyors.com/", 
    "contents": "gilbert vanguilder land surveyor, pllc in Clifton Park is professional Land \nSurveying Firm."
  }, 
  {
    "id": "https://www.governmentjobs.com/careers/minnehaha/jobs/2051453/land-surveyor", 
    "contents": "The Minnehaha County Highway Department invites applications for a Land \nSurveyor to join our top performing team of experienced professionals."
  }, 
  {
    "id": "https://www.sccollege.edu/survey", 
    "contents": "Land Surveyors make exact measurements and determine property boundaries, \nprovide data relevant to the shape, contour, gravitation, location, elevation, ..."
  }, 
  {
    "id": "https://www.dot.state.mn.us/jobs/grad-eng-land-surv.html", 
    "contents": "Graduate Engineer and Land Surveyor Trainee Program. About. Big picture \nexperience. As a trainee in these programs, you'll have the opportunity to expand\n ..."
  }, 
  {
    "id": "http://www.bpelsg.ca.gov/consumers/lic_lookup.shtml", 
    "contents": "License Lookup (Verification) for California-Licensed Professional Engineers, \nLand Surveyors, Geologists, and Geophysicists ..."
  }, 
  {
    "id": "http://www.nelsoncounty-va.gov/Organization/w-morris-foster-land-surveyors/", 
    "contents": "W. Morris Foster -Land Surveyor. Physical Address. 4479 Rockfish Valley Hwy. \nNellysford, VA 22958. Mailing Address. PO Box 174. Nellysford, VA 22958."
  }, 
  {
    "id": "http://txls.texas.gov/education/", 
    "contents": "Need to find a surveyor or surveying firm? Want to see a list of all the surveyors \nregistered in a county? Use the “Go to Roster Search” link which will redirect you\n ..."
  }, 
  {
    "id": "https://portal.ct.gov/DCP/License-Services-Division/All-License-Applications/Professional-Engineers-and-Land-Surveyors-Licensing", 
    "contents": "NEW!! The Connecticut Land Surveyor (2 hour - exam) will be administered by \nPSI licensure: certification. You can contact them at www.psiexams.com or (800)\n ..."
  }, 
  {
    "id": "https://www.colorado.gov/pacific/dora/AES", 
    "contents": "State Board of Licensure for Architects, Professional Engineers and Professional \nLand Surveyors. Architects examining plans. Find Applications & Forms."
  }, 
  {
    "id": "https://www.commerce.alaska.gov/web/cbpl/professionallicensing/boardofarchitectsengineersandlandsurveyors.aspx", 
    "contents": "Alaska Board of Architects, Engineers, and Land Surveyors, AELS, Division of \nCorporations, Business and Professional Licensing. This is the new version of \nthe ..."
  }, 
  {
    "id": "https://dsps.wi.gov/pages/Professions/LandSurveyorProfessional/Default.aspx", 
    "contents": "Per Wisconsin State Statutes 440.08 (2), the required renewal date for the \nProfessional Land Surveyor credential is 01/31/even years. Should you receive \nyour ..."
  }, 
  {
    "id": "https://plb.iowa.gov/board/engineers-land-surveyors", 
    "contents": "... or pending agency rules for the Board, contact the Agency Rules Administrator: \nAgency Rules Administrator Engineering & Land Surveying Examining Board"
  }, 
  {
    "id": "http://ohiosurveyor.org/", 
    "contents": "WE'VE MOVED! Please note our change of address: Professional Land \nSurveyors of Ohio, Inc. 150 East Wilson Bridge Road, Suite 300. Worthington, OH \n43085."
  }, 
  {
    "id": "https://www.towson.edu/cla/departments/geography/undergrad/landsurvey.html", 
    "contents": "Learn the latest techniques, skills, and tools required to conduct land surveying. \nThe major in geography and land surveying is based on a transfer articulation ..."
  }, 
  {
    "id": "http://www.dpor.virginia.gov/Boards/APELS/", 
    "contents": "The Board for Architects, Professional Engineers, Land Surveyors, Certified \nInterior Designers and Landscape Architects (APELSCIDLA Board) examines, ..."
  }, 
  {
    "id": "https://southeasttech.edu/programs/ViewProgram.aspx%3Fid%3D28%26ContentID%3D0", 
    "contents": "Your career opportunities include working as a land surveyor, CAD technician, \nRight of Way Specialist, construction surveyor, GPS specialist or in sales."
  }, 
  {
    "id": "http://www.jphlandsurveying.com/", 
    "contents": "Our team working with your team from project inception to completion - It Begins \nHere! Our Tools. Welcome to JPH Land Surveying, Inc., where we dedicate ..."
  }, 
  {
    "id": "http://www.pineridgesurveying.com/", 
    "contents": "FREE estimates, Affordable, Honest, Reliable, Experts, Local-based, Dedication, \nGuaranteed best service. Land surveying, Property. Call 715-682-2969."
  }, 
  {
    "id": "https://www.stcloudstate.edu/programs/land-surveying-certificate/default.aspx", 
    "contents": "Students who pursue a Land Surveying Certificate must already have a four-year \ndegree in a field related to surveying such as civil engineering and want to ..."
  }, 
  {
    "id": "http://www.bdp.state.ri.us/surveyors/", 
    "contents": "Important Reminder to Registered Professional Land Surveyors - Each entity that \npractices or offers to practice land surveying in Rhode Island must hold a ..."
  }, 
  {
    "id": "https://www.hayneslandsurveyor.com/", 
    "contents": "Contact us at Haynes Land Surveyors in Syosset, NY to schedule a title survey of \nyour property before purchasing your dream home. Call or Visit us today!"
  }, 
  {
    "id": "https://wit.edu/continuing-ed/programs/certificate/land-surveying", 
    "contents": "Wentworth's Professional Land Surveying (PLS) Certificate program is intended \nfor professionals who currently work in the land surveying field and seek to ..."
  }, 
  {
    "id": "http://www.wosurvey.com/", 
    "contents": "Welch & O'Donoghue in Stafford and Avon NY Since 1987 - Rochester, \nCanandaigua, Genesee Valley and Finger Lakes Land Surveyors - Mortgage, \nBoundary, ..."
  }, 
  {
    "id": "https://www.lansdalesurveying.com/", 
    "contents": "Contact Lansdale Surveying Inc at 513-831-9970 in Milford, OH to schedule an \nappointment for land surveying services."
  }, 
  {
    "id": "https://www.payscale.com/research/US/Job%3DLand_Surveyor/Hourly_Rate", 
    "contents": "As of Jun 2018, the average pay for a Land Surveyor is $19.55 /hr or $61111 \nannually."
  }, 
  {
    "id": "http://rednissmead.com/an-interview-with-land-surveyor-chris-voight/", 
    "contents": "An interview with Chris Voight by Marie Patel (R&M's Marketing Coordinator). \nChris Voight is a Senior Land Surveyor and he has been with Redniss & Mead \nfor ..."
  }, 
  {
    "id": "http://www.ilga.gov/legislation/BillStatus.asp%3FDocNum%3D3322%26GAID%3D14%26DocTypeID%3DHB%26LegId%3D105062%26SessionID%3D91%26GA%3D100", 
    "contents": "Synopsis As Introduced Amends the Illinois Professional Land Surveyor Act of \n1989. Changes references to \"Land Surveyor-in-Training\" to references to ..."
  }, 
  {
    "id": "http://www.samhirota.com/licensed-land-surveyor.html", 
    "contents": "Professional Land Surveyor License in the State of Hawaii; Five years of \nexperience with progressively increasing knowledge and responsibility as a \nSurveyor ..."
  }, 
  {
    "id": "https://dpr.delaware.gov/boards/landsurveyors/landsurveyor/", 
    "contents": "Apply for Land Surveyor licensure by reciprocity when you hold a current land \nsurveying license in another jurisdiction (state, U.S. territory or District of ..."
  }, 
  {
    "id": "https://www.regionallandsurveyors.com/", 
    "contents": "Based in central North Carolina, Regional Land Surveyors is licensed in North \nCarolina, South Carolina, Virginia, California, Colorado, and Wyoming."
  }, 
  {
    "id": "http://www.uwyo.edu/civil/landsurvey/", 
    "contents": "Land Surveying. \"The program has instilled in me a love and respect for the \nprofession. While many skills are still in serious need of honing, I believe that the\n ..."
  }, 
  {
    "id": "https://www.mass.gov/professional-engineers-and-land-surveyors-licensing", 
    "contents": "Find information on applying for, renewing, checking, and learning about \nengineering and land surveying licenses."
  }, 
  {
    "id": "https://www.ayresassociates.com/projects/land-surveying/", 
    "contents": "We provide land survey services including boundary, construction staking, \ntopographic, hydrographic, right-of-way plats, and ground control services."
  }, 
  {
    "id": "http://www.furmanland.com/", 
    "contents": "Furman Land Surveyors, Inc. is a professional land surveying company that has \nbeen serving Amarillo and the Southwestern United States for over 35 years."
  }, 
  {
    "id": "https://www.pinnaclesurvey.com/", 
    "contents": "Land Surveyors experienced in all types of residential and commercial surveys, \nALTA surveys, large boundary surveys and more. Click here to learn more."
  }, 
  {
    "id": "http://releeinc.com/employment/full-time-land-surveyor-job-opening/", 
    "contents": "Mar 16, 2018 ... Robert E. Lee & Associates, Inc. is seeking motivated applicants for a full-time \nLand Surveyor position. The ideal candidate should have a ..."
  }, 
  {
    "id": "https://cplandsurveying.com/", 
    "contents": "Highly recommended, licensed land Survey Company in the Los Angeles County \narea. Christensen & Poluff is a full service land surveying family owned ..."
  }, 
  {
    "id": "https://www.westalliswi.gov/index.aspx%3FNID%3D1309", 
    "contents": "The City of West Allis or its staff cannot perform property surveys, mark lot corners, or mark and establish lot lines.\n These procedures cannot be done by the City of West Allis or its staff due to legal liability.\n The property owner is solely responsible for hiring a professional ..."
  }, 
  {
    "id": "https://www.bayfieldcounty.org/722/Land-Surveying", 
    "contents": "The County Surveyor is responsible for the county's remonumentation and \nmaintenance of section corners in the Public Land Survey System (PLSS) as well \nas ..."
  }, 
  {
    "id": "http://www.cityofkeywest-fl.gov/topic/subtopic.php%3Ftopicid%3D80", 
    "contents": "The following is a list of land surveyors servicing the Key West area (information \nfrom State's Florida Department of Agriculture and Consumer Services list that ..."
  }, 
  {
    "id": "https://www.michigan.gov/statelicensesearch/0,4671,7-180-24786-81336--,00.html", 
    "contents": "Land Surveyor. Agency: Licensing and Regulatory Affairs. Required State \nLicense(s): Contact the Department of Licensing and Regulatory Affairs, Bureau \nof ..."
  }, 
  {
    "id": "https://www.carterlandsurveying.com/", 
    "contents": "Carter Land Surveying is professional land surveyor & certified floodplain \nmanager servicing clients throughout Atlanta and Coastal Georgia."
  }, 
  {
    "id": "https://www.stewartandneece.com/", 
    "contents": "417-624-0311 - FREE estimates. Land surveying. Lot surveying. Pipelines. \nConstruction projects."
  }, 
  {
    "id": "http://www.cinquinipassarino.com/best-surveyor-sonoma-county", 
    "contents": "Are you searching for the best land surveyor in Sonoma County? With expert lot \nline surveyors, Cinquini & Passarino Inc is the number one choice!"
  }, 
  {
    "id": "https://guidainc.com/", 
    "contents": "Founded in 1995, Guida Surveying, Inc. (Guida), focuses on providing land \nsurveying services on municipal and private projects throughout California. We \nare a ..."
  }
]