[
  {
    "id": "https://www.aota.org/About-Occupational-Therapy.aspx", 
    "contents": "Occupational therapy practitioners ask, \"What matters to you?\" not, \"What's the \nmatter with you?\" In its simplest terms, occupational therapists and occupational ..."
  }, 
  {
    "id": "https://www.aota.org/Conference-Events/OTMonth/what-is-OT.aspx", 
    "contents": "Occupational therapy practitioners enable people of all ages to live life to its fullest by helping them promote health, and prevent—or live better with—injury, illness, or disability."
  }, 
  {
    "id": "https://www.aota.org/Education-Careers/Considering-OT-Career.aspx", 
    "contents": "Thinking about a career in occupational therapy? You've come to the right place! \nIn this section, you can learn about job outlooks (and it's great!), glimpse into ..."
  }, 
  {
    "id": "https://www.bls.gov/ooh/healthcare/occupational-therapists.htm", 
    "contents": "Occupational therapists treat injured, ill, or disabled patients through the therapeutic use of everyday activities. They help these patients develop, recover, improve, as well as maintain the skills needed for daily living and working."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Occupational_therapy", 
    "contents": "Occupational therapy (OT) is the use of assessment and intervention to develop, recover, or maintain the meaningful activities, or occupations, of individuals, groups, or communities. It is an allied health profession performed by occupational therapists."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Occupational_therapist", 
    "contents": "An occupational therapist works with a client to help them achieve a fulfilled and \nsatisfied state in life through the use of \"purposeful activity or interventions ..."
  }, 
  {
    "id": "https://explorehealthcareers.org/career/occupational-therapy/occupational-therapist/", 
    "contents": "Occupational therapists help people of all ages to fully engage in their daily lives, \nfrom their work and recreation to activities of daily living like getting dressed, ..."
  }, 
  {
    "id": "https://money.usnews.com/careers/best-jobs/occupational-therapist", 
    "contents": "Find out more about the average occupational therapist salary and learn where \nthe best-paying metropolitan areas are for a occupational therapist across the ..."
  }, 
  {
    "id": "https://www.ithaca.edu/hshp/depts/ot/faqs/whatisot/", 
    "contents": "Occupational therapy is a health and rehabilitation profession. Occupational \ntherapists work with people of all ages who need specialized assistance to lead ..."
  }, 
  {
    "id": "https://kidshealth.org/en/parents/occupational-therapy.html", 
    "contents": "Occupational therapy (OT) treatment focuses on helping people with a physical, \nsensory, or cognitive disability be as independent as possible in all areas of ..."
  }, 
  {
    "id": "https://newgradphysicaltherapy.com/what-occupational-therapists-do/", 
    "contents": "Apr 24, 2017 ... Despite the powerful influence of occupational therapists in patient care and \npatient outcomes, there are many misconceptions about the role of ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3D709DlMuPkRg", 
    "contents": "Apr 13, 2016 - 3 min - Uploaded by ConnectEdIn our latest Day in the Life, Lani shares how positivity, creativity and play can  help children in ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3DWJs7dge75uM", 
    "contents": "May 5, 2017 - 2 min - Uploaded by Spokane Public SchoolsSpokane Public Schools Occupational Therapists like Sheri Burrill help students develop ..."
  }, 
  {
    "id": "https://physicaltherapyweb.com/differences-occupational-therapy-physical-therapy/", 
    "contents": "There are many differences and many similarities between the fields of physical \ntherapy and occupational therapy. Here is a brief introduction to some of them."
  }, 
  {
    "id": "https://www.onetonline.org/link/summary/29-1122.00", 
    "contents": "Sample of reported job titles: Assistive Technology Trainer, Early Intervention \nOccupational Therapist, Industrial Rehabilitation Consultant, Occupational ..."
  }, 
  {
    "id": "https://www.mynextmove.org/profile/summary/29-1122.00", 
    "contents": "Occupational Therapists. Also called: Occupational Therapist (OT), Pediatric \nOccupational Therapist, Registered Occupational Therapist, Staff Therapist."
  }, 
  {
    "id": "http://chan.usc.edu/about-us/os-and-ot/what-is-ot", 
    "contents": "Occupational therapy is a health care profession aimed at enabling people to live \nlife to its fullest. To occupational therapists, a “full” life means engagement in ..."
  }, 
  {
    "id": "https://www.theguardian.com/careers/2016/jun/01/what-does-an-occupational-therapist-do-exactly", 
    "contents": "Jun 1, 2016 ... From teaching stroke survivors to recognise objects to helping children make \nsense of the world through play – an OT's role is surprisingly ..."
  }, 
  {
    "id": "http://www.sacredheart.edu/academics/collegeofhealthprofessions/academicprograms/occupationaltherapy/", 
    "contents": "Founded in 2000, Sacred Heart University's Graduate Occupational Therapy \nProgram was the first in Connecticut to meet the Accreditation Council of ..."
  }, 
  {
    "id": "https://www.understood.org/en/learning-attention-issues/treatments-approaches/therapies/occupational-therapy-what-you-need-to-know", 
    "contents": "What is occupational therapy? Find out how OT works and how children may \nqualify for free occupational therapy services in school."
  }, 
  {
    "id": "http://www.stanfordchildrens.org/en/service/occupational-therapy", 
    "contents": "When a child has a serious illness or injury, medically-based or rehabilitative \noccupational therapy services may be provided."
  }, 
  {
    "id": "https://www.payscale.com/research/US/Job%3DOccupational_Therapist_(OT)/Hourly_Rate", 
    "contents": "As of Jun 2018, the average pay for an Occupational Therapist (OT) is $36.52 /hr \nor $65000 annually."
  }, 
  {
    "id": "https://www.britannica.com/science/occupational-therapy", 
    "contents": "May 18, 2018 ... Occupational therapy, use of self-care and work and play activities to promote \nand maintain health, prevent disability, increase independent ..."
  }, 
  {
    "id": "https://www.masters-in-special-education.com/faq/occupational-therapist/", 
    "contents": "If you are considering a career in occupational therapy to treat injured, ill, and \ndisabled patients to improve the skills needed for daily living, then it is important \nto ..."
  }, 
  {
    "id": "http://www.dartmouth-hitchcock.org/rehabilitation/occupational_therapy_services.html", 
    "contents": "The Occupational Therapy section of the Department of Rehabilitation provides \nassessment and treatment to person's whose daily function has been impaired ..."
  }, 
  {
    "id": "https://www.nbcot.org/", 
    "contents": "NBCOT provides initial and renewal certification for occupational therapy in the \nUnited States."
  }, 
  {
    "id": "https://www.usciences.edu/samson-college-of-health-sciences/occupational-therapy/index.html", 
    "contents": "The Right OT School for You. Through meaningful and goal-directed activities, \noccupational therapists help people work through their physical, developmental,\n ..."
  }, 
  {
    "id": "https://www.massgeneral.org/occupational-therapy/", 
    "contents": "We are a vibrant, progressive and patient-centered department, at the leading \nedge of occupational therapy and physical therapy science. Our commitment to ..."
  }, 
  {
    "id": "https://nyulangone.org/locations/rusk-rehabilitation/occupational-therapy", 
    "contents": "Occupational therapists at NYU Langone's Rusk Rehabilitation help people \nreclaim their independence by mastering everyday skills. Learn more."
  }, 
  {
    "id": "http://www.ot.alabama.gov/", 
    "contents": "Welcome to the website of the Alabama State Board of Occupational Therapy. \nThe Board was created by the State Legislature (ACT 90-383) in 1990 to provide\n ..."
  }, 
  {
    "id": "https://nau.edu/chhs/occupational-therapy/", 
    "contents": "This intensive Occupational Therapy Doctorate (OTD) program features up to six \nmonths of fieldwork plus an individualized 16-week residency rotation, ..."
  }, 
  {
    "id": "https://steinhardt.nyu.edu/ot/definition/", 
    "contents": "Occupational therapy is a health profession whose goal is to help people achieve \nindependence, meaning and satisfaction in all aspects of their lives."
  }, 
  {
    "id": "https://www.insidehighered.com/news/2018/01/02/accreditor-mulls-increasing-education-requirements-occupational-therapists", 
    "contents": "Jan 2, 2018 ... Proposed requirements for occupational therapists to have more advanced \ndegrees to work in the field could cause problems for community ..."
  }, 
  {
    "id": "https://www.bswhealth.com/specialties/rehabilitation-and-physical-therapy/Pages/occupational-therapy.aspx", 
    "contents": "Occupational therapy at Baylor Scott & White Health assists you or your \nloved one in managing the challenges of everyday life. Our licensed \noccupational ..."
  }, 
  {
    "id": "https://www.webmd.com/pain-management/occupational-rehab", 
    "contents": "Jun 27, 2017 ... What can OT do for you? Learn about occupational therapy, what occupational \ntherapists do, where they work, and why you might need this ..."
  }, 
  {
    "id": "http://www.maine.gov/pfr/professionallicensing/professions/occupational/index.html", 
    "contents": "Future correspondence from the Board of Occupational Therapy Practice will be \nsent to you by email, so please be sure to keep your contact information current."
  }, 
  {
    "id": "https://www.glassdoor.com/Job/occupational-therapist-jobs-SRCH_KO0,22.htm", 
    "contents": "Search Occupational Therapist jobs. Get the right Occupational Therapist job with \ncompany ratings & salaries. 27423 open jobs for Occupational Therapist."
  }, 
  {
    "id": "https://dpi.wi.gov/sped/educators/consultation/occupational-therapy", 
    "contents": "Schools provide occupational therapy when a child with a disability requires this \nrelated service to assist the child to benefit from special education."
  }, 
  {
    "id": "https://www.washington.edu/uaa/advising/at-the-uw/pre-health-advising/fields/occupational-therapy/", 
    "contents": "Pre-occupational therapy students are completing the necessary prerequisite \ncourses in order to apply to a graduate program in occupational therapy. Pre-OT\n ..."
  }, 
  {
    "id": "https://www.uwlax.edu/grad/occupational-therapy/", 
    "contents": "Welcome to the University of Wisconsin-La Crosse Occupational Therapy \nProgram. The Occupational Therapy program graduated its first class in 2000 \nwith a ..."
  }, 
  {
    "id": "https://www.neit.edu/Programs/Graduate-Degree-Programs/Occupational-Therapy", 
    "contents": "Advance your knowledge with a Master's degree in Occupational Therapy at \nRhode Island's technical university - New England Tech."
  }, 
  {
    "id": "http://www.css.edu/the-sentinel-blog/everything-you-need-to-know-about-pediatric-occupational-therapy.html", 
    "contents": "Jan 22, 2018 ... Occupational therapists play an important role in our communities as they work to \nenable patients to engage in the meaningful activities of daily ..."
  }, 
  {
    "id": "http://www.wfot.org/aboutus/aboutoccupationaltherapy/definitionofoccupationaltherapy.aspx", 
    "contents": "Occupational therapy is a client-centred health profession concerned with \npromoting health and well being through occupation. The primary goal of \noccupational ..."
  }, 
  {
    "id": "https://madisoncollege.edu/program/occupational-therapy", 
    "contents": "The Occupational Therapy Assistant program at Madison College will train you to \nwork with occupational therapists in helping individuals improve functionality, ..."
  }, 
  {
    "id": "http://www.op.nysed.gov/prof/ot/otlic.htm", 
    "contents": "May 2, 2018 ... Any use of the titles occupational therapist or occupational therapy assistant \nwithin New York State requires licensure as an occupational ..."
  }, 
  {
    "id": "https://www.chrichmond.org/Services/Occupational-Therapy.htm", 
    "contents": "The specialized occupational therapists at Children's Hospital of Richmond at \nVCU help your child learn or relearn the skills of daily life, by performing a ..."
  }, 
  {
    "id": "https://childmind.org/article/occupational-therapists-what-do-they-do/", 
    "contents": "When kids show delays in developing skills, Occupational Therapists are often \nthe first called in to evaluate symptoms and offer solutions."
  }, 
  {
    "id": "http://www.lewisu.edu/academics/msoccuptherapy/", 
    "contents": "The Master of Science in Occupational Therapy program provides students with \nthe knowledge, skills and experience necessary to assist those with ..."
  }, 
  {
    "id": "https://www.michigan.gov/lara/0,4601,7-154-72600_72603_27529_27545---,00.html", 
    "contents": "Our goal is to provide up-to-date information on various topics related to the \npractice of occupational therapy in Michigan. We hope you find this information ..."
  }, 
  {
    "id": "https://ot.az.gov/consumer-information/therapist-search", 
    "contents": "This page allows you search the Arizona directory for occupational therapists and \nassistants, and view details regarding disciplinary actions, licensing, ..."
  }, 
  {
    "id": "https://childmind.org/article/occupational-therapists-what-do-they-do/", 
    "contents": "When kids show delays in developing skills, Occupational Therapists are often \nthe first called in to evaluate symptoms and offer solutions."
  }, 
  {
    "id": "https://ot.az.gov/consumer-information/therapist-search", 
    "contents": "This page allows you search the Arizona directory for occupational therapists and \nassistants, and view details regarding disciplinary actions, licensing, ..."
  }, 
  {
    "id": "http://www.bot.ca.gov/", 
    "contents": "A website for the State of California, Department of Consumer Affairs, Board of \nOccupational Therapy."
  }, 
  {
    "id": "https://www.hackensackumc.org/services/physical-medicine-rehabilitation/services/occupational-therapy/", 
    "contents": "As an integral part of the Physical Medicine and Rehabilitation Department, \noccupational therapists work with a variety of patients due to the functional ..."
  }, 
  {
    "id": "https://www.indeed.com/forum/job/occupational-therapist.html", 
    "contents": "Find Occupational Therapist salaries, interviews, reviews... posted by 5378 \nprofessionals and job seekers. Indeed.com one search. all jobs."
  }, 
  {
    "id": "http://www.athletico.com/services/occupational-therapy/", 
    "contents": "Our occupational and hand therapy services improve your overall health and well\n-being. Our wide range of personalized occupational therapy services include: ..."
  }, 
  {
    "id": "http://www.ksbha.org/professions/OT.shtml", 
    "contents": "Occupational Therapy: \"The therapeutic use of purposeful and meaningful \noccupations (goal-directed activities) to evaluate and treat, pursuant to the \nreferral, ..."
  }, 
  {
    "id": "https://summit-education.com/ce/occupational-therapist", 
    "contents": "Occupational Therapists are charged with the important task of restoring \nfunctional ability to facilitate optimal performance of daily tasks and sensory \nregulation."
  }, 
  {
    "id": "https://www.murraystate.edu/occupationaltherapy/", 
    "contents": "Occupational therapy (OT) is a medically-based profession that focuses on \npromoting independence for clients to increase their successful performance with\n ..."
  }, 
  {
    "id": "https://www.choc.org/programs-services/rehabilitation/occupational-therapy/", 
    "contents": "Occupational therapy helps children develop or improve the skills important for \ndaily life. At CHOC Children's, we work with patients from birth through 21 years ..."
  }, 
  {
    "id": "https://www.doh.wa.gov/LicensesPermitsandCertificates/ProfessionsNewReneworUpdate/OccupationalTherapist", 
    "contents": "Information on licenses, renewals, scope of practice, fees, rules and regulations \nfor occupational therapists and occupational therapist assistants."
  }, 
  {
    "id": "https://www.nyp.org/rehabmed/services/occupational-therapy", 
    "contents": "Learn how our occupational therapists help people with physical, developmental, \npsychological and social needs to lead independent and productive lives."
  }, 
  {
    "id": "https://www.uofmhealth.org/conditions-treatments/occupational-therapy", 
    "contents": "Occupational therapists help improve function of people facing challenges with \ndaily living activities, due to physical injury, illness, disease or the aging process."
  }, 
  {
    "id": "http://health.ri.gov/licenses/detail.php%3Fid%3D234", 
    "contents": "Verify a Occupational Therapy License · Find Licensed Occupational Therapists · \nDownload Occupational Therapy Lists · File a Complaint · Find Disciplinary ..."
  }, 
  {
    "id": "http://www.sdbmoe.gov/content/occupational-therapist-ot", 
    "contents": "Occupational Therapist (OT). If you receive an application or associated forms \nfrom a source other than directly from this office or its official web site, the ..."
  }, 
  {
    "id": "https://dpr.delaware.gov/boards/occupationaltherapy/", 
    "contents": "The primary objective of the Delaware Board of Occupational Therapy Practice is \nto protect the public from unsafe practices and practices which tend to reduce ..."
  }, 
  {
    "id": "http://www.duq.edu/academics/schools/health-sciences/academic-programs/occupational-therapy", 
    "contents": "Occupational therapists are experts in doing. We prescribe therapeutic \noccupations, including everyday life activities to support a person's performance \nand ..."
  }, 
  {
    "id": "https://study.com/articles/Occupational_Therapist_How_Do_I_Become_an_Occupational_Therapy_Professional.html", 
    "contents": "Occupational therapists help people with disabilities, injuries, and illnesses \nimprove or recover their ability to perform everyday activities. They may develop ..."
  }, 
  {
    "id": "https://www.otplan.com/articles/how-to-obtain-your-occupational-therapy-degree.aspx", 
    "contents": "Occupational therapy is a profession that deals with health and rehabilitation. \nThese therapists work with a wide range of different people and assist in helping\n ..."
  }, 
  {
    "id": "https://otaonline.stkate.edu/blog/fields-occupational-therapy-and-physical-therapy-whats-difference/", 
    "contents": "Apr 12, 2017 ... The fields of occupational therapy and physical therapy are often confused. \nThough both provide hands-on rehabilitative care to help ..."
  }, 
  {
    "id": "https://otaonline.stkate.edu/blog/fields-occupational-therapy-and-physical-therapy-whats-difference/", 
    "contents": "Apr 12, 2017 ... The fields of occupational therapy and physical therapy are often confused. \nThough both provide hands-on rehabilitative care to help ..."
  }, 
  {
    "id": "https://www.shsu.edu/academics/oppa/pre-occupational-therapy", 
    "contents": "Academic Preparation for Occupational Therapy Schools. Pre-Occupational \nTherapy education provides students with a sound background in the natural and\n ..."
  }, 
  {
    "id": "https://dopl.utah.gov/licensing/occupational_therapy.html", 
    "contents": "Manual 2017 Renewal Forms >>This license expires on May 31 odd numbered \nyears<<. Occupational Therapist · Occupational Therapy Assistant ..."
  }, 
  {
    "id": "https://www.mayo.edu/mayo-clinic-school-of-health-sciences/careers/occupational-therapy", 
    "contents": "Aug 29, 2017 ... Occupational therapists work with individuals who have conditions that are \nmentally, physically, developmentally or emotionally disabling."
  }, 
  {
    "id": "https://wellness.allinahealth.org/specialty/248", 
    "contents": "If illness, injury or disability affects your daily life, you may need occupational \ntherapy. Occupational therapists can help you gain as many daily living skills as ..."
  }, 
  {
    "id": "https://smhs.gwu.edu/occupational-therapy/", 
    "contents": "Demonstrate your commitment to state-of-the-art occupational therapy practice by \nearning an advanced degree from GW. Read more about our program."
  }, 
  {
    "id": "http://www.delmar.edu/degrees/occupational-therapy-assistant/", 
    "contents": "Apr 2, 2018 ... The Occupational Therapy Assistant program curriculum is designed to prepare \nan individual as an Occupational Therapy Assistant, a health ..."
  }, 
  {
    "id": "https://cph.temple.edu/rs/academics-rehabilitation-sciences/occupational-therapy", 
    "contents": "Mission The Temple University Program in Occupational Therapy's mission is to \neducate students, support practitioners, nurture educators, and stimulate ..."
  }, 
  {
    "id": "http://www.dosher.org/getpage.php%3Fname%3Doccupational_therapy", 
    "contents": "Our Occupational Therapist will help you achieve your maximum independence \nby rebuilding fine motor skills so you can perform Activities of Daily Living ..."
  }, 
  {
    "id": "https://www.hopkinsmedicine.org/physical_medicine_rehabilitation/services/rehab-therapy/occupational/index.html", 
    "contents": "Occupational therapists at Johns Hopkins help patients participate in meaningful \ndaily activities and practice habits they may need for work and recreation."
  }, 
  {
    "id": "https://www.chop.edu/centers-programs/occupational-therapy", 
    "contents": "Occupational Therapy (OT) at The Children's Hospital of Philadelphia provides \nservices to children and young adults facing the social, emotional and ..."
  }, 
  {
    "id": "https://www2.ewu.edu/chsph/programs/occupational-therapy", 
    "contents": "Occupational Therapy (OT) is a health and rehabilitation profession that helps \npeople of all ages to participate more fully in their day-to-day lives. Occupational\n ..."
  }, 
  {
    "id": "http://www.okmedicalboard.org/occupational_therapists", 
    "contents": "The Oklahoma Occupational Therapists Committee is happy to welcome you to \ntheir new website. We hope you find much useful information. We are grateful to ..."
  }, 
  {
    "id": "https://www.ndss.org/resources/occupational-therapy-down-syndrome/", 
    "contents": "My intent with this article is to provide you with some information about how an \noccupational therapist (OT) may be able to help you and your child. Occupational\n ..."
  }, 
  {
    "id": "http://www.wallacestate.edu/programs/health-division/occupational-therapy-assistant", 
    "contents": "Occupational therapy assistants work under the direction of occupational \ntherapists to provide rehabilitative services to persons with mental, physical, \nemotional, ..."
  }, 
  {
    "id": "https://usm.maine.edu/ot", 
    "contents": "Helping people engage in meaningful activities (occupations) that impact health \nand wellness is the key ambition of every occupational therapist. Students in ..."
  }, 
  {
    "id": "https://prehealth.uga.edu/allied-health/Occupational-Therapy/", 
    "contents": "Occupational therapists (OTs) are health care professionals who help people \nacross the lifespan participate in the things they want and need to do through the\n ..."
  }, 
  {
    "id": "https://www.avera.org/services/therapy-rehabilitation/occupational-therapy/", 
    "contents": "Get expert occupational therapy and extensive rehabilitation services at Avera \nlocations across the Upper Midwest."
  }, 
  {
    "id": "https://shrs.iupui.edu/academics/occupational-therapy/index.html", 
    "contents": "Welcome to the Indiana University SHRS Department of Occupational Therapy."
  }, 
  {
    "id": "https://www.st-claire.org/services/rehabilitation-services/occupational-therapy/", 
    "contents": "In the simplest terms, occupational therapists and occupational therapy \nassistants help people across the lifespan participate in daily life activities \nthrough the ..."
  }, 
  {
    "id": "https://www.sec.state.vt.us/professional-regulation/list-of-professions/occupational-therapy.aspx", 
    "contents": "Feb 13, 2018 ... Occupational therapists and occupational therapy assistants in the state of \nVermont are governed by the “advisor” model of regulation, created ..."
  }, 
  {
    "id": "https://www.midwestern.edu/programs_and_admission/az_occupational_therapy.html", 
    "contents": "The Occupational Therapy Program in the College of Health Sciences (CHS) at \nMidwestern University's Glendale, Arizona campus integrates concepts and ..."
  }, 
  {
    "id": "https://www.gatepath.org/Occupational-Therapy", 
    "contents": "Occupational therapy (OT) helps children learn to perform everyday tasks and \ntake part in day-to-day life. Our occupational therapists teach children with delays\n, ..."
  }, 
  {
    "id": "https://ucnet.universityofcalifornia.edu/system_series/h/80/aa6-23.html", 
    "contents": "Class Specifications - H.80. Occupational Therapist V - 9495. Occupational \nTherapist IV - 9496. Occupational Therapist III - 9497. Occupational Therapist II -\n ..."
  }, 
  {
    "id": "https://www.pacificu.edu/academics/colleges/college-health-professions/school-occupational-therapy/occupational-therapy-otd", 
    "contents": "The School of Occupational Therapy offers an entry-level Occupational Therapy \nDoctorate (OTD) program for applicants who have completed a bachelor's ..."
  }, 
  {
    "id": "https://www.su.edu/occupational-therapy/", 
    "contents": "Occupational therapists help people of all ages regain their quality of life through \nthe therapeutic use of everyday activities. They help children with disabilities to ..."
  }, 
  {
    "id": "https://oregon.providence.org/our-services/o/occupational-therapy/", 
    "contents": "Occupational therapy is a healthcare profession that helps people with ... An \noccupational therapist, or OT, is part of the multidisciplinary rehabilitation team \nand ..."
  }, 
  {
    "id": "http://kc.edu/academics/occupational-therapy/", 
    "contents": "Doctorate of Occupational Therapy (OTD) and ODT Practice Management from \nan award-winning and faith-based healthcare college offering online course ..."
  }, 
  {
    "id": "http://columbiaot.org/faculty/meet-the-faculty/glen-gillen/", 
    "contents": "Membership is conferred in recognition of their significant personal involvement \nin advancing occupational therapy at local, state, and/or national levels and ..."
  }, 
  {
    "id": "http://fcmcpa.org/occupational-therapy", 
    "contents": "Occupational Therapy in McConnellsburg, Pennsylvania ... The occupational \ntherapy department at FCMC is available to you during your inpatient or rehab \nstay ..."
  }
]