[
  {
    "id": "https://b-inspiredmama.com/25-earth-day-activities-for-kids/", 
    "contents": ""
  }, 
  {
    "id": "http://www.dltk-kids.com/Crafts/earth.html", 
    "contents": "As might our Arbor Day activities. If you're looking for recycled crafts, check out any of our toilet paper roll crafts, can and jar crafts, baby food jar crafts, and egg carton crafts. Making Learning Fun: Earth Day Printables."
  }, 
  {
    "id": "https://b-inspiredmama.com/25-earth-day-activities-for-kids/", 
    "contents": "Apr 19, 2012 ... Some Fun Earth Day Activities for Kids! Make a Trash Rainbow from No Time for Flashcards. Make a Nature Shadowbox from Teach Preschool. Make a Fingerprint World from Busy Kids = Happy Mom. Make Eco-Friendly Sidewalk Paint from East Coast Mommy. Plant a Grass Caterpillar from Parent Map."
  }, 
  {
    "id": "http://www.pbs.org/parents/crafts-for-kids/category/holiday/earth-day/", 
    "contents": "All Earth Day Crafts. Recycled Cork Boats. Nature Dragonfly Craft. DIY Paper Cardinal. Recycled Paper Roll Daffodils. Butterfly Feeder. DIY Succulent Container Garden. Easy Recycled Desk Organizer. Recycled Mini Chalkboard."
  }, 
  {
    "id": "https://www.weareteachers.com/meaningful-earth-day-activities/", 
    "contents": "Apr 2, 2018 ... Our students are the future caretakers of our Earth. These fun Earth Day activities \nhelp empower kids to have a positive impact on the planet."
  }, 
  {
    "id": "https://wehavekids.com/parenting/10-Earth-Day-Activities-for-your-Family", 
    "contents": "Mar 13, 2018 ... 10 fun and Earth friendly activities to do with kids in celebration of Earth Day."
  }, 
  {
    "id": "https://www.education.com/activity/earth-day/", 
    "contents": "These Earth Day activities will inspire your kids to appreciate and take care of the \nplanet we live on, from creating paper projects to growing real-life plants and ..."
  }, 
  {
    "id": "https://littlebinsforlittlehands.com/hands-on-earth-day-activities-for-kids/", 
    "contents": "Apr 6, 2015 ... Simple Earth Day Activities to teach young children how to help the planet. \nHands on Earth Day activities show kids how they can protect the ..."
  }, 
  {
    "id": "https://tinkerlab.com/fifty-earth-day-activities/", 
    "contents": "Earth Day is our annual reminder to slow down and appreciate the bounty of the \nearth. The following 50 Earth Day Activities for kids will encourage children to ..."
  }, 
  {
    "id": "https://tinkerlab.com/fifty-earth-day-activities/", 
    "contents": ""
  }, 
  {
    "id": "https://buggyandbuddy.com/15-meaningful-earth-day-activities-for-kids/", 
    "contents": "Mar 23, 2018 ... This list of 15 meaningful Earth Day activities for kids is sure to inspire you and \nyour children or students to get creative and learn about ways to ..."
  }, 
  {
    "id": "https://www.pinterest.com/marniecraycroft/kids-earth-day/", 
    "contents": "The board also includes activities using recycled materials. | See more ideas \nabout Earth day activities, Environment and Activities for children."
  }, 
  {
    "id": "https://www.pinterest.com/gmptfitness/earth-day-science-and-activities-for-kids/", 
    "contents": "Explore Little Bins For Little Hands's board \"Earth Day Science and Activities for \nkids\" on Pinterest. | See more ideas about Spring activities, Earth day activities ..."
  }, 
  {
    "id": "https://www.pinterest.com/pin/517280707181057537/", 
    "contents": "Girl Hugging Earth Printable Craft. Balloon Stamping Earth Day Craft For Kids. \nSimple Earth Day activity for toddlers or preschoolers ..."
  }, 
  {
    "id": "https://www.familyeducation.com/entertainment-activities/earth-day", 
    "contents": "Celebrate Earth Day with your kids! Find fun, environmentally-friendly crafts and \nactivities to enjoy on April 22 and year-round as a \"green\" family."
  }, 
  {
    "id": "https://www.naturalbeachliving.com/earth-day-ideas/", 
    "contents": "Apr 4, 2016 ... 40+ Earth Day Ideas for Kids, Earth Day Sensory Play, Free Pollution Printables, \nEarth Day Crafts and Art Ideas, Nature Inspired Activities, ..."
  }, 
  {
    "id": "https://www.plt.org/educator-tips/earth-day-activities/", 
    "contents": "Use these activities to inspire your students to take action this Earth Day, and \nevery day. Earth Day is more than learning about recycling - it's about taking \naction."
  }, 
  {
    "id": "https://happyhooligans.ca/23-earth-day-crafts-treats-activities-kids/", 
    "contents": "Apr 4, 2018 ... 23 Earth Day crafts, treats and activities for kids. So many fun ways to celebrate \nand observe Earth Day at home or in the classroom!"
  }, 
  {
    "id": "https://www.scholastic.com/teachers/collections/teaching-content/celebrate-earth-day/", 
    "contents": "Celebrate Earth Day. Promote environmental awareness with these teaching \nideas, lesson plans, and student activities. Grades. PreK–K , 1–2 , 3–5 , 6–8."
  }, 
  {
    "id": "https://teaching2and3yearolds.com/10-preschool-earth-day-activities-that-are-fun/", 
    "contents": "Mar 6, 2018 ... This collection includes 10 preschool earth day activities that are full of ... of \nhands-on activities invite young children to think about earth and ..."
  }, 
  {
    "id": "https://www.redbookmag.com/life/friends-family/g19695144/fun-earth-day-activities-for-kids/", 
    "contents": "Apr 7, 2018 ... Our kids will eventually be the ones in charge or protecting the Earth, so it's never \ntoo early to start teaching them how. Earth Day happens ..."
  }, 
  {
    "id": "https://www.messforless.net/12-earth-day-activities-for-kids/", 
    "contents": "Mar 21, 2016 ... Celebrate Earth Day with these fun and easy Earth Day Activities for kids. You \nwill be surprised at how..."
  }, 
  {
    "id": "https://www.earlychildhoodeducationzone.com/8-best-earth-day-activities-kids/", 
    "contents": "Apr 21, 2017 ... Earth Day is an awesome day to get into your craft closet. You know all those egg \ncartons and paper towel rolls you have been saving? This is ..."
  }, 
  {
    "id": "https://www.teachervision.com/holidays/earth-day", 
    "contents": "175 items ... April 22 is Earth Day, a time to teach your class about our environment and ... \nChildren of Native America Today Activities; More Earth Day Art Activities ..."
  }, 
  {
    "id": "https://theeducatorsspinonit.com/100-ways-to-celebrate-earth-day-every/", 
    "contents": "We've created a roundup of some of our favorite Earth Day Activities, Crafts, \nGames, Books and Snacks for you to plan your own Earth Day Celebration that \nwill ..."
  }, 
  {
    "id": "https://www.activityvillage.co.uk/earth-day", 
    "contents": "Earth Day activities for kids. Here are some quick ideas for celebrating Earth Day \nwith your children: Plant a tree; Go for a bike ride or a long walk (leave the car ..."
  }, 
  {
    "id": "http://momwifebusylife.com/10-earth-day-activities-for-kids/", 
    "contents": "Apr 19, 2018 ... Earth Day 2018 is on April 22 this year. With the spring season being full of \noutdoor activities for the kids, I thought I'd compile a list of things to ..."
  }, 
  {
    "id": "https://www.playdoughtoplato.com/20-earth-day-activities/", 
    "contents": "Apr 14, 2015 ... 20 Super Fun Earth Day Activities. Teach kids about the layers of the earth with a \nbatch of Earth playdough. {It's surprisingly easy to make!}"
  }, 
  {
    "id": "https://inspirationlaboratories.com/earth-day-activities-for-kids/", 
    "contents": "Mar 23, 2018 ... We shared conservation activities, environmental science lessons, Earth Day \nactivities for kids, and talked about ways kids can make a ..."
  }, 
  {
    "id": "https://www.kindergartenworks.com/kindergarten-teaching-ideas/holidays/18-earth-day-activities/", 
    "contents": "So, here is a go-to list of kindergarten Earth Day resources and activities that ... \nEarth Day Coloring Page – Kids holding the Earth for a simple coloring page."
  }, 
  {
    "id": "http://www.educationworld.com/holidays/archives/earthday.shtml", 
    "contents": "Students will love these Earth Day lessons and activities. ... worms, scrap paper \nprojects, more. Education Resources Help Kids Give Water a Hand Two national\n ..."
  }, 
  {
    "id": "https://thekindergartenconnection.com/engaging-earth-day-activities-kids/", 
    "contents": "Try these Earth Day activities for kids this year - kids will love learning about how \nto care for the earth with these fun crafts and activities!"
  }, 
  {
    "id": "http://www.miltownmoms.com/single-post/2018/04/16/8-Earth-Day-activities-for-kids", 
    "contents": "Apr 22, 2018 ... Earth Day is this Sunday, April 22nd, 2018. And although it looks like a winter \nwonderland outside, these springy Earth Day events will go on as ..."
  }, 
  {
    "id": "https://www.parents.com/toddlers-preschoolers/activities/outdoor/earth-day-activities-preschoolers/", 
    "contents": "Teach your little ones the importance of keeping the earth clean and preserving \nits natural resources with these easy activities for preschoolers."
  }, 
  {
    "id": "http://wsbt.com/news/local/interview-earth-day-activities-to-do-with-the-kids", 
    "contents": "Apr 21, 2018 ... WSBT CBS 22 provides news, sports, entertainment and public interest programs \nto the South Bend, Indiana area including Mishawaka, Notre ..."
  }, 
  {
    "id": "http://www.chicagoparent.com/play/holiday-fun/7-earth-day-activities-for-chicago-families/", 
    "contents": "Apr 18, 2018 ... There are several kid-friendly Earth Day events in and around Chicago for \nfamilies to enjoy together. Here are seven events, one for each ..."
  }, 
  {
    "id": "https://fromabcstoacts.com/earth-day-activities-for-kids-on-moms-library/", 
    "contents": "Earth Day is coming up quick! Are you ready? Check out this week's Mom's \nLibrary for books, crafts, and lots of free printables to help you celebrate!"
  }, 
  {
    "id": "https://www.kidsdiscover.com/teacherresources/earth-day-resources-for-teachers-and-students/", 
    "contents": "Apr 9, 2018 ... The first Earth Day in 1970 marked the beginning of the modern ... try these \nactivities to expand their knowledge and interest in the Earth. Earth ..."
  }, 
  {
    "id": "http://moretime2teach.com/10-fun-activities-celebrate-earth-day-classroom/", 
    "contents": "I added a few extra activities that we're probably not going to get to this week, but \n... I think we need to teach our kids to not only pick up litter on Earth Day, but ..."
  }, 
  {
    "id": "https://study.com/academy/popular/earth-day-activities-for-kids.html", 
    "contents": "Earth Day is a worldwide celebration of the Earth and what we can do to protect it\n. Read on to learn about Earth Day projects and activities for..."
  }, 
  {
    "id": "https://www.greenkidcrafts.com/10-great-earth-day-activities-kids/", 
    "contents": "Apr 13, 2017 ... Celebrate Earth month all April long with these fun Earth Day themed crafts and \nactivities for kids. I've rounded up some of our favorites here on ..."
  }, 
  {
    "id": "http://www.childfun.com/holidays/spring/earth-day/", 
    "contents": "Explore fun and engaging Earth day activities, crafts & song ideas for children of \nall ages including toddlers, preschoolers and kindergarten kids."
  }, 
  {
    "id": "https://modernparentsmessykids.com/tag/earth-day-activities-for-kids/", 
    "contents": "It's really too bad Earth Day doesn't get the same fanfare as Valentine's Day, \nHalloween, and the like. The shape our environment's in these days, we could ..."
  }, 
  {
    "id": "https://www.pre-kpages.com/earth-day-activities-preschoolers/", 
    "contents": "Preschoolers can think about earth day and discover more about recycling with \nthese activities; for preschool, pre-k, ... Earth Day Activities for Preschool Kids ..."
  }, 
  {
    "id": "https://leftbraincraftbrain.com/earth-day-science-activities-kids/", 
    "contents": "Apr 16, 2015 ... Earth Day is coming up and it's a perfect time to learn some science. Here are \nsome Earth Day Science Activities for Kids like water pollution ..."
  }, 
  {
    "id": "http://www.wishtv.com/indy-style/stem-earth-day-activities-for-kids/1096711213", 
    "contents": "Mar 23, 2018 ... It's a great little holiday to blow out and make big for kids with easy earthy \nactivities that promote a lot of STEM learning! Earth Day is coming up ..."
  }, 
  {
    "id": "http://www.ssww.com/blog/educational-earth-day-activities-kids-planting-recycling/", 
    "contents": "Mar 26, 2018 ... Celebrating Earth Day is an opportunity to teach today's youth about our planet \nand how to protect it. Raise awareness in your program by ..."
  }, 
  {
    "id": "https://greenliving.lovetoknow.com/Earth_Day_for_Children", 
    "contents": "Planning a special Earth Day for children can be lots of fun. This year, surround \nthe kids you love with a heaping helping of cool green activity ideas from ..."
  }, 
  {
    "id": "http://www.wsfa.com/story/17516094/fun-earth-day-activities-for-kids", 
    "contents": "By Emily Anderson From Green Goes Simple. Earth Day has been celebrated \nsince 1970, when its founder -- Gaylord Nelson -- witnessed a devastating oil \nspill ..."
  }, 
  {
    "id": "https://investorplace.com/2018/04/earth-day-activities/", 
    "contents": "Apr 6, 2018 ... What are some of your favorite Earth Day activities? We have picked six of the \nbest ones for you to share with your children or students on April ..."
  }, 
  {
    "id": "https://www.parentmap.com/article/15-earth-day-crafts-and-activities-for-kids", 
    "contents": "Apr 5, 2017 ... 15 spring and Earth Day crafts and activities for kids. Eco-friendly and recycled \ncreative craft projects that your kids will love."
  }, 
  {
    "id": "http://www.orientaltrading.com/earth-day-a1-90000%2B1527-1.fltr", 
    "contents": "Earth Day Games & Activities for Kids. ” (58 total). Celebrate our planet on Earth \nDay! Your little ones will love our games and activities that teach about our Earth\n ..."
  }, 
  {
    "id": "https://www.waterford.org/earth-day-activities-for-kids-from-waterfords-rusty-rosy/", 
    "contents": "Earth Day is right around the corner (April 22), so in honor of the holiday the team \non our Rusty and Rosy blog are sharing quick, easy Earth Day-related lessons ..."
  }, 
  {
    "id": "https://pathways.org/blog/outdoor-earth-day-activities/", 
    "contents": "Make the most of Earth Day this year by teaching your child how important nature is through fun and engaging outdoor Earth Day activities.\n Use the activities listed below to not only make Earth Day fun, but also to promote your child’s development.\n ... Walk around your backyard with ..."
  }, 
  {
    "id": "https://www.thespruce.com/earth-day-activities-for-kids-1708828", 
    "contents": "Nov 8, 2017 ... Looking for Earth Day activities for kids? Earthday art projects, green games, \ncrafts and other ideas will help children celebrate our Earth."
  }, 
  {
    "id": "https://www.namcopool.com/9-earth-day-activities-for-kids/", 
    "contents": "In honor of Earth Day, here are our 9 favorite kid-friendly, eco-friendly activities \nthat will spur the imagination of children everywhere…regardless of your actual ..."
  }, 
  {
    "id": "https://www.barefootbooks.com/index.php%3FcID%3D82672%26bf_affiliate_code%3D000-1jb1", 
    "contents": "Celebrate Earth Day with 3 fun downloadable activities -- yours FREE! ... Do you \nwant the kids in your life to love the planet they call home? So do we! When you ..."
  }, 
  {
    "id": "https://www.brighthorizons.com/family-resources/e-family-news/2012-earth-day-activities-for-families", 
    "contents": "Earth Day activities for the family to do every day or as special projects. ... Earth \nDay is an ideal opportunity to connect children with the outdoors and the vibrant ..."
  }, 
  {
    "id": "https://www.naturespath.com/en-us/blog/20-activities-for-kids-to-do-during-earth-month/", 
    "contents": "Apr 3, 2018 ... It is a wonderful day to celebrate the Earth and maybe plant a new tree or start up \na recycling project as activities for kids. In taking the entire ..."
  }, 
  {
    "id": "http://mspmag.com/kids-and-family/the-fam/10-earth-day-activities-for-twin-cities-families/", 
    "contents": "Apr 18, 2018 ... Earth Day is a great excuse to leave the house and teach kids how to appreciate \nour ecosystem. Here are ten local Earth Day events that give ..."
  }, 
  {
    "id": "https://rhythmsofplay.com/celebrate-earth-day-every-day/", 
    "contents": "Mar 12, 2018 ... Teach your children how to celebrate nature, reduce their carbon ... planet, \nupcycled crafts and projects, and earth day crafts for kids! ... Don't forget to have a \nlook at our Spring Bucket List for seasonal arts, crafts, and activities."
  }, 
  {
    "id": "https://www.littleguidedetroit.com/12-ways-to-celebrate-earth-day-with-your-kids/", 
    "contents": "Apr 10, 2018 ... Earth Day is Sunday, April 22 nd and there's plenty of events that will help us get \nour kids outside and involved with fun activities that give ..."
  }, 
  {
    "id": "https://indywithkids.com/celebrate-earth-day-indy/", 
    "contents": "Luckily there are many ways to celebrate Mother Nature as a family in the greater Indianapolis area this April.\n ... Earth Day at Indiana State University.\n ... Earth Day Indiana Festival at Military Park."
  }, 
  {
    "id": "https://learning-center.homesciencetools.com/article/earth-day-activities-for-kids/", 
    "contents": "Teach kids about Earth Day and going green with easy science projects."
  }, 
  {
    "id": "https://www.activekids.com/parenting-and-family/articles/9-earth-day-family-activities", 
    "contents": "Earth Day provides many opportunities to appreciate the wonder of our planet \nand to teach young children how to conserve our natural resources. Celebrate \nthis ..."
  }, 
  {
    "id": "https://grkids.com/arbor-dayearth-day-roundup/", 
    "contents": "Apr 19, 2018 ... Teaching Good Stewardship of Mother Earth. Did you know that Earth Day (April \n22) has been celebrated for almost five decades?"
  }, 
  {
    "id": "http://www.cubicfrog.com/9-earth-day-activities-for-kids-to-start-thinking-green/", 
    "contents": "9 Earth Day activities for kids to think green for families, parents, teachers, and \nchildren of all ages. Celebrate the planet at home and in the classroom!"
  }, 
  {
    "id": "http://www.citizensvoice.com/news/kids-have-fun-with-earth-day-activities-1.1133245", 
    "contents": ""
  }, 
  {
    "id": "https://science.howstuffworks.com/environmental/conservation/conservationists/10-earth-day-activities-for-family.htm", 
    "contents": "... to what we're doing to her. Learn about some fun Earth Day activities for \nfamilies. ... Teach your kids every day how to save the Earth! See more green \nscience ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3D3DUgo8oyab4", 
    "contents": "Mar 29, 2015 - 5 min - Uploaded by AnimaplatesPrintable instructions at http://animaplates.com/v/globe Grab a group of kids,  prepare a table ..."
  }, 
  {
    "id": "http://www.sheppardsoftware.com/usa_game/holiday_paint/earthday_home.htm", 
    "contents": "Earth Day. (April 22 each year). Earth Day celebrates our amazing. planet Earth, \nand the plants. and animals that live here with us! Did you know that over 100."
  }, 
  {
    "id": "https://www.sandiegofamily.com/things-to-do/seasonal-happenings/1571-earth-day-all-month", 
    "contents": "Find more Earth-friendly activities in San Diego Family's Earth Day Pinterest \nBoard ... Kids, ages 7-12, can participate in outdoor activities and earn the \nCalifornia ..."
  }, 
  {
    "id": "http://www.visittri-cities.com/events/2018/04/21/earth-day-activities-for-kids/", 
    "contents": "Apr 21, 2018 ... Join us for cool activities for kids dedicated for Earth Day. This event is hosted by \nthe Family Resource Center of the Tri-Cities. Since we had an ..."
  }, 
  {
    "id": "https://www.funwithmama.com/earth-day-activities-for-kids/", 
    "contents": "Mar 21, 2018 ... These Earth Day Activities for kids includes printables and worksheets suitable \nfor toddlers, preschool and kindergarten students. They will help ..."
  }, 
  {
    "id": "https://www.paradise-park.com/single-post/2018/04/15/Looking-for-Earth-Day-activities-for-kids-Join-us-April-15-22", 
    "contents": "Apr 14, 2018 ... We've created a place for little ones to participate in Earth Day with activities for \nkids in Kansas City designed just for them. Come on in to ..."
  }, 
  {
    "id": "http://redtri.com/socal/so-cal-earth-day-celebrations/", 
    "contents": "Apr 4, 2018 ... 8 Earth Day Events for Budding Environmentalists ... and enjoy the great \noutdoors in the Eco-Kids Zone through engaging hands-on activities."
  }, 
  {
    "id": "http://frogsandsnailsandpuppydogtail.com/10-earth-day-activities-for-kids/", 
    "contents": "We love to find fun ways to celebrate Earth Day over here. Teaching the kids how \nto care for the Earth is important, but having a little fun along the way is ok too."
  }, 
  {
    "id": "https://www.babble.com/toddler/10-ways-to-celebrate-earth-day-with-your-toddler/", 
    "contents": "Earth Day is on April 22 and it's a day to celebrate the Earth, commit “green acts” \nlike planting fresh ... I remember making these as a kid and LOVING this activity!"
  }, 
  {
    "id": "https://inhabitat.com/10-awesome-eco-activities-to-do-this-earth-day/", 
    "contents": "Apr 1, 2018 ... Here are 10 great activities you can do to honor the planet this year. ... Earth Day, \n2012, gardening, rooftop garden, green design, sustainable design, ..... house, \nwith the unbridled enthusiasm so beautifully inherent in kids."
  }, 
  {
    "id": "https://www.steppingstoneschool.com/earth-day-activities-for-children/", 
    "contents": "Apr 19, 2018 ... Earth Day is April 22th and Stepping Stone School is celebrating the roots of \nEarth day as well as sharing an appreciation for learning through ..."
  }, 
  {
    "id": "http://achildsworldnc.com/earth-day-activities-for-kids/", 
    "contents": "Mar 26, 2018 ... Earth Day is coming up on April 22 and it provides a great opportunity to teach \nkids about keeping our planet clean. Here are a few activity ..."
  }, 
  {
    "id": "https://www.theartkitblog.com/20-unique-earth-day-activities-for-kids/", 
    "contents": "Apr 2, 2018 ... Earth Day is nearly here which means it's the perfect time to start thinking about \nworking on a few new Earth Day activities with the kids."
  }, 
  {
    "id": "https://mommypoppins.com/long-island-kids/things-to-do/weekend-fun-earth-day-celebrations-activities", 
    "contents": "Apr 18, 2018 ... Celebrate Mother Nature this Earth Day weekend with a visit to one of Long ... \nand pad your wallet with a list of FREE family activities this month."
  }, 
  {
    "id": "http://earthdayaustin.com/2017-kids-zone/", 
    "contents": "This year's event has a much wider range of activities for kids - indoors and \noutdoors. In addition to the Outdoor Activities we also have an outdoor Kid Zone \nwith ..."
  }, 
  {
    "id": "http://www.fosters.com/news/20180413/earth-day-activities-around-seacoast", 
    "contents": "Apr 13, 2018 ... On Sunday, April 22, The Children's Museum of NH has organized a day full day \nof activities focused on keeping the earth healthy and ..."
  }, 
  {
    "id": "https://kzookids.com/earth-day-activities-around-kalamazoo/", 
    "contents": "Apr 3, 2018 ... Kalamazoo is celebrating too, and we've compiled a list of fun family activities for \nEarth day where kids can learn and get involved."
  }, 
  {
    "id": "http://www.carrollcountytimes.com/news/education/cc-east-middle-earth-day-20180416-story.html", 
    "contents": "Apr 19, 2018 ... East Middle students get hands-on lesson in Earth Day activities .... Middle \nSchool kids working with us on some environmental-related stations ..."
  }, 
  {
    "id": "https://boston.citymomsblog.com/boston-area/boston-earth-day-activities-families-children/", 
    "contents": "Apr 18, 2018 ... Earth Day falls on Sunday, April 22, this year. Here is a roundup of Boston-area \nactivities for families and children to help you celebrate!"
  }, 
  {
    "id": "https://www.mnn.com/family/family-activities/blogs/22-earth-day-activities-for-kids", 
    "contents": "Apr 22, 2013 ... Over the years, I've talked to a number of parents who told me they wished they \ncould do more to celebrate Earth Day with their kids, but they ..."
  }, 
  {
    "id": "https://www.thegunnysack.com/earth-day-activity-jar-guest-post/", 
    "contents": "Fill a mason jar or clean plastic jar (which is safer for kids) with Earth Day \nactivities like these homemade earth crayons and homemade playdough. You \ncan find ..."
  }, 
  {
    "id": "http://www.omaha.com/momaha/blogs/acoffey/earth-day-activities-healthy-kids-day-and-other-fun-things/collection_33a0ca23-1a05-5b97-997d-d1506dc3606f.html", 
    "contents": "Apr 20, 2018 ... Looking for something fun to do in Omaha this weekend? Check out these family-\nfriendly suggestions, which take place April 19-22."
  }, 
  {
    "id": "https://www.atlantaparent.com/earth-day/", 
    "contents": "Mar 20, 2018 ... Hands-on activities, crafts, make-and-take plants, free candy and popcorn, \nphotos ... Earth Day Celebration at Children's Museum of Atlanta."
  }, 
  {
    "id": "http://www.crazy4computers.net/earth-day.html", 
    "contents": "http://funschool.kaboose.com/globe-rider/earth-day/interactive/slideshow.html ... \nSid the Science Kid Interactive Game to help the character, Gabriella, recycle. .... \na dumpster game, and view many recycling activities to help save the planet!"
  }, 
  {
    "id": "https://www.ebates.ca/blog/earth-day-activities-kids/", 
    "contents": "In celebration of Earth Day, have some fun by getting the kids involved. \nEducating children on the importance of the environment and being kind to the \nEarth is ..."
  }, 
  {
    "id": "http://earthday2017.today/earth-day-activities/", 
    "contents": "25. Read An Earth Day Book. Watch this video for some more interesting Earth \nDay Activities for Kids ..."
  }, 
  {
    "id": "https://craftlearnandplay.com/earth-day-activities-for-young-toddlers/", 
    "contents": "INSIDE: You will find 7 beautiful Earth Day activities for kids that you can do \ntogether and celebrate mother Earth plus FREE printable list of 50+ Outdoor ..."
  }, 
  {
    "id": "https://www.mge.com/earth-day/kids/", 
    "contents": "Earth Day is a day to celebrate our environment. Every year on April 22, millions \nof ordinary people participate in organized events that show we are concerned ..."
  }, 
  {
    "id": "https://artsymomma.com/category/holiday-crafts-activities/earth-day-crafts", 
    "contents": "Crafty Earth Day Activities For Kids ... Have you been looking for creative ways to \ncelebrate Earth Day, while still being kind to the planet and using… Read More ..."
  }, 
  {
    "id": "https://www.giftofcuriosity.com/earth-day-activities-page/", 
    "contents": "In the United States we celebrate Earth Day on April 22. This is a day for children \nto learn about our environment and take actions to help the Earth. The first ..."
  }, 
  {
    "id": "https://www.childrenscourtyard.com/blog/tag/earth-day-activities/", 
    "contents": "This year, Earth Day is Sunday, April 22. This day was created to spread \nawareness, information, and support of environmental protection across the \nworld."
  }
]