[
  {
    "id": "https://www.marthastewart.com/336138/basic-chicken-soup", 
    "contents": ""
  }, 
  {
    "id": "https://cooking.nytimes.com/recipes/1018442-chicken-soup-from-scratch", 
    "contents": "Preparation. Place the chicken, celery, carrots, onions, parsnip (if using), parsley, peppercorns, bay leaves and salt in a large soup pot and cover with cold water by 1 inch. Bring to a boil over high heat, then immediately reduce the heat to very low."
  }, 
  {
    "id": "https://www.allrecipes.com/recipe/8814/homemade-chicken-soup/", 
    "contents": "Directions. Put the chicken, carrots, celery and onion in a large soup pot and cover with cold water. Heat and simmer, uncovered, until the chicken meat falls off of the bones (skim off foam every so often). Take everything out of the pot. Strain the broth."
  }, 
  {
    "id": "https://www.recipetineats.com/homemade-chicken-noodle-soup-from-scratch/", 
    "contents": "May 17, 2017 ... A homemade Chicken Noodle Soup made from scratch using a whole chicken to \nmake the stock! A classic that everyone should know."
  }, 
  {
    "id": "https://www.marthastewart.com/336138/basic-chicken-soup", 
    "contents": "Directions. Bring chicken, water, and 1 tablespoon salt to a boil in a large stockpot. Skim foam. Add onions, celery, and garlic. Remove breast, and set aside. Add carrots. Remove remaining chicken; discard back and wings. Let cool slightly. Stir in desired amount of chicken; reserve the rest for another use. Skim fat."
  }, 
  {
    "id": "https://dishesanddustbunnies.com/old-fashioned-chicken-soup-from-scratch-using-a-whole-chicken/", 
    "contents": "Apr 1, 2015 ... You're here to find out how to make the best old fashioned chicken soup from \nscratch, right? Well, you've found it! This chicken soup is so good ..."
  }, 
  {
    "id": "http://www.geniuskitchen.com/recipe/classic-homemade-chicken-soup-329046", 
    "contents": "This is an old fashioned chicken soup the way my grandmother made it. She \npassed it ... Make egg noodles, rice, or dumplings to accompany. Eat and enjoy."
  }, 
  {
    "id": "https://www.thekitchn.com/how-to-make-chicken-soup-226779", 
    "contents": "Jan 28, 2016 ... And if you've somehow made it this far in life without making chicken soup from \nscratch using a whole chicken, then prepare yourself for ..."
  }, 
  {
    "id": "https://www.simplyrecipes.com/recipes/chicken_noodle_soup/", 
    "contents": "Jan 4, 2018 ... If you don't already have a cache of homemade chicken stock, the following is a \nrecipe for making the entire soup from scratch, starting with a ..."
  }, 
  {
    "id": "https://www.budgetbytes.com/chicken-noodle-soup/", 
    "contents": "I hadn't made chicken noodle soup from scratch in probably 6 or 7 years, but I \nknew it was exactly ... Make sure the pot continues to simmer for the whole hour."
  }, 
  {
    "id": "https://www.foodnetwork.com/recipes/old-fashioned-chicken-soup-recipe-1957811", 
    "contents": "Heat oil in large heavy pot. Cook onion and celery until translucent. Season \nchicken pieces liberally with salt and pepper. Place chicken skin side down in pot\n ..."
  }, 
  {
    "id": "https://www.spendwithpennies.com/homemade-chicken-noodle-soup/", 
    "contents": "Mar 3, 2018 ... Homemade Chicken Noodle soup takes about 20 minutes to make! This hearty \nsoup ... How Do You Make Chicken Noodle Soup from Scratch?"
  }, 
  {
    "id": "https://whatscookingamerica.net/soup/jewish-chicken-soup.htm", 
    "contents": "Making your own broth from scratch is very easy. Simply place the whole chicken \nin the pot with root vegetables, fresh herbs, cover with water, and walk away ..."
  }, 
  {
    "id": "https://www.grandmasglutenfreerecipes.com/grandmas-homemade-chicken-soup/", 
    "contents": "Apr 12, 2017 ... Do you love homemade chicken soup? For some reason, I only make this soup \nwhen someone is sick. This soup is as close to comfort food as ..."
  }, 
  {
    "id": "https://www.seattletimes.com/life/food-drink/the-key-to-the-best-chicken-soup-from-scratch-ditch-the-old-world-recipes/", 
    "contents": "Dec 12, 2016 ... During America's inexorable march toward processed food, chicken soup \nbecame something to buy, not something to make, but it is one of the ..."
  }, 
  {
    "id": "http://www.cookingforkeeps.com/best-chicken-noodle-soup-scratch/", 
    "contents": "Dec 1, 2016 ... So, I set out to make the best chicken noodle soup I've ever made. Everything is \ncompletely made from scratch from the chicken broth the ..."
  }, 
  {
    "id": "https://www.foodnetwork.com/recipes/food-network-kitchen/simple-chicken-soup-3363153", 
    "contents": "Get Simple Chicken Soup Recipe from Food Network. ... flavorful and soul-\nsatisfying as Grandma's chicken soup, but where hers took several ... Cooking \nSchool ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3DkKNqyE3OvZU", 
    "contents": "Dec 20, 2012 - 12 min - Uploaded by Revealed At LastWant to make some homemade chicken soup? Follow the steps in this easy to  follow video ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3D0xR2cC6Tea8", 
    "contents": "Jun 9, 2012 - 3 min - Uploaded by AllrecipesWatch how to make a simple, delicious homemade chicken soup. This easy  version is so ..."
  }, 
  {
    "id": "https://www.goodhousekeeping.com/food-recipes/cooking/tips/g2028/homemade-chicken-broth/", 
    "contents": "Nov 10, 2016 ... Nothing beats the flavor of homemade chicken broth. If you make this recipe in \nlarge batches, you can freeze it in sturdy containers for up to 3 ..."
  }, 
  {
    "id": "https://wholefully.com/chicken-noodle-soup-from-scratch/", 
    "contents": "Mar 1, 2015 ... Skip the can, and instead make the best Chicken Noodle Soup you've ever had—\ncompletely from scratch! Cold and flu season has nothing on ..."
  }, 
  {
    "id": "https://www.buzzfeed.com/lindsayhunt/chicken-soup-for-your-soul", 
    "contents": "Mar 1, 2016 ... Have you ever wondered why your mom's homemade chicken soup tasted so ... \namazingly delicious, from-scratch, homestyle chicken soup."
  }, 
  {
    "id": "https://www.tasteofhome.com/recipes/the-ultimate-chicken-noodle-soup", 
    "contents": "Of all the chicken noodle soup recipes out there, this one is my favorite, and is in \n... But real chicken soup is make from scratch using lots of chicken wings, and ..."
  }, 
  {
    "id": "https://www.tasteofhome.com/recipes/homemade-chicken-broth", 
    "contents": "Wondering how to make chicken broth at home? Learn here! Rich in chicken \nflavor, this traditional broth is lightly seasoned with herbs. Besides making ..."
  }, 
  {
    "id": "https://www.countryliving.com/food-drinks/recipes/a1870/homemade-chicken-noodle-soup-3996/", 
    "contents": "Dec 6, 2016 ... Slowly cooking a whole chicken, fragrant herbs, and fresh vegetables in chicken \nbroth rather than water imparts a rich flavor to this soup."
  }, 
  {
    "id": "https://www.epicurious.com/recipes-menus/how-to-make-chicken-soup-without-a-recipe-article", 
    "contents": "Apr 26, 2018 ... There are a lot of ways to make chicken soup. But what follows here is my favorite \nmethod for making chicken soup from scratch. It's a foolproof ..."
  }, 
  {
    "id": "https://longbournfarm.com/chicken-noodle-soup-scratch/", 
    "contents": "Mar 14, 2018 ... Making chicken noodle soup from scratch is so delicious. Learn how to make \namazing flavorful broth and perfect egg noodles! Try it today."
  }, 
  {
    "id": "https://www.bbc.com/food/recipes/chickensoup_1918", 
    "contents": "Pure soul food, this warming, easy chicken soup makes the most of leftover roast \nchicken. Each serving provides 288kcal, 28g protein, 11.5g carbohydrate (of ..."
  }, 
  {
    "id": "https://wellnessmama.com/276/chicken-vegetable-soup/", 
    "contents": "Jun 17, 2018 ... I also just love making this chicken soup (and other soups) during the ... If you've \nnever made chicken soup from scratch before, I encourage ..."
  }, 
  {
    "id": "https://www.apinchofhealthy.com/chicken-noodle-soup-scratch/", 
    "contents": "You may never feel the urge to buy the canned stuff again after I show you how to \nmake chicken noodle soup from scratch. So easy and delicious!"
  }, 
  {
    "id": "https://www.bettycrocker.com/recipes/easy-chicken-noodle-soup/224fc2d5-fbca-4507-91d5-83a2751b8f0c", 
    "contents": "Try this easy chicken noodle soup recipe that comes together in just 25 minutes. \n... am making chicken noodle soup from scratch then everyone gets so excited!!!"
  }, 
  {
    "id": "https://www.familyfreshmeals.com/2014/03/easy-homemade-chicken-broth.html", 
    "contents": "Tuesday I shared one of the easiest and BEST Homemade Chicken Noodle \nSoup recipes around. In my opinion, the key to making it the best soup around \nstarts ..."
  }, 
  {
    "id": "https://thecozyapron.com/how-to-make-chicken-broth/", 
    "contents": "Feb 6, 2018 ... If you've ever wondered how to make chicken broth from scratch, the good news \nis that it's quite simple! All you need is a handful of quality ..."
  }, 
  {
    "id": "http://www.instructables.com/id/Chicken-Soup-from-Scratch/", 
    "contents": "Dec 28, 2011 ... Picture of Chicken Soup From Scratch ... Here's a simple from scratch made \nchicken soup recipe that anyone can ... Did you make this project?"
  }, 
  {
    "id": "https://www.twopeasandtheirpod.com/easy-chicken-and-rice-soup-recipe/", 
    "contents": "This chicken and rice soup is easy to make and perfect for a cold day."
  }, 
  {
    "id": "https://www.jocooks.com/recipes/instant-pot-chicken-noodle-soup/", 
    "contents": "Jan 2, 2018 ... The secret to good chicken noodle soup is to make the broth from scratch using \nchicken with skin and bones. My mom always made her soup ..."
  }, 
  {
    "id": "https://www.elizabethrider.com/best-homemade-chicken-stock-recipe/", 
    "contents": "Once you learn how to make this homemade chicken stock, you'll be hooked for \nlife. There's a reason that chicken stock is used as the base of so many soups ..."
  }, 
  {
    "id": "https://www.seriouseats.com/recipes/2017/12/classic-chicken-soup.html", 
    "contents": "This classic chicken soup is exactly what you need, whether to soothe a cold or \njust to warm your ... Read more: How to Make Classic Chicken Soup."
  }, 
  {
    "id": "https://www.bhg.com/recipes/how-to/cooking-basics/how-to-make-chicken-noodle-soup/", 
    "contents": "If you want to learn how to make chicken noodle soup from scratch, the first step \nis learning how to make homemade noodles. Making homemade pasta might ..."
  }, 
  {
    "id": "https://www.ctv.ca/YourMorning/Articles/December-2017/Making-chicken-soup-from-scratch-stock-and-all-i", 
    "contents": "Dec 5, 2017 ... Mary Tang from Gusto TV's One World Kitchen dropped by the Your Morning \nkitchen to share a delicious recipe for a chicken soup."
  }, 
  {
    "id": "http://www.simplyscratch.com/2012/10/easy-homemade-chicken-noodle-soup.html", 
    "contents": "Oct 17, 2012 ... Easy Homemade Chicken Noodle Soup l SimplyScratch.com ... store, they don't \nmake it overly salty… and they really boost up the flavor."
  }, 
  {
    "id": "https://www.mommypotamus.com/instant-pot-chicken-soup-recipe/", 
    "contents": "This recipe for belly-warming instant pot chicken soup was declared one of the ... \nI'll be sharing a tutorial for making it in an Instant Pot next week, but here are \nsome ..... I've never made a chicken soup from total scratch before (using a whole\n ..."
  }, 
  {
    "id": "https://tastesbetterfromscratch.com/chicken-noodle-soup/", 
    "contents": "Nov 7, 2017 ... The BEST chicken noodle soup you'll ever make, starts with a simple homemade \nchicken broth, and the option of making your own egg ..."
  }, 
  {
    "id": "https://www.washingtonpost.com/news/food/wp/2017/03/14/this-simple-chicken-soup-recipe-is-all-you-really-need/", 
    "contents": "Mar 14, 2017 ... Through testing and tips from experts, we have developed a method for making \nchicken soup that fits the description above. Hopefully, it can ..."
  }, 
  {
    "id": "https://www.number-2-pencil.com/instant-pot-chicken-noodle-soup/", 
    "contents": "Dec 12, 2016 ... Homemade Instant Pot chicken noodle soup from scratch in less than an hour. ... \nIt's easy to make, and you won't believe how delicious it is."
  }, 
  {
    "id": "https://www.southernliving.com/dish/soup/how-to-make-chicken-noodle-soup", 
    "contents": "Homemade chicken stock will take your soup from good to great. And if you're \ngoing to make it from scratch, you should use a whole chicken. Chicken stock that\n ..."
  }, 
  {
    "id": "http://www.myrecipes.com/recipe/soulful-chicken-soup", 
    "contents": "No dish is quite as soothing as a hearty bowl of chicken noodle soup. ... To make \nsure they aren't mushy and overcooked, don't leave them in the slow cooker ..."
  }, 
  {
    "id": "http://www.simplebites.net/how-to-make-soup-from-scratch/", 
    "contents": "Apr 27, 2011 ... There are even chilled soups and dessert soups. Most often, when people want \nto make soup, they go look for a recipe. “Do you want chicken ..."
  }, 
  {
    "id": "https://www.chowhound.com/recipes/slow-cooker-chicken-soup-30868", 
    "contents": "This easy recipe cooks a whole chicken along with veggies in a slow cooker for a \nflavorful and simple chicken soup; add noodles or rice before serving."
  }, 
  {
    "id": "https://www.webmd.com/food-recipes/homemade-chicken-broth", 
    "contents": "Nothing soothes, nourishes and comforts like homemade chicken broth. Canned \nbroth is a handy standby for quick soups, but homemade delivers maximum ..."
  }, 
  {
    "id": "https://www.cookstr.com/Recipes-for-Soup/Chicken-Soup-Lora-Brody", 
    "contents": "This recipe from Laura Brody will walk you through how to make chicken soup \nfrom scratch, including the stock. Traditional ingredients, such as carrots, onions,\n ..."
  }, 
  {
    "id": "https://enthusiasts.ciachef.edu/how-to-make-chicken-broth/", 
    "contents": "Make the best chicken broth from scratch with CIA Chef Bill Briwa's video—learn \nwhat tools to use, how to include mirepoix and aromatic herbs, and how to keep ..."
  }, 
  {
    "id": "https://www.thepinningmama.com/best-homemade-chicken-noodle-soup-recipe/", 
    "contents": "Nov 17, 2016 ... Well, let me tell you, Homemade Chicken Noodle Soup is D-O-N-E. ... This is also \nhow you make chicken broth and why it has so much amazing ..... broth to make \nhomemade water based (or broth) veggie soup from scratch."
  }, 
  {
    "id": "http://www.eatingwell.com/recipe/247920/homemade-chicken-broth/", 
    "contents": "Nothing soothes, nourishes and comforts like homemade chicken broth. Canned \nbroth is a ... For a twist add Ranch flavor to make every dish better. “LEARN."
  }, 
  {
    "id": "https://www.averiecooks.com/easy-30-minute-homemade-chicken-noodle-soup/", 
    "contents": "Oct 2, 2016 ... Chicken noodle soup is one of the fondest memories I have of my grandmother's \ncooking. Classic, comforting, a cure-all for whatever ailed me, ..."
  }, 
  {
    "id": "http://smittenkitchen.com/2012/10/chicken-noodle-soup/", 
    "contents": "Oct 10, 2012 ... I just used this recipe to make my very first chicken soup from scratch EVER! I've \nbeen reading your blog for at least 5 years now and it's been ..."
  }, 
  {
    "id": "https://www.bowlofdelicious.com/2016/09/15/easy-chicken-and-dumplings-from-scratch/", 
    "contents": "Sep 15, 2016 ... But almost every “quick and easy” recipe for chicken and dumplings I've ... and \nstore-bought broth, chicken and dumplings from scratch is a fast ..."
  }, 
  {
    "id": "https://www.bonappetit.com/test-kitchen/cooking-tips/article/effed-it-up-building-flavor-soup", 
    "contents": "Jan 15, 2016 ... One tip that'll change your soup-making life. ... Yes, you will have a chicken soup, \nand it will taste okay. But the flavor will be flat, vegetal, and ..."
  }, 
  {
    "id": "https://www.foodiecrush.com/homemade-chicken-noodle-soup/", 
    "contents": "Sep 16, 2014 ... How to Make Chicken Noodle Soup from Scratch. Why make homemade soup \nwhen you can just pry open a can? Duh! Because it's ..."
  }, 
  {
    "id": "https://iowagirleats.com/2016/04/01/easy-chicken-and-rice-soup/", 
    "contents": "Apr 1, 2016 ... Easy Chicken and Rice Soup is a quick and simple gluten-free soup recipe ... 70s \none day, 40s the next – my advice is to make this easy soup ..."
  }, 
  {
    "id": "https://selfproclaimedfoodie.com/creamy-chicken-soup/", 
    "contents": "Sep 28, 2017 ... This recipe tells you how to make chicken soup, but the creamy soup part takes it \nover the ... How to make creamy chicken soup from scratch?"
  }, 
  {
    "id": "http://www.eatingwell.com/recipe/247920/homemade-chicken-broth/", 
    "contents": "Nothing soothes, nourishes and comforts like homemade chicken broth. Canned \nbroth is a ... For a twist add Ranch flavor to make every dish better. “LEARN."
  }, 
  {
    "id": "https://colorfulrecipes.com/instant-pot-chicken-soup-scratch/", 
    "contents": "Instant Pot Chicken Soup From Scratch; The easiest and most comforting \nhomemade soup you will ever make in your Instant Pot pressure cooker!"
  }, 
  {
    "id": "https://selfproclaimedfoodie.com/creamy-chicken-soup/", 
    "contents": "Sep 28, 2017 ... This recipe tells you how to make chicken soup, but the creamy soup part takes it \nover the ... How to make creamy chicken soup from scratch?"
  }, 
  {
    "id": "https://norecipes.com/best-chicken-soup-recipe", 
    "contents": "Beyond its curative abilities, chicken soup isn't something I normally crave. If I'm \nlucky to have the time to make it from scratch, the meat often ends up dry and ..."
  }, 
  {
    "id": "https://www.dadcooksdinner.com/pressure-cooker-chicken-soup-with-rice-from-scratch/", 
    "contents": "May 16, 2017 ... Cooking once, cooking twice, pressure cooking chicken soup with rice. ... How to \nmake chicken soup in the pressure cooker…from scratch."
  }, 
  {
    "id": "https://www.realsimple.com/food-recipes/browse-all-recipes/classic-chicken-soup", 
    "contents": "How to Make It. Step 1. Place the chicken in a large pot. Cut 3 of the carrots and 2 \nof the celery stalks into 1-inch pieces. Quarter the onion. Add the cut ..."
  }, 
  {
    "id": "https://www.finecooking.com/recipe/homemade-chicken-broth", 
    "contents": "Making your own chicken broth if an easy proposition. All is requires is throwing a \nchicken and some vegetables into a pot and them letting them simmer."
  }, 
  {
    "id": "https://www.averiecooks.com/easy-30-minute-homemade-chicken-noodle-soup/", 
    "contents": "Oct 2, 2016 ... Chicken noodle soup is one of the fondest memories I have of my grandmother's \ncooking. Classic, comforting, a cure-all for whatever ailed me, ..."
  }, 
  {
    "id": "https://www.chicken.ca/recipes/old-fashioned-chicken-soup", 
    "contents": "A from-scratch chicken soup made from chicken legs simmered into a simple \nbroth. No need for ready-to-serve chicken broth when it is so simple to make your\n ..."
  }, 
  {
    "id": "https://www.wikihow.com/Make-Chicken-Soup", 
    "contents": "How to Make Chicken Soup. Whether you've got the flu or you've just got a \nhankering, chicken soup is delicious, healthy, and easy to prepare."
  }, 
  {
    "id": "http://thepioneerwoman.com/cooking/chunky-chicken-soup/", 
    "contents": "Dec 14, 2011 ... At the end of the cooking time, carefully remove the chicken from the pot and \nplace it on a plate ... I should have called it Chunky Chicken Soup."
  }, 
  {
    "id": "https://pinchofyum.com/homemade-cream-of-chicken-soup", 
    "contents": "Dec 4, 2012 ... Today is a good day to make your own homemade cream of chicken soup. ... \nHow to Make Our Cream of Chicken Soup (45 SEC): ..... But now I can make it \nmyself and still claim that the whole dish is home-made from scratch ..."
  }, 
  {
    "id": "https://www.delish.com/cooking/recipe-ideas/recipes/a55661/easy-crockpot-chicken-noodle-soup-recipe/", 
    "contents": "Sep 21, 2017 ... Crock-Pot Chicken Noodle Soup.\n ... In a slow cooker, combine chicken, onion, carrots, celery, oregano, rosemary, garlic, and bay leaf and season generously with salt and pepper.\n ... Return chicken to slow cooker and add pasta."
  }, 
  {
    "id": "https://www.craftsy.com/cooking/article/homemade-chicken-soup/", 
    "contents": "Apr 3, 2014 ... Everything about cooking homemade chicken soup is good. It heals the sick. It \nsoothes the soul. It's cheap and filling and nutritious. Make a big ..."
  }, 
  {
    "id": "https://www.foodandwine.com/recipes/poached-chicken-soup", 
    "contents": "Poaching in broth also happens to be a great way to cook chicken, ranking right \n... 2 tablespoons cooking oil; 1 onion, chopped; 1 carrot, chopped; 1 rib celery, ..."
  }, 
  {
    "id": "https://detoxinista.com/classic-chicken-vegetable-soup/", 
    "contents": "This Chicken Vegetable Soup is ultra-comforting and packed with healthy ... \nMaking soup is a great way to get rid of anything that's starting to wilt in your \nfridge, ..."
  }, 
  {
    "id": "https://www.the-girl-who-ate-everything.com/homemade-chicken-noodle-soup/", 
    "contents": "Nov 1, 2016 ... This Homemade Chicken Noodle Soup is a tried and true comfort food. I've \nincluded an easy recipe for homemade noodles that makes it even ..."
  }, 
  {
    "id": "https://www.closetcooking.com/2013/01/chicken-broth.html", 
    "contents": "One of the things that I like about making chicken broth is the reduction in waste! \n.... Also, can you explain to this cooking from scratch newbie exactly what is the ..."
  }, 
  {
    "id": "https://natashaskitchen.com/easy-chicken-noodle-soup-recipe/", 
    "contents": "Mar 24, 2015 ... This chicken noodle soup is super simple to make - no need to trim the chicken \nahead of time since the fat comes off easily after it's boiled."
  }, 
  {
    "id": "http://www.whatmegansmaking.com/2012/01/chicken-noodle-soup.html", 
    "contents": "Jan 18, 2012 ... It's one of the first recipes I asked her to teach me to make when I moved out ... If \nyou haven't made chicken noodle soup from scratch before, ..."
  }, 
  {
    "id": "https://www.maangchi.com/recipe/dak-kalguksu", 
    "contents": "Mar 30, 2014 ... Dak-kalguksu 닭칼국수.\n I’m sharing my family’s all-time favorite food with you today, chicken noodle soup – dak-kalguksu in Korean.\n The word kal means knife and guksu means noodle soup, indicating that the noodles in this soup are made by cutting them from the dough."
  }, 
  {
    "id": "http://www.dailydiylife.com/homemade-condensed-cream-chicken-soup-no-cans/", 
    "contents": "However, I prefer to make Condensed Cream of Chicken Soup from scratch \nwhen ever time allows. You can make a double or even a triple batch to divide \nand ..."
  }, 
  {
    "id": "https://www.dallasnews.com/life/cooking/2016/11/29/fragrant-delicious-homemade-chicken-soup-easier-make-might-think", 
    "contents": "Dec 6, 2017 ... How are you feeling? Not so great? Yeah, I thought so.When someone sneezes \nat my house, I reach for a chicken – to make soup. It's what my ..."
  }, 
  {
    "id": "https://www.curiouscuisiniere.com/chicken-dumplings-crock-pot/", 
    "contents": "Feb 9, 2018 ... ... scratch. (No cream of chicken soup here!) ... Not only does making chicken and \ndumplings in the slow cooker make the prep work super easy."
  }, 
  {
    "id": "https://damndelicious.net/2016/10/27/slow-cooker-chicken-noodle-soup/", 
    "contents": "Oct 27, 2016 ... Slow Cooker Chicken Noodle Soup - Made right in the crockpot! ... (Eat the \ncooked chicken meat as is or make chicken salad or use in casseroles.) .... cook \nchic. soup from scratch–next time i will try the limon juice –thanks."
  }, 
  {
    "id": "https://www.onceuponachef.com/recipes/chicken-soup-matzo-balls.html", 
    "contents": "(Note: definitely do not cook them in your chicken soup, or the broth will ... (Note: \nif you're making the matzo balls at the last minute, you can transfer them right ..."
  }, 
  {
    "id": "https://recipes.sparkpeople.com/recipe-detail.asp%3Frecipe%3D396849", 
    "contents": "This is my basic, very low sodium chicken broth. I make this in huge batches and \nfreeze some for later use."
  }, 
  {
    "id": "https://steamykitchen.com/139-vietnamese-chicken-noodle-soup-pho-ga.html", 
    "contents": "In this Vietnamese Chicken Pho (Pho Ga) recipe, you'll learn how to make a ... In \nthis recipe, an entire chicken is used for making soup, and for slicing to serve ..."
  }, 
  {
    "id": "https://www.dashofsanity.com/chicken-pot-pie-soup/", 
    "contents": "My favorite kitchen items to make this CHICKEN POT PIE SOUP are below, ... \nCHICKEN POT PIE SOUP - a deliciously simple soup recipe made from scratch."
  }, 
  {
    "id": "https://www.thespruceeats.com/chicken-soup-tips-and-hints-1809215", 
    "contents": "Feb 1, 2018 ... Chicken feet makes for a great broth. Learn more tips and hints for making the \nbest chicken soup."
  }, 
  {
    "id": "https://www.melskitchencafe.com/homemade-condensed-cream-of-chicken-soup-and-how-to-sub-in-recipes/", 
    "contents": "Sep 15, 2014 ... ... of chicken soup? Try this from-scratch recipe! ... Homemade Condensed \nCream of Chicken Soup {And How to Sub in Recipes}. posted by Mel on ... 1) \nSimply make the recipe below (doubling or even tripling as needed)."
  }, 
  {
    "id": "https://www.backtothebooknutrition.com/classic-chicken-noodle-soup-easy-homemade-broth-recipe/", 
    "contents": "Mar 13, 2015 ... Is it just me or has this year's stomach bug been making more rounds ... From-\nscratch chicken noodle soup, made with real chicken broth (we'll ..."
  }, 
  {
    "id": "http://lovegrowswild.com/2016/02/creamy-chicken-noodle-soup/", 
    "contents": "Feb 4, 2016 ... This homemade Creamy Chicken Noodle Soup is easy to make and so \ncomforting! Get the recipe for this super creamy homemade soup at ..."
  }, 
  {
    "id": "https://toriavey.com/toris-kitchen/perfect-chicken-soup/", 
    "contents": "Mar 25, 2012 ... This is the way I make chicken soup for my family. ... learned over the years that \nit's just as easy– and cheaper– to make your own from scratch."
  }, 
  {
    "id": "http://girlandthekitchen.com/jewish-chicken-soup-with-matzo-balls-the-real-jewish-penicillin/", 
    "contents": "Today, my mother isn't around anymore to make me a batch of chicken soup, but \nevery time I make my own it still soothes my soul and makes me feel like she is ..."
  }, 
  {
    "id": "https://www.thenourishinggourmet.com/2010/10/homemade-chicken-broth.html", 
    "contents": "Oct 8, 2010 ... While really an essential all year round, chicken broth is especially appreciated \nonce fall rolls around. I definitely consider it a fall essential."
  }, 
  {
    "id": "https://livingwellmom.com/healing-paleo-chicken-soup/", 
    "contents": "Jan 11, 2016 ... This easy-to-make Paleo Chicken Soup recipe is so tasty, even kids gobble it up \nand ask for more! It's packed with nutrients and healing herbs ..."
  }, 
  {
    "id": "https://www.modernhoney.com/mamas-best-chicken-soup/", 
    "contents": "Mar 7, 2016 ... Chicken tenders are the perfect choice when making this soup. They are smaller \nin size than a chicken breast, so will cook faster and be more ..."
  }, 
  {
    "id": "https://www.landolakes.com/recipe/20247/super-easy-chicken-rice-soup/", 
    "contents": "Use leftover rice and purchase a rotisserie chicken to make this super easy yet \nheartwarming soup."
  }
]