[
  {
    "id": "https://www.healthline.com/health/lump-in-throat", 
    "contents": ""
  }, 
  {
    "id": "https://www.healthline.com/health/lump-in-throat", 
    "contents": "Feeling a lump, bump, or swelling in your throat without having an actual lump is known as globus sensation. ... If you experience this sensation but have no difficulty swallowing, you're likely experiencing the common globus sensation."
  }, 
  {
    "id": "https://www.medicalnewstoday.com/articles/320245.php", 
    "contents": "Dec 5, 2017 ... Globus sensation is the feeling of having a 'lump' in the throat. Globus sensation is a persistent sensation of a lump in the throat."
  }, 
  {
    "id": "https://www.cancerresearchuk.org/about-cancer/cancer-chat/thread/lump-in-throat-with-discomfort-with-pics-of-lump", 
    "contents": "I have been suffering with my throat for over a year now, since last May. It all \nstarted when I kept feeling a lump sensation in my throat when ..."
  }, 
  {
    "id": "https://www.merckmanuals.com/home/digestive-disorders/symptoms-of-digestive-disorders/lump-in-throat", 
    "contents": "Some people feel as if they have a lump or mass in their throat when no mass is actually there. If this sensation is unrelated to swallowing, it is termed globus sensation, or globus hystericus (which does not mean the person is hysterical)."
  }, 
  {
    "id": "https://patient.info/health/difficulty-swallowing-dysphagia/globus-sensation", 
    "contents": "Globus sensation is the feeling of having a lump in the throat when in fact there is \nnothing there. The sensation can come and go. It does not interfere with eating ..."
  }, 
  {
    "id": "https://www.calmclinic.com/anxiety/symptoms/lump-in-throat", 
    "contents": "Feeling like you have a lump in your throat can be stressful, and may cause you \nto worry about choking or cancer. But throat lumps can be caused by anxiety, ..."
  }, 
  {
    "id": "https://www.healthxchange.sg/head-neck/ear-nose-throat/lump-throat-dysphagia", 
    "contents": "Every now and then, I have a feeling there is a lump in my throat. It feels like my \nuvula (the piece of flesh protruding from the roof of the mouth) is touching the ..."
  }, 
  {
    "id": "https://www.doctoroz.com/article/i-have-lump-my-throat", 
    "contents": "Mar 11, 2010 ... If you have a lump in your throat every time you swallow or even every time you \ntalk, what is going on there? Could this be a sign of throat ..."
  }, 
  {
    "id": "https://www.buoyhealth.com/symptoms-a-z/feeling-lump-throat/", 
    "contents": "Understand your feeling of a lump in the throat symptoms, including top 4 causes \n& common questions. Check symptoms in real time with our Symptom Checker!"
  }, 
  {
    "id": "https://www.belmarrahealth.com/lump-in-throat-globus-sensation-warning-signs-causes-and-treatment/", 
    "contents": "May 2, 2016 ... Lump in throat (globus sensation) is the feeling of having a mass in one's throat, \neven if there is nothing physically present."
  }, 
  {
    "id": "https://www.bmj.com/content/348/bmj.f7195", 
    "contents": "Jan 7, 2014 ... A 58 year old woman presents with a six month history of what she describes as \na sensation of a lump in her throat. This has been intermittent ..."
  }, 
  {
    "id": "https://www.fauquierent.net/globus.htm", 
    "contents": "May 29, 2018 ... There is a lump in my throat!\"\n ... This lump or swollen sensation in the neck is most often described as \"annoying,\" but not painful.\n ... In the photo, the person is pointing exactly on the cricoid cartilage, which coincidentally, is where individuals with globus pharyngeus complain the ..."
  }, 
  {
    "id": "https://www.sciencealert.com/why-do-we-get-a-lump-in-our-throats-when-we-re-sad", 
    "contents": "Jun 10, 2016 ... But it's not just tears that accompany great sadness or joy - we get that strange \nlump in our throat too. So what causes a physical reaction in one ..."
  }, 
  {
    "id": "http://www.anxietycentre.com/anxiety/symptoms/constant-lump-in-throat-feeling.shtml", 
    "contents": "Apr 21, 2018 ... Having a constant lump in the throat feeling, such as when swallowing, can be a \nsymptom of anxiety. There are other causes, too. Learn how to ..."
  }, 
  {
    "id": "https://www.livestrong.com/article/9966-diagnose-lump-throat/", 
    "contents": "Aug 14, 2017 ... Lumps in the throat that you can feel with your fingers from the outside of your \nneck can mean anything from a swollen lymph node to a thyroid ..."
  }, 
  {
    "id": "https://www.painscience.com/articles/lump-in-the-throat.php", 
    "contents": "Nov 16, 2016 ... The story of a fierce little lump in my throat, with a side of science."
  }, 
  {
    "id": "https://anxietyexit.com/lump-in-the-throat-sensation-anxiety/", 
    "contents": "Dec 3, 2017 ... What does that incredibly uncomfortable lump in the throat sensation mean, and \nhow to get rid of it? Learn more about this anxiety sensation ..."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Globus_pharyngis", 
    "contents": "Globus pharyngis is the persistent sensation of having phlegm, a pill or some \nother sort of obstruction in the throat when there is none. ... The \"lump in the \nthroat\" sensation that characterizes globus pharyngis is often caused by \ninflammation of ..."
  }, 
  {
    "id": "http://www.tonyhumphreys.ie/articles/2007/12/a-lump-in-the-throat", 
    "contents": "Dec 5, 2007 ... A common psychosomatic complaint is having 'a lump in the throat' or 'a terrible \npain in my throat' or 'a constant need to clear my throat."
  }, 
  {
    "id": "https://www.refinery29.com/lump-in-throat-feeling-crying-globus-pharyngeus", 
    "contents": "Feb 28, 2018 ... If you're a crier, you've probably dealt with the sensation of a \"lump\" in your throat. \nHere's what's actually happening in your body."
  }, 
  {
    "id": "https://www.rd.com/health/wellness/sad-lump-in-throat/", 
    "contents": "Aug 14, 2017 ... The lump you feel in the back of your throat when you're fighting back tears isn't a \nlump at all. It's muscles in your throat working against each ..."
  }, 
  {
    "id": "https://healthfully.com/rid-lump-throat-7479216.html", 
    "contents": "The sensation of having a lump in your throat can be very irritating.\n Many things can cause this feeling, from not quite swallowing food or drink correctly to having excess mucus or saliva.\n ... If the lump in your throat is caused by acid reflux, this could help the feeling to go away."
  }, 
  {
    "id": "https://idioms.thefreedictionary.com/lump%2Bin%2Bthroat", 
    "contents": "A feeling that one is unable to speak due to sadness, anxiety, or another strong \nemotion. I had a lump in my throat as I watched the casket of the fallen soldier ..."
  }, 
  {
    "id": "https://idioms.thefreedictionary.com/lump%2Bin%2Byour%2Bthroat", 
    "contents": "A feeling that one is unable to speak due to sadness, anxiety, or another strong \nemotion. I had a lump in my throat as I watched the casket of the fallen soldier ..."
  }, 
  {
    "id": "http://www.dictionary.com/browse/lump-in-one-s-throat", 
    "contents": "Lump in one's throat definition, the passage from the mouth to the stomach or to \nthe lungs, including the pharynx, esophagus, larynx, and trachea. See more."
  }, 
  {
    "id": "https://healthunlocked.com/parkinsonsmovement/posts/136751563/lump-in-throat", 
    "contents": "Nov 21, 2017 ... I recently had problems swallowing - it feels as if I have a lump in my throat. I \nthought initially it was Parkinson's related, but though my ..."
  }, 
  {
    "id": "http://www.thetimes-tribune.com/news/health-science/lump-in-throat-may-be-allergies-1.1213876", 
    "contents": "Breaking local news, national news, sports, politics and world news from The \nTimes-Tribune and thetimes-tribune.com covering all of Scranton, Lackawanna ..."
  }, 
  {
    "id": "https://dictionary.cambridge.org/us/dictionary/english/a-lump-in-your-throat", 
    "contents": "a lump in your throat meaning: a tight feeling in your throat because of a strong \nemotion, esp. sadness: . Learn more."
  }, 
  {
    "id": "https://healthyliving.azcentral.com/symptoms-of-gerd-lump-in-the-throat-12215459.html", 
    "contents": "The main symptoms of GERD are persistent acid-reflux/heartburn, difficulty/\npainful swallowing, feeling of a lump in the throat, regurgitation, and chest pain."
  }, 
  {
    "id": "http://scarysymptoms.com/2012/01/lump-in-throat-causes-and-solutions/", 
    "contents": "May 3, 2017 ... The biggest cause, however, for the throat lump, and for the sensation that \nsomething is stuck there, is ANXIETY – including anxiety over ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3DiU-NatyssBw", 
    "contents": "May 22, 2017 - 3 min - Uploaded by Doctors' Circle - Ask Doctors. Free Video Answers.The causes are mainly emotional stress or acid reflux.  So if you control these two effectively, then ..."
  }, 
  {
    "id": "https://www.hxbenefit.com/lump-in-throat.html", 
    "contents": "Feb 4, 2012 ... Are you lately suffering from a sensation of having an abnormal mass or lump in \nyour throat? If you are, read on to know all about the causes, ..."
  }, 
  {
    "id": "https://www.urbandictionary.com/define.php%3Fterm%3Dlump%2520in%2520the%2520throat", 
    "contents": "That overwhelming feeling u get when you are hit wit such emotion, that u almost \nwant to cry, but cant seem to get anything out because of a lump in your throat,"
  }, 
  {
    "id": "https://mashable.com/2018/06/06/doctor-hgtv-woman-cancer-diagnosis-gma/", 
    "contents": "Jun 6, 2018 ... A woman was diagnosed with cancer after a doctor watching the HGTV show she \nappeared on noticed a lump on the woman's throat."
  }, 
  {
    "id": "http://www.rjwhelan.co.nz/conditions/lump_in_throat.html", 
    "contents": "Take 2-3 mls (approx 1/2 a tsp.) in just a little water, gargle and move around the \nback of the throat for a good 10-20 seconds before swallowing. Repeat the ..."
  }, 
  {
    "id": "http://www.royalberkshire.nhs.uk/patient-information-leaflets/Ent%2520Globus%2520feeling%2520of%2520lump%2520in%2520the%2520throat.htm", 
    "contents": "Globus is the medical term for a sensation of a lump in the throat where no true ... \nThe main symptom is a feeling of a lump, constriction (tension), or tightness in ..."
  }, 
  {
    "id": "https://symptomchecker.webmd.com/multiple-symptoms%3Fsymptoms%3Dlump-or-bulge%257Cthroat-tightness%26symptomids%3D148%257C235%26locations%3D10%257C10", 
    "contents": "WebMD Symptom Checker helps you find the most common medical conditions \nindicated by the symptoms Lump or bulge and Throat tightness and including ..."
  }, 
  {
    "id": "https://throatdisorder.com/swallowing-disorders/lump-in-the-throat-sensation/", 
    "contents": "The lump in throat sensation also known as “globus pharyngeus” is quite \ncommon and can have many causes. Learn more about diagnosis, symptoms, ..."
  }, 
  {
    "id": "https://www.celiac.com/forums/topic/37020-closed-throat-lump-in-throat-feeling/", 
    "contents": "1 day ago ... Hi, recently diagnosed with wheat, oat, barley, eggs, soy allergies. Allergist didnt \nmention celiac term to me at all. I have cut out all of the ..."
  }, 
  {
    "id": "http://www.iflscience.com/health-and-medicine/why-do-we-get-lump-our-throats-when-were-sad/", 
    "contents": "Before the embarrassing tears started really flowing, I felt a lump in my throat. \nMany of us who cry or are on the verge of crying often feel the same lump-like ..."
  }, 
  {
    "id": "https://indianapublicmedia.org/amomentofscience/a-lump-in-your-throat/", 
    "contents": "Mar 19, 2013 ... Oftentimes when we cry, we feel a lump in the throat. Does a lump actually form, \nor is there some other explanation? Learn more on this ..."
  }, 
  {
    "id": "http://abc7chicago.com/entertainment/doctor-alerts-woman-on-hgtv-of-lump-on-her-throat/3568727/", 
    "contents": "Jun 4, 2018 - 48 secA surgeon who noticed something wrong with a woman he saw on television  went on a mission ..."
  }, 
  {
    "id": "https://www.beyondblue.org.au/get-support/online-forums/treatments-health-professionals-and-therapies/anxiety---lump-in-my-throat", 
    "contents": "May 7, 2015 ... The lump in my throat has been consistent for around the last month before I \nstarted the B vitamins. Actually as a side note since being on the ..."
  }, 
  {
    "id": "https://crazyjackz.com/acid-reflux-lump-in-throat-feeling/", 
    "contents": "Recent research clearly revealed everything about acid reflux lump in throat, \ndifficulty swallowing, and how it is caused. If you are reading this article, you \nmight ..."
  }, 
  {
    "id": "http://www.wakehealth.edu/Health-Central/Swallowing-Expert-Says-Globus-Should-Be-Treated/", 
    "contents": "Sep 30, 2016 ... Patients call a “lump in the throat,” but your Primary Care Physician calls it “\nGlobus” and it's treatable, Wake Forest Baptist Health North ..."
  }, 
  {
    "id": "https://www.wisdomnaturalbrands.com/drugs.php%3Fsell%3Dfluoxetine-lump-in-throat%26us%3D3", 
    "contents": "Jun 11, 2018 ... Fluoxetine lump in throat, - Accutane rash. Viagra USA – Buy Viagra (sildenafil)\nfrom the USs leading No 1 online Pharmacy, established 1996 ..."
  }, 
  {
    "id": "https://www.parkside-hospital.co.uk/news/globus-pharyngeus/", 
    "contents": "Globus Pharyngeus refers to the feeling of a lump in the throat. Some people \ndescribe this as a 'tightness' in the throat which is commonly felt when swallowing\n ..."
  }, 
  {
    "id": "https://community.macmillan.org.uk/cancer_types/thyroid-cancer/f/171/t/119214", 
    "contents": "Dec 5, 2016 ... I have an odd 'lump' in my throat sometimes, post TT and full neck dissection and \nlymph removal. The 'lump' is like you get when you are about ..."
  }, 
  {
    "id": "http://www.medic8.com/healthguide/sore-throat/lumps-in-the-throat.html", 
    "contents": "An infection such as that caused by swollen glands can cause a lump in the \nthroat. These glands or 'lymphatic nodes' are present in the throat and neck area\n ..."
  }, 
  {
    "id": "http://www.iodine-resource.com/lump-in-throat.html", 
    "contents": "Find out what causes a lump in your throat and the possible solutions."
  }, 
  {
    "id": "https://www.nhs.uk/conditions/head-and-neck-cancer/", 
    "contents": "Mouth cancer; Laryngeal cancer; Throat cancers; Salivary gland cancer; Nose \nand ... mouth ulcers and/or a lump in your mouth, both of which may be painful."
  }, 
  {
    "id": "https://myhealth.alberta.ca/Health/aftercareinformation/pages/conditions.aspx%3Fhwid%3Dabq5975", 
    "contents": "The condition that people refer to as a \"lump in the throat\" is a feeling that an \nobject is stuck in your throat. It's also called globus (say \"GLOH-bus\"). You don't ..."
  }, 
  {
    "id": "http://www.entandallergy.com/how-we-help-you/article/throat-and-mouth-throat-mucous-lump-sensation", 
    "contents": "Throat Mucous/Tickle/Lump Sensation by Joel Portnoy, M.D.. Whether patients \ncall it postnasal drip, phlegm, mucus or a lump, the feeling of “something in my ..."
  }, 
  {
    "id": "https://www.insideedition.com/woman-diagnosed-cancer-after-doctor-spots-lump-her-throat-during-hgtv-appearance-43910", 
    "contents": "Jun 5, 2018 ... Woman Diagnosed With Cancer After Doctor Spots Lump on Her Throat During \nHGTV Appearance. Inspirational 2:39 PM PDT, June 5, 2018 ..."
  }, 
  {
    "id": "https://www.medhelp.org/posts/Allergies---Food/lump-in-throat/show/1279340", 
    "contents": "I have been having a lump in my throat for several months. After thinking I was \ngetting food caught in my throat and even getting an endoscopy I've begun to ..."
  }, 
  {
    "id": "https://www.iqoro.com/en/swallowing-difficulties-dysphagia/hiatus-hernia/", 
    "contents": "Common symptoms include acidic indigestion, reflux, heartburn, chronic cough, a \nfeeling of 'lump in the throat' or of a blockage in the chest or difficulties in ..."
  }, 
  {
    "id": "https://www.britishvoiceassociation.org.uk/voicecare_reflux-and-voice.htm", 
    "contents": "A sensation of food sticking or a feeling of a lump in the throat; A hoarse, tight or '\ncroaky' voice; Frequent throat clearing; Difficulty swallowing (especially tablets ..."
  }, 
  {
    "id": "http://abc11.com/entertainment/doctor-alerts-woman-on-hgtv-of-lump-on-her-throat/3564037/", 
    "contents": "Jun 4, 2018 - 48 sec... who appeared on HGTV finds out she has cancer after a doctor watching spots  a lump on her ..."
  }, 
  {
    "id": "https://www.spine-health.com/forum/discussion/75585/pain/neck-pain-cervical/lump-throat-after-cervical-fusion", 
    "contents": "It feels like I have a lump in my throat,swelling feeling, gets worse with bending ,\nreally any activity. When I lay down ,it almost feels like my ..."
  }, 
  {
    "id": "https://www.usatoday.com/story/news/nation-now/2018/06/06/doctor-watching-hgtv-spots-lump-womans-throat-thyroid-cancer/676339002/", 
    "contents": "Jun 6, 2018 ... A doctor reached out to followers on Facebook trying to contact a woman \nappearing on an HGTV show after he noticed a lump on her throat."
  }, 
  {
    "id": "https://community.mssociety.org.uk/forums/new-diagnosis-and-diagnosis/persistent-lump-throat", 
    "contents": "Hi,I went to my doctor today as I have a persistent lump in my throat that won't go \naway. I am also occasionally getting a horrible burning ..."
  }, 
  {
    "id": "http://www.nomorepanic.co.uk/showthread.php%3Ft%3D150416", 
    "contents": "Feb 27, 2014 ... Since then I've almost forgotten about the tongue thing but am fixated on the \nthroat lump. Some days it's not so bad but other days it's there."
  }, 
  {
    "id": "https://www.heartfoundation.org.nz/journeys/ive-got-to-be-doing-something", 
    "contents": "When antacids didn't make it easier for Graeme to swallow around the lump in his \nthroat, he was sent for a treadmill test to check for angina…"
  }, 
  {
    "id": "https://www.hey.nhs.uk/patient-leaflet/globus-sensation/", 
    "contents": "Globus sensation is a term used to describe the feeling of a lump in the throat \nwhere no true lump exists. It is extremely common and may be associated with ..."
  }, 
  {
    "id": "https://www.mumsnet.com/Talk/general_health/1744992-chest-pains-and-lump-in-throat-feeling-help-please", 
    "contents": "i never post on the health board but getting a bit desperate today . for the last 8 \nweeks i have had what feels like something stuck in my throat and."
  }, 
  {
    "id": "http://drdrew.com/2017/feel-lump-throat/", 
    "contents": "Sep 22, 2017 ... Globus pharyngeus or globus sensation is the feeling of having a lump in your \nthroat. Generally unrelated to an actual blockage, it is the ..."
  }, 
  {
    "id": "https://herhaleness.com/lump-in-throat-during-pregnancy", 
    "contents": "Throat swelling and pain is a common issue. But what does a lump in throat \nduring pregnancy mean? Get answers and more information about this concern ..."
  }, 
  {
    "id": "https://www.lnwh.nhs.uk/EasySiteWeb/GatewayLink.aspx%3FalId%3D2041", 
    "contents": "Globus is a feeling of a lump in the throat even when the doctors cannot see that \nthere is any obvious structural reason for the feeling. It is a very real feeling – it ..."
  }, 
  {
    "id": "https://www.qvh.nhs.uk/download/globus/", 
    "contents": "A persistent 'lump in the throat feeling' is sometimes described as 'globus'. This \nleaflet provides more information about globus, what causes it and what you can\n ..."
  }, 
  {
    "id": "https://www.doctorshealthpress.com/respiratory-articles/bumps-in-back-of-throat/", 
    "contents": "Oct 4, 2017 ... Bumps on the back of the throat are an indication of a certain type of ... But other \ntimes, there may be a red or white bump in the back of the ..."
  }, 
  {
    "id": "https://www.quora.com/Why-do-I-feeling-sensation-of-lump-in-throat-but-without-difficulty-eating-or-swallow", 
    "contents": "You may have suffered a severe emotional shock when very young. In traditional \nChinese medicine, your symptom is known as “plum pit throat” because it feels ..."
  }, 
  {
    "id": "https://www.thestudentroom.co.uk/showthread.php%3Ft%3D2574197", 
    "contents": "Feb 19, 2014 ... Since the beginning of December I have had this big lump in throat feeling that \nhas been obstructing food in my throat, sometimes I'll have to ..."
  }, 
  {
    "id": "https://www.throat-cancer.com/About-Throat-Cancer", 
    "contents": "Comprehensive overview of the different types of throat cancer, their signs, ... \nswallowing, hoarseness, and a sensation of or an actual lump in the throat."
  }, 
  {
    "id": "https://www.voicedoctor.net/forums/lump-throat", 
    "contents": "Lump in throat, history of throat clearing and \"quiet\" voice. By osianllwyd 5 years \n9 months ago. 1, By James P Thomas MD 5 years 9 months ago. Normal topic."
  }, 
  {
    "id": "https://www.zocdoc.com/answers/13360/pain-in-my-throat-and-a-small-movable-lump", 
    "contents": "Question. I have pain in the left side of my throat when I swallow (not all the time \nbut off and on) for the past few days and I felt a small moveable lump on the left ..."
  }, 
  {
    "id": "https://nypost.com/2018/06/05/doctor-likely-saved-womans-life-by-spotting-cancer-on-her-throat-on-tv/", 
    "contents": "Jun 5, 2018 ... An eagle-eyed New York doctor spotted a cancerous lump on a woman's throat \nas she appeared on a TV show — and may have saved her life ..."
  }, 
  {
    "id": "https://www.merriam-webster.com/dictionary/a%2520lump%2520in%2520one%27s%2520throat", 
    "contents": "A lump in one's throat definition is - a tight feeling in the throat that a person gets \nwhen about to start crying or when trying not to cry. How to use a lump in one's ..."
  }, 
  {
    "id": "http://www.entnet.org/content/head-and-neck-cancer", 
    "contents": "Of course, not all lumps are cancer. But a lump (or lumps) in the neck can be the \nfirst sign of cancer of the mouth, throat, voicebox (larynx), thyroid gland, or of ..."
  }, 
  {
    "id": "http://6abc.com/entertainment/doctor-alerts-woman-on-hgtv-of-lump-on-her-throat/3563209/", 
    "contents": "Jun 4, 2018 - 48 secA surgeon who noticed something wrong with a woman he saw on television  went on a mission ..."
  }, 
  {
    "id": "https://www.northernvalleyent.com/14-reasons-visit-us/lump-throat/", 
    "contents": "In many instances, the sensation of a lump in your throat is related to acid reflux, \nwhich is easily identified and treated. An exam is also important to identify and ..."
  }, 
  {
    "id": "https://www.express.co.uk/life-style/health/761631/sore-throat-earache-cancer-throat-symptoms-alcohol", 
    "contents": "Feb 1, 2017 ... A SORE THROAT and earache are just two of the symptoms which could ... The \nfirst symptom is usually a painless swelling or lump in the neck."
  }, 
  {
    "id": "http://www.anxietyguru.net/whats-causes-the-lump-in-your-throat/", 
    "contents": "Oct 20, 2008 ... Having a lump in your throat or the sensation that it's hard to swallow is a very \ncommon sensation among anxiety sufferers. This lump causes us ..."
  }, 
  {
    "id": "http://www.acidwatcher.com/index.php/blog/entry/i-have-a-lump-in-my-throat-globus-sensation", 
    "contents": "Nov 29, 2014 ... Lump-like sensation in the throat, or \"globus\" sensation is the feeling of a lump or \nmass in the throat. It may be due to infection, acid reflux ..."
  }, 
  {
    "id": "https://healthhearty.com/lump-in-throat-feeling", 
    "contents": "Jan 24, 2018 ... If you have consistently been bugged by the lump in throat feeling while \nswallowing, this article will throw some light on the problem, ..."
  }, 
  {
    "id": "https://www.doctorslounge.com/primary/forums/backup/topic-9827.html", 
    "contents": "I developed sore throat on the left hand side about 2 months ago after ... the \nswelling has gone down and there is no apparent lump anywhere."
  }, 
  {
    "id": "http://www.muschealth.org/ent/services/sinus-center/post-nasal-drip/index.html", 
    "contents": "Post-nasal drainage can often lead to cough, sore throat, frequent throat clearing, \nand the feeling of a lump in the throat. An excess in thin, clear secretions can ..."
  }, 
  {
    "id": "https://www.betterhealth.vic.gov.au/health/ConditionsAndTreatments/throat-cancer", 
    "contents": "Risk factors for throat cancer include smoking and heavy alcohol consumption. ... \na swelling or lump in the throat; a persistent cough; blood-flecked phlegm ..."
  }, 
  {
    "id": "https://www.sheknows.com/health-and-wellness/articles/1136865/lump-in-throat-when-sad", 
    "contents": "Nov 3, 2017 ... His question made me get a lump in my throat, of course, but it did make me \nwonder. What is this thing we always feel bubble up in our throat?"
  }, 
  {
    "id": "https://www.collinsdictionary.com/us/dictionary/english/a-lump-in-your-throat", 
    "contents": "If you say that you have a lump in your throat, you mean that you have a tight \nfeeling in your throat because of a strong emotion such as sorrow or gratitude."
  }, 
  {
    "id": "https://www.health.harvard.edu/cancer/neck-lump-is-common-sign-of-throat-cancer-due-to-hpv-virus", 
    "contents": "May 13, 2014 ... A study found that a lump in the neck was the most common early symptom of \nthroat cancer due to infection with the oral human papilloma ..."
  }, 
  {
    "id": "https://www.sharecare.com/health/ear-nose-throat-health/lump-throat-about-to-cry", 
    "contents": "That lump in the throat when crying is a common feeling. In this video, Dr. Oz \nexplains how this \"choked up\" feeling is related to the throat muscles."
  }, 
  {
    "id": "https://magicvalley.com/news/local/ask-st-luke-s-allergies-stomach-acid-can-cause-lump/article_29e5f0e0-bcfc-11e1-bdd2-001a4bcf887a.html", 
    "contents": "Jun 23, 2012 ... Over the past few weeks, every time I swallow, it feels like I have a lump in my \nthroat. It is really uncomfortable and seems to be worse at night."
  }, 
  {
    "id": "https://www.medicinenet.com/throat_cancer_symptoms_and_signs/symptoms.htm", 
    "contents": "Apr 16, 2018 ... Throat cancers may not cause any symptoms if they are very small and have not spread at the time of diagnosis.\n ... In advanced stages of throat cancer, symptoms like fatigue and unexplained weight loss may be present.\n ... Symptoms of cancer of the larynx, the organ at the front of the neck ..."
  }, 
  {
    "id": "https://www.thelindencentre.org/anxiety-conditions/globus-hystericus-that-annoying-lump-in-the-throat/", 
    "contents": "Do you have a lump in your throat? Globus Hystericus is probably the most \ntroubling of all symptoms of an anxiety condition. Most anxiety sufferers who ..."
  }, 
  {
    "id": "https://www.mayoclinic.org/diseases-conditions/throat-cancer/symptoms-causes/syc-20366462", 
    "contents": "Mar 13, 2018 ... Learn more about this type of cancer that affects your throat (pharynx), ... Ear pain\n; A lump or sore that doesn't heal; A sore throat; Weight loss ..."
  }, 
  {
    "id": "https://www.cancercenter.com/head-and-neck-cancer/symptoms/", 
    "contents": "For example, tumors in the larynx or pharynx may be discovered as a lump in the \nthroat. Cancer in the mouth may cause sores in the mouth or swelling of the jaw ..."
  }, 
  {
    "id": "https://healthcare.utah.edu/the-scope/shows.php%3Fshows%3D0_5q4djn58", 
    "contents": "Jul 15, 2015 ... Head and neck specialist Dr. Marcus Monroe discusses the basic signs and \nsymptoms of thyroid cancer. Learn if you are more at risk for having ..."
  }, 
  {
    "id": "https://www.healthcentral.com/article/globus-hystericus-anxiety-induced-lump-in-the-throat-sensation", 
    "contents": "One of our most commented upon member posts concerns a disorder called \nGlobus Hystericus. Member Adinmuh wrote about this mysterious condition in \n2007 ..."
  }, 
  {
    "id": "https://www.drbenke.com/lump-in-your-throat-you-could-have-acid-reflux/", 
    "contents": "Jul 21, 2008 ... If you feel a lump in your throat and you're not crying, you may be like Cleburne \nresident Jan Swanson. She had the annoying feeling of having ..."
  }
]