[
  {
    "id": "https://www.emedicinehealth.com/mad_cow_disease_and_variant_creutzfeldt-jakob/article_em.htm", 
    "contents": ""
  }, 
  {
    "id": "https://www.emedicinehealth.com/mad_cow_disease_and_variant_creutzfeldt-jakob/article_em.htm", 
    "contents": "The condition, when transmitted to humans, can cause variant Creutzfeldt-Jakob disease, or vCJD, a very rare and fatal brain disease in humans that has similar symptoms (for example, ataxia, jerky movements, seizures) to those seen in BSE. Humans also develop dementia, memory loss, and personality changes."
  }, 
  {
    "id": "https://www.webmd.com/brain/mad-cow-disease-basics", 
    "contents": "In the early stages of vCJD, people have symptoms related to the nervous system, like depression and loss of coordination. Later in the illness, dementia develops. But only in advanced stages of the disease can brain abnormalities be detected by MRI (magnetic resonance imaging)."
  }, 
  {
    "id": "https://www.medicinenet.com/mad_cow_disease/article.htm", 
    "contents": "Mad Cow Disease (Bovine Spongiform Encephalopathy or BSE)\n ... Mad cow disease (bovine spongiform encephalopathy or BSE) is a progressive neurological disorder.\n ... There is a relationship between mad cow disease and a human prion disease called variant Creutzfeldt-Jakob disease."
  }, 
  {
    "id": "https://familydoctor.org/condition/mad-cow-disease/", 
    "contents": "Mar 9, 2017 ... Both humans and animals can get mad cow disease. In humans, it's difficult to \ndiagnose until it's reached the most serious symptoms."
  }, 
  {
    "id": "https://www.mayoclinic.org/diseases-conditions/creutzfeldt-jakob-disease/symptoms-causes/syc-20371226", 
    "contents": "Sep 9, 2015 ... Creutzfeldt-Jakob (KROITS-felt YAH-kobe) disease is a degenerative brain disorder that leads to dementia and, ultimately, death. Symptoms of Creutzfeldt-Jakob disease (CJD) can resemble those of other dementia-like brain disorders, such as Alzheimer's. But Creutzfeldt-Jakob disease usually progresses much more rapidly."
  }, 
  {
    "id": "https://www.scientificamerican.com/article/new-test-spots-human-form-of-mad-cow-disease-with-100-percent-accuracy/", 
    "contents": "Dec 21, 2016 ... New Test Spots Human Form of Mad Cow Disease with 100 Percent Accuracy ... \nmay be able to diagnose infections before symptoms emerge."
  }, 
  {
    "id": "http://health.facty.com/en/ailments/body/10-symptoms-of-mad-cow-disease/", 
    "contents": "Nov 15, 2017 ... Mad cow disease is one of the most dangerous diseases out there. This disease \ndoesn't occur in humans. Instead, people can contract a ..."
  }, 
  {
    "id": "https://www.thedailybeast.com/10-facts-about-mad-cow-diseases", 
    "contents": "Apr 25, 2012 ... A case of mad cow disease was discovered yesterday in California, ... fatal in \ncows, and usually fatal in humans within 13 months of symptoms ..."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Creutzfeldt%25E2%2580%2593Jakob_disease", 
    "contents": "Creutzfeldt–Jakob disease (CJD) is a universally fatal brain disorder. Early \nsymptoms include ... CJD is different from bovine spongiform encephalopathy (\nmad cow disease) and variant Creutzfeldt–Jakob disease (vCJD). ... It is thought \nthat humans can contract the disease by consuming material from animals \ninfected with ..."
  }, 
  {
    "id": "https://www.telegraph.co.uk/science/2017/11/22/human-strain-mad-cow-disease-can-passed-via-skin/", 
    "contents": "Nov 22, 2017 ... The human strain of mad cow disease can be passed from ... Around 90 per cent \nof people die within one year of the onset of symptoms."
  }, 
  {
    "id": "https://www.healthline.com/health-news/blood-test-detects-human-form-of-mad-cow-disease-061214", 
    "contents": "Jun 12, 2014 ... BSE can affect many different species, from cows to humans to cats and ... but \nonce symptoms appear, it can be fatal within weeks for cattle."
  }, 
  {
    "id": "https://www.ninds.nih.gov/Disorders/Patient-Caregiver-Education/Fact-Sheets/Creutzfeldt-Jakob-Disease-Fact-Sheet", 
    "contents": "May 9, 2018 ... Typical onset of symptoms occurs at about age 60, and about 70 percent of ... \nCJD belongs to a family of human and animal diseases known as the ... These \ninclude BSE, mink encephalopathy, feline encephalopathy, and ..."
  }, 
  {
    "id": "https://www.healthychildren.org/English/health-issues/conditions/infections/Pages/Mad-Cow-Disease.aspx", 
    "contents": "Nov 21, 2015 ... When humans get the disease, it causes a variation of ... People with mad cow \ndisease can have very serious signs and symptoms, including ..."
  }, 
  {
    "id": "https://www.newscientist.com/article/2118418-many-more-people-could-still-die-from-mad-cow-disease-in-the-uk/", 
    "contents": "Jan 18, 2017 ... It's likely these people take longer to develop symptoms. ... Until now, vCJD – the \ndeadly disease caused by infection with BSE, ... The rate of cases diagnosed as \nordinary human CJD has doubled since the mid-1990s. Part of ..."
  }, 
  {
    "id": "https://www.curejoy.com/content/what-is-mad-cow-disease-in-humans/", 
    "contents": "However, once the symptoms start to appear, the disease usually runs about 13–\n14 ..."
  }, 
  {
    "id": "http://www.medical1stop.com/mad-cow-disease-symptoms-and-causes-in-humans/", 
    "contents": "Mad Cow Disease For Humans This Disease Is Known As Variant Creutzfeld-\nJacob Disease, Or vCJD. Learn About Mad Cow Disease Symptoms And Causes\n ..."
  }, 
  {
    "id": "https://www.newsmax.com/health/health-wire/madcowdisease-symptoms-humans-cattle/2014/04/07/id/563958/", 
    "contents": "Apr 7, 2014 ... Mad cow disease is a neurological disorder that affects cattle. This infectious \ndisease can affect other species and humans. Symptoms of this ..."
  }, 
  {
    "id": "https://www.medicalbag.com/profile-in-rare-diseases/mad-cow-disease/article/472906/", 
    "contents": "Jan 21, 2015 ... The human form of the disease is generally fatal, with death occurring within 13 \nmonths of the first symptoms. Mad Cow Disease Transmission."
  }, 
  {
    "id": "https://www.cnn.com/2013/07/02/health/mad-cow-disease-fast-facts/index.html", 
    "contents": "May 30, 2018 ... Read CNN's Fast Facts on Mad Cow Disease and learn more about the ... to a \nfatal brain disease in humans called variant Creutzfeldt-Jakob disease (vCJD). ... \nSymptoms of vCJD involve psychiatric symptoms and behavioral ..."
  }, 
  {
    "id": "https://www.verywellhealth.com/mad-cow-disease-in-humans-2860865", 
    "contents": "May 18, 2018 ... Read an overview of mad cow disease (variant Creutzfeldt-Jakob disease) in \nhumans including its symptoms, diagnosis, and treatment."
  }, 
  {
    "id": "https://www.theatlantic.com/health/archive/2011/10/treatments-for-mad-cow-other-prion-diseases-may-be-coming/246421/", 
    "contents": "Oct 11, 2011 ... BSE can be transmitted to humans -- over 200 people are known to have died \nfrom it, ... The incubation time (from infection to disease symptom ..."
  }, 
  {
    "id": "https://www.livescience.com/34717-creutzfeldt-jakob-disease.html", 
    "contents": "Oct 3, 2014 ... Other TSE diseases that affect humans are similar to CJD, but strike ... is bovine \nspongiform encephalopathy (BSE), or \"mad cow disease.\" ..."
  }, 
  {
    "id": "https://www.centerforfoodsafety.org/issues/1040/mad-cow-disease/mad-cow-disease-q-and-a", 
    "contents": "A. Mad cow disease, or bovine spongiform encephalopathy (BSE), belongs to a \n... This group includes scrapie in sheep and Creutzfeldt-Jakob Disease in \nhumans. ... A person with naturally occurring CJD usually starts having symptoms \nin ..."
  }, 
  {
    "id": "https://www.nhs.uk/conditions/creutzfeldt-jakob-disease-cjd/causes/", 
    "contents": "Find out what causes Creutzfeldt-Jakob disease (CJD). ... Strict controls have \nbeen in place since 1996 to prevent BSE entering the human food chain, and the \nuse of ... It appears not everyone who's exposed to BSE-infected meat will go on \nto ... the UK population may be infected with vCJD, but show no symptoms to date\n."
  }, 
  {
    "id": "https://www.nhs.uk/conditions/creutzfeldt-jakob-disease-cjd/", 
    "contents": "Read more about the symptoms of Creutzfeldt-Jakob disease and ... Since the \nlink between variant CJD and BSE was discovered in 1996, strict controls have ... \nCJD in the past was growth hormone treatment using human pituitary growth ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3DdCvcNUmj_DE", 
    "contents": "Apr 26, 2012 - 3 min - Uploaded by AntinnyWorldSerious and deadly Mad Cow disease symptoms seem strange... Links! http:// www.twitter.com ..."
  }, 
  {
    "id": "https://www.sciencealert.com/mad-cow-disease-is-still-out-there-but-we-might-finally-have-a-blood-test-for-it", 
    "contents": "Dec 23, 2016 ... 'Mad cow' disease, or bovine spongiform encephalopathy (BSE), is one of the ... \ncan detect the human variant of the disease, Creutzfeldt-Jakob disease (vCJD), ... \nWithin a year of symptoms arising, most patients will be dead."
  }, 
  {
    "id": "http://www.rense.com/general26/show.htm", 
    "contents": "NEW YORK (Reuters Health) - The human form of \"mad cow\" disease is hard to \ndiagnose early on, but UK researchers have put together a profile of symptoms ..."
  }, 
  {
    "id": "https://www.technologyreview.com/s/412699/finding-early-signs-of-mad-cow-disease/", 
    "contents": "Mar 24, 2009 ... The human form of BSE, a fatal degenerative neurological disorder called \nCreutzfeldt-Jakob disease, can be contracted by eating meat ..."
  }, 
  {
    "id": "https://kidshealth.org/en/parents/mad-cow-disease.html", 
    "contents": "Mad cow disease has been in the headlines - but what is it, and how likely is it ... \nit takes from the time a person contracts it to the time that symptoms appear), ..."
  }, 
  {
    "id": "https://www.thespruce.com/what-causes-mad-cow-disease-3384812", 
    "contents": "Apr 21, 2018 ... Mad Cow Disease (or BSE) is a well-known bovine disease. ... Symptoms may \ninclude staggering, general loss of motor control, ... However, there is a human \nversion called Creutzfeldt-Jacob Disease (CJD), but it's very rare."
  }, 
  {
    "id": "https://www.independent.co.uk/news/uk/home-news/mad-cow-disease-in-the-uk-what-is-bse-and-what-are-the-symptoms-a6675351.html", 
    "contents": "Oct 1, 2015 ... A dead cow has been found to carry “mad cow disease” in Wales, with ... is a \nneurodegenerative disease that can mutate and spread to humans. ... Mad cow \ndisease in the UK: What is BSE and what are the symptoms?"
  }, 
  {
    "id": "https://www.cbsnews.com/news/mad-cow-disease-basic-questions/", 
    "contents": "Feb 2, 2001 ... How do humans contract mad cow disease? ... New variant CJD begins with \npsychiatric symptoms such as anxiety and depression."
  }, 
  {
    "id": "http://www.medbroadcast.com/condition/getcondition/bovine-spongiform-encephalopathy", 
    "contents": "BSE is part of a group of diseases called prion diseases that occur in both \nanimals and humans. The main animal forms are chronic wasting disease in deer\n, ..."
  }, 
  {
    "id": "https://www.medicalnewstoday.com/articles/185884.php", 
    "contents": "Apr 26, 2017 ... The hallmark symptoms of CJD are a rapid progression to dementia and ... BSE \naffects a number of species, including cattle, humans, and cats."
  }, 
  {
    "id": "https://www.healthdirect.gov.au/mad-cow-disease", 
    "contents": "Mad cow disease is a severe neurological disease in cattle that causes ... The \nhuman form of mad cow disease is called variant Creutzfeldt–Jakob disease."
  }, 
  {
    "id": "https://www.quora.com/What-are-the-symptoms-of-mad-cow-disease", 
    "contents": "Mad Cow Disease or BSE is a neurological degeneration similar to Creuzfeldft-\nJakob Disease in humans and is caused by a defective form of a cellular prion ..."
  }, 
  {
    "id": "https://health.howstuffworks.com/wellness/preventive-care/how-to-prevent-viral-infections4.htm", 
    "contents": "Preventing Mad Cow Disease - Humans exposed to mad cow disease can ... \ndisease (vCJD), which usually results in death a year or so after symptoms are ..."
  }, 
  {
    "id": "https://www.news-medical.net/news/2007/02/01/21654.aspx", 
    "contents": "Feb 1, 2007 ... These diseases such as the human form of mad cow disease, variant Creutzfeldt-\nJakob disease, or vCJD, and the disease in cattle called ..."
  }, 
  {
    "id": "https://rightasrain.uwmedicine.org/well/prevention/what-chronic-wasting-disease-and-mad-cow-disease-can-teach-us-about-humans", 
    "contents": "Apr 16, 2018 ... The most well-known prion disease in humans is variant Creutzfeldt-Jakob \ndisease. ... bovine spongiform encephalopathy, a.k.a. mad cow disease, in the ... \nIf there is lead or mercury in the environment, pets often show signs ..."
  }, 
  {
    "id": "https://www.healthlinkbc.ca/health-topics/tu6533", 
    "contents": "However, in rare cases they can get a human form of mad cow disease called ... \nThe time it takes for symptoms to occur after you're exposed to the disease is not\n ..."
  }, 
  {
    "id": "https://www.cdc.gov/prions/vcjd/index.html", 
    "contents": "... of prion disease in cows, bovine spongiform encephalopathy (BSE or 'mad cow\n' disease), is the same agent responsible for the outbreak of vCJD in humans."
  }, 
  {
    "id": "https://www.alz.org/dementia/creutzfeldt-jakob-disease-cjd-symptoms.asp", 
    "contents": "Creutzfeldt-Jakob disease (CJD) is the most common human form of a group of \nrare, ... This prion disease is similar to mad cow disease that's been found in wild\n ..."
  }, 
  {
    "id": "http://www.drday.com/madcow.htm", 
    "contents": "In humans, it is called Creutzfeldt-Jakob Disease, after the two doctors who first \ndescribed the symptoms of the disease. The disease in cattle is called Bovine ..."
  }, 
  {
    "id": "https://www.cbc.ca/news/technology/quick-facts-about-mad-cow-disease-1.1134991", 
    "contents": "Jan 20, 2012 ... Here are some quick facts about BSE, and its human offshoot, variant ... There is \nno vaccine or treatment for BSE, according to the World ..."
  }, 
  {
    "id": "http://www.who.int/csr/resources/publications/bse/en/BSEthreat.pdf", 
    "contents": "the BSE agent and thus free from any risk of causing VCJD in humans. ... cattle \nexposed to the BSE agent show no symptoms and, until late in the period, have ..."
  }, 
  {
    "id": "https://www.fda.gov/animalveterinary/resourcesforyou/animalhealthliteracy/ucm136222.htm", 
    "contents": "Dec 22, 2017 ... It usually takes four to six years from the time a cow is infected with the abnormal \nprion to when it first shows symptoms of BSE. This is called the ..."
  }, 
  {
    "id": "https://news.nationalgeographic.com/news/2015/02/150215-mad-cow-disease-vcjd-blood-supply-health/", 
    "contents": "Feb 16, 2015 ... At first vCJD causes psychiatric symptoms such as depression and ... Any \nresurgence of the human version of mad cow disease is likely to be ..."
  }, 
  {
    "id": "https://www.myvmc.com/diseases/mad-cow-disease-creutzfeldt-jacob-disease-transmissible-spongiform-encephalopathy-new-variant-cjd/", 
    "contents": "Dec 29, 2003 ... Mad Cow Disease or Creutzfeldt-Jacob disease (CJD) is a disorder causing ... of \ncorneal transplantation, administration of human pituitary-derived hormones ... \nEarly symptoms are neuropsychiatric, followed by ataxia, and ..."
  }, 
  {
    "id": "https://www.theguardian.com/science/neurophilosophy/2013/sep/26/mad-cows-cannibalism-kuru", 
    "contents": "Sep 26, 2013 ... Kuru and other human forms of mad cow disease are extremely rare ... first \nsymptoms to manifest themselves in those infected with the disease ..."
  }, 
  {
    "id": "https://www.sciencedaily.com/releases/2005/02/050205123347.htm", 
    "contents": "Diffusion-weighted MRI Can Diagnose 'Mad Cow'-related Disease In Humans \nBefore Symptoms Show. Date: February 10, 2005; Source: American Roentgen ..."
  }, 
  {
    "id": "https://www.ajc.com/news/national/scientists-worry-brain-wasting-zombie-deer-disease-could-spread-humans/rjpiryXSOn92IxD9qVx1ZL/", 
    "contents": "Once the prions were passed to cows, the cows developed a prion disease of \ntheir own (mad cow disease). And when humans ate the beef from those sick \ncows ..."
  }, 
  {
    "id": "http://www.gracelinks.org/blog/6063/what-ever-happened-tomad-cow-disease", 
    "contents": "Sep 21, 2015 ... Bovine spongiform encephalopathy - aka \"mad cow disease\" - created a media ... \nan outbreak of both the bovine and the human form of the disease. ... in the UK \nstarted experiencing symptoms similar to scrapie, a disease ..."
  }, 
  {
    "id": "http://www.kimt.com/content/national/484054101.html", 
    "contents": "May 30, 2018 ... Here's a look at Mad Cow Disease, a fatal brain disease found in cattle. ... to a \nfatal brain disease in humans called variant Creutzfeldt-Jakob disease (vCJD). ... \nSymptoms of vCJD involve psychiatric symptoms and behavioral ..."
  }, 
  {
    "id": "http://animals.mom.me/signs-symptoms-mad-cow-9391.html", 
    "contents": "Mad cow disease spreads when humans or animals consume the tissue of an \ninfected cow. Mad cow disease can still spread even after infected tissue has ..."
  }, 
  {
    "id": "https://msdh.ms.gov/msdhsite/_static/14,0,194,136.html", 
    "contents": "Creutzfeldt-Jakob Disease (CJD) is the prototypical human TSE. ... Primary \nsymptoms of CJD are dementia, followed by rapid mental deterioration. ... \nHumans may develop vCJD after eating infected products from cattle with mad \ncow disease."
  }, 
  {
    "id": "https://www.uofmhealth.org/health-library/tu6533", 
    "contents": "But in rare cases they may get a human form of mad cow disease called ... The \ntime it takes for symptoms to occur after you're exposed to the disease is not ..."
  }, 
  {
    "id": "https://www.acvp.org/%3Fpage%3DMad_Cow_Disease", 
    "contents": "Clinical signs include changes in temperament such as nervousness or ... BSE is \nthe first TSE transferable from animal to humans by consuming food products ..."
  }, 
  {
    "id": "https://www.huffingtonpost.com/2012/04/24/mad-cow-disease-variant-creutzfeldt-jakob-disease_n_1450195.html", 
    "contents": "Apr 24, 2012 ... Mad cow disease is potentially dangerous for humans because it is ... though the \nsymptoms didn't manifest until years after the transfusion, ..."
  }, 
  {
    "id": "https://wagwalking.com/wellness/can-dogs-get-mad-cow-disease", 
    "contents": "Humans have, in recent years, also been affected by mad cow disease. It took \nyears ... Mad cow disease has symptoms that mimic other diseases. Since mad ..."
  }, 
  {
    "id": "https://articles.mercola.com/sites/articles/archive/2017/07/25/chronic-wasting-disease.aspx", 
    "contents": "Jul 25, 2017 ... CWD has long been said to not be transmittable to humans, ... The symptoms are \nsimilar to those of mad cow disease, scrapie (a similar ..."
  }, 
  {
    "id": "https://www.nbcnews.com/health/health-news/rare-brain-disease-caused-cousin-mad-cow-agent-study-finds-n419096", 
    "contents": "Aug 31, 2015 ... Rare Brain Disease Is Caused by Cousin of Mad Cow Agent, Study Finds ... The \ndiscovery adds to a very short list of human diseases linked to mutant ... “\nSymptoms tend to appear in a person's 50s and advance rapidly over ..."
  }, 
  {
    "id": "https://www.usda.gov/topics/animals/bse-surveillance-information-center/bse-frequently-asked-questions", 
    "contents": "Q. What are signs of BSE in cattle? ... risk materials (SRMs) – those tissues that \nmay contain the BSE agent in an infected animal – from the human food chain."
  }, 
  {
    "id": "http://www.cfsph.iastate.edu/FastFacts/pdfs/bse_F.pdf", 
    "contents": "called BSE or “mad cow disease,” is a disease that affects the brain of cattle and \nhumans. Most scientists ... Signs such as trembling, stumbling, swaying and ..."
  }, 
  {
    "id": "http://www.foodsafetynews.com/2014/01/germany-finds-first-mad-cow-case-since-2009/", 
    "contents": "Jan 21, 2014 ... Health officials said that the animal showed no symptoms of BSE when ... \nHumans can contract vCJD from eating meat contaminated with brain ..."
  }, 
  {
    "id": "http://www.health.nsw.gov.au/Infectious/factsheets/Pages/creutzfeldt-jakob-disease.aspx", 
    "contents": "Creutzfeldt-Jakob disease is a rare brain disease that is caused by abnormal \nbrain ... use of dura mater grafts or contaminated human pituitary hormones (\niatrogenic CJD). ... with bovine spongiform encephalopathy (BSE, or \"mad cow \ndisease\"). ... People with classical CJD have progressive neurological symptoms \nthat may ..."
  }, 
  {
    "id": "https://www.peta.org/living/food/mad-cow-disease/", 
    "contents": "Jun 23, 2010 ... Mad cow disease is one of the most frightening diseases of our generation. ... \nwith prion disease and could pass the disease on to humans who eat the ... but \ndo not know it yet, and it can take years for symptoms to develop."
  }, 
  {
    "id": "https://www.nytimes.com/2000/08/31/style/mad-cow-disease-in-pigs-and-sheep.html", 
    "contents": "Aug 31, 2000 ... An example of this is the transmission of BSE to humans, where it ... that \napparently healthy cattle could harbor, but never show signs of, BSE.\"."
  }, 
  {
    "id": "https://www.sciencedirect.com/topics/agricultural-and-biological-sciences/bovine-spongiform-encephalopathy", 
    "contents": "Bovine spongiform encephalopathy (BSE), or mad cow disease, is a ... in humans\n, and resulting in death approximately one year after symptoms commence."
  }, 
  {
    "id": "https://myhealth.alberta.ca/Health/pages/conditions.aspx%3Fhwid%3Dtu6533", 
    "contents": "But in rare cases they may get a human form of mad cow disease called ... The \ntime it takes for symptoms to occur after you're exposed to the disease is not ..."
  }, 
  {
    "id": "https://www.health.qld.gov.au/news-alerts/news/mad-cow-disease-why-cant-donate-blood-breast-milk-tissue-UK-Britain", 
    "contents": "Apr 4, 2018 ... Below we've explained what 'mad cow' disease is and why those who might ... In \nhumans, the symptoms of vCJD are similar to BSE in cows."
  }, 
  {
    "id": "https://weather.com/health/news/thousands-carry-human-form-mad-cow-disease-20131016", 
    "contents": "Oct 16, 2013 ... Thousands Carry Human Form of Mad Cow Disease ... the human body – \nshowing no obvious symptoms – for up to 50 years, researchers from ..."
  }, 
  {
    "id": "http://www.tribuneindia.com/news/comment/mad-cow-denial-no-way-to-treat-disease/65047.html", 
    "contents": "Apr 10, 2015 ... The mad cow disease is easily transmitted to humans who eat infected meat. ... \nThe symptoms started with him being tired and depressed, short ..."
  }, 
  {
    "id": "https://www.merckmanuals.com/home/brain,-spinal-cord,-and-nerve-disorders/prion-diseases/creutzfeldt-jakob-disease-cjd", 
    "contents": "Creutzfeldt-Jakob Disease (CJD) - Learn about the causes, symptoms, ... The \nhuman form of mad cow disease (variant Creutzfeldt-Jakob disease), which is ..."
  }, 
  {
    "id": "https://abcnews.go.com/Health/story%3Fid%3D117962%26page%3D1", 
    "contents": "Sheep in the early, symptom-free stages of mad cow disease can pass the ... No \ncases have been recorded of humans becoming infected from a blood ..."
  }, 
  {
    "id": "http://www.dhss.delaware.gov/dph/files/cjdmadcowfaq.pdf", 
    "contents": "What is Mad Cow Disease (Bovine Spongiform Encephalopathy or BSE)?. Mad \nCow ... never be sold for human consumption. ... What are the symptoms of CJD?"
  }, 
  {
    "id": "http://www.beyondfactoryfarming.org/get-informed/health/mad-cow-disease-bse", 
    "contents": "Creutzfeld-Jacob Disease (or vCJD) is the human variant of Mad Cow and can \ngo undetected for many years. Symptoms are similar to dementia, and eventually\n ..."
  }, 
  {
    "id": "https://www.infoplease.com/science/health-and-body/rare-and-deadly-diseases-cjd-mad-cows-human-counterpart", 
    "contents": "Rare and Deadly Diseases: CJD: Mad Cow's Human Counterpart. CJD: Mad \nCow's ... There is no treatment, and the disease is always fatal. There are three ..."
  }, 
  {
    "id": "https://ecdc.europa.eu/en/vcjd/facts", 
    "contents": "Jun 26, 2017 ... No vaccine or treatment is available. ... Bovine Spongiform Encephalopathy (BSE\n), variant CJD and transmissible spongiform ... the BSE epizootic in cows is also \nresponsible for the vCJD cases in humans [3] and is different ..."
  }, 
  {
    "id": "https://www.express.co.uk/news/world/948901/mad-cow-disease-camels-human-food-chain-algeria", 
    "contents": "Apr 20, 2018 ... Special Forces war hero dies of mad cow disease ... The NHS say that average \ntime it takes for the symptoms of variant CJD to occur after initial ..."
  }, 
  {
    "id": "https://healthhearty.com/mad-cow-disease-symptoms", 
    "contents": "Symptoms in Humans Studies and lab data have shown a striking relation \nbetween BSE and variant Creutzfeldt-Jakob disease (vCJD) in humans. Variant \nCJD ..."
  }, 
  {
    "id": "https://arstechnica.com/science/2017/07/rare-form-of-prion-disease-pops-up-in-an-alabama-cow/", 
    "contents": "Jul 19, 2017 ... USDA stresses that it does not pose a threat to humans or our food. ... The cow \ntested positive for the strain, called L-type BSE, during routine ... at a livestock \nmarket where the animal had started exhibiting clinical signs."
  }, 
  {
    "id": "https://www.kalcounty.com/php/madcow.htm", 
    "contents": "Mad Cow Disease, or bovine spongiform encephalopathy (BSE) is a brain \ndisease of cattle ... Variant CJD is a TSE disease in humans linked to eating meat \nproducts from cattle ... What are the symptoms of Creutzfeldt-Jakob Disease (CJD\n)?."
  }, 
  {
    "id": "https://www.hopkinsmedicine.org/healthlibrary/conditions/nervous_system_disorders/prion_diseases_134,56", 
    "contents": "Prion diseases can affect both humans and animals and are sometimes spread \nto ... Symptoms of CJD (see below) quickly lead to severe disability and death. ... \nThis is an infectious type of the disease that is related to “mad cow disease."
  }, 
  {
    "id": "https://www.noted.co.nz/health/nutrition/mycoplasma-bovis-why-humans-dont-need-to-fear-cattle-disease/", 
    "contents": "May 14, 2018 ... Don't the experts remember mad cow disease? ... for animals not showing clinical \nsigns of infection to be processed for human consumption, ..."
  }, 
  {
    "id": "http://www.healthcare-online.org/Mad-Cow-Disease-Symptoms-in-Humans.html", 
    "contents": "Mad cow disease symptoms include muscle spasm, anxiety, depression, poor \nmemory, etc. Why is mad cow disease serious? And how to treat and prevent it?"
  }, 
  {
    "id": "https://www.wikihow.com/Avoid-Mad-Cow-Disease", 
    "contents": "Look for symptoms of Creutzfeldt-Jakob Disease. Consult your doctor if you ..."
  }, 
  {
    "id": "https://www.curesdecoded.com/conditions/bovine-spongiform-encephalopathy-mad-cow/35", 
    "contents": "Mad cow disease in humans (vCJD) is a degenerative disease, meaning it \ngradually worsens over time. Mad cow disease symptoms in humans include:2."
  }, 
  {
    "id": "http://healthtools.chealth.canoe.com/condition_info_details.asp%3Fdisease_id%3D24", 
    "contents": "BSE is part of a group of diseases called prion diseases that occur in both \nanimals and humans. The main animal forms are chronic wasting disease in deer\n, ..."
  }, 
  {
    "id": "https://www.sharecare.com/health/brain-nervous-system/what-is-mad-cow-disease-humans", 
    "contents": "Other types of CJD, not related to mad cow disease, can also occur in humans. \nSymptoms of CJD in people include dementia (memory loss, confusion, mood ..."
  }, 
  {
    "id": "https://www.organicconsumers.org/news/mad-cow-disease-could-be-dormant-people", 
    "contents": "Jun 22, 2006 ... LONDON - People could be infected with the human form of mad cow disease for \nmore than 50 years without developing the illness, which ..."
  }, 
  {
    "id": "https://www.mpi.govt.nz/protection-and-response/readiness/transmissible-spongiform-encephalopathies-tses/bovine-spongiform-encephalopathy-bse/", 
    "contents": "Apr 19, 2017 ... BSE causes mania-symptoms in cows – trouble controlling legs, ... in humans as \na disease called variant Creutzfeldt-Jakob Disease (vCJD)."
  }, 
  {
    "id": "http://ashlandscience.shoutwiki.com/wiki/Bovine_Spongiform_Encephalopathy_(Mad_Cow_Disease)", 
    "contents": "A human infected with BSE, or Creutzfeldt-Jakob Disease, would exhibit ..."
  }, 
  {
    "id": "https://www.walesonline.co.uk/business/farming/what-mad-cow-disease-what-10175129", 
    "contents": "Oct 1, 2015 ... BSE is a neurological disease which is also known as mad cow disease. Here \nwe outline how it affects cattle, humans and what happens if it is ..."
  }, 
  {
    "id": "https://www.treehugger.com/health/what-exactly-is-mad-cow-disease-and-are-you-at-risk-of-getting-it.html", 
    "contents": "Apr 28, 2012 ... Bovine Spongiform Encephalopathy, often called mad cow disease, ... Human \nsymptoms are first characterized by depression, anxiety, and ..."
  }, 
  {
    "id": "https://www.npr.org/sections/goatsandsoda/2015/04/16/399933240/mad-cow-disease-in-texas-man-has-mysterious-origin", 
    "contents": "Apr 16, 2015 ... Colored brain scan of a 17-year-old boy with mad cow disease. ... And about 18 \nmonths after symptoms began, the man died. ... suspected: the human version of \nmad cow disease, called variant Creutzfeldt-Jakob disease.*."
  }, 
  {
    "id": "https://www.petmd.com/blogs/thedailyvet/aobrien/2012/may/discourse_on_mad_cow_disease-20538", 
    "contents": "May 18, 2012 ... ... about how this happen and about mad cow disease and its symptoms. ... of this \nanimal with mad cow disease entered the human food chain."
  }, 
  {
    "id": "https://patient.info/doctor/creutzfeldt-jakob-disease", 
    "contents": "Creutzfeldt-Jakob disease (CJD) is the best known of the human prion diseases. \n... incubation periods and progress inexorably once clinical symptoms appear. ... \nnvCJD: is linked with BSE discovered in cattle in 1986 and is believed to be ..."
  }, 
  {
    "id": "https://animalsake.com/mad-cow-disease-facts", 
    "contents": "Apr 22, 2018 ... The mad cow disease spreads in humans due to the use of contaminated meat \nand ... All these symptoms may affect an individual's normal life."
  }
]