[
  {
    "id": "https://en.wikipedia.org/wiki/Rules_of_golf", 
    "contents": ""
  }, 
  {
    "id": "http://www.usga.org/rules-hub.html", 
    "contents": "This interactive timeline provides an overview of the history of the Rules of Golf \nfrom the first code in 1744 to the first joint USGA/R&A code in 1952 and all the ..."
  }, 
  {
    "id": "https://www.usga.org/content/dam/usga/pdf/2015/2016%2520Rules/2016-rulesofgolf-USGAfinal.pdf", 
    "contents": "Foreword 6. Principal Changes 13. How to Use the Rule Book 16. A Quick Guide \nto the Rules of Golf 18. Section. I Etiquette 26. II Definitions 30. III The Rules of ..."
  }, 
  {
    "id": "https://www.randa.org/RulesEquipment/Rules/QuickGuide/Start", 
    "contents": "When playing golf, you must play the ball as it lies, whether your ball is in a good lie or a bad lie, unless the Rules allow you to do otherwise. ... At other times, you may incur a penalty if you wish to move your ball, e.g. when your ball is in a water hazard."
  }, 
  {
    "id": "https://www.golfdigest.com/story/18-golf-rules-you-definitely-need-to-know-when-playing-in-a-tournament", 
    "contents": "May 26, 2016 ... If you're playing in a tournament, here are 17 golf rules you should familiarize \nyourself with before you tee off."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Rules_of_golf", 
    "contents": "Play the ball or a substitute ball from the same spot as the previous stroke as per Rule 27-1. Lift and drop the ball or a substitute ball behind the spot of the previous lie and in line with the hole. If the ball is in a bunker, the ball must remain in the hazard."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Rules_of_golf", 
    "contents": "During Saturday's coverage of the Travelers Championship, cameras caught \nBryson DeChambeau employing a compass during his walk ..."
  }, 
  {
    "id": "https://itunes.apple.com/us/app/the-rules-of-golf/id347349889%3Fmt%3D8", 
    "contents": "The United States Golf Association's official application for the Rules of Golf. This \nfree app includes the edition of the \"Rules of Golf” effective January 1, 2016 ..."
  }, 
  {
    "id": "http://www.igfgolf.org/about-golf/the-rules-of-golf/", 
    "contents": "An International Golf Federation (IGF) listing of the original 13 Rules of Golf, plus \nthe variations and the three basic premises governing the Rules of Golf.decisions\n,"
  }, 
  {
    "id": "http://www.scottishgolfhistory.org/origin-of-golf-terms/rules-of-golf/", 
    "contents": "The first known Rules of Golf were drawn up in 1744 in Edinburgh for the world's \nfirst 'open' golf competition at Leith by the Gentlemen Golfers of Edinburgh, who ..."
  }, 
  {
    "id": "http://www.playgolfamerica.com/graphics/info_devo/rules_of_golf.pdf", 
    "contents": "of Golf. Rule 1. The Game. 9. 8. 9. A. Golf is playing a ball from the teeing ground \ninto the hole by a stroke or strokes. B. You must always play by the Rules."
  }, 
  {
    "id": "https://www.pga.com/news/golf-buzz/usga-ra-announce-new-set-of-modern-rules-golf", 
    "contents": "Mar 12, 2018 ... Golf now has a modern set of rules for the Royal & Ancient game, an extensive \noverhaul that took six years and is aimed at making the rules ..."
  }, 
  {
    "id": "https://www.pga.com/news/golf-buzz/9-times-rules-of-golf-were-broken-sometimes-in-bizarre-fashion", 
    "contents": "Jun 19, 2018 ... Here's 9 times players ran afoul of the rules of golf, including a disastrous 26-shot \npenalty handed down to Ryuji Imada."
  }, 
  {
    "id": "http://www.barryrhodes.com/", 
    "contents": "A regular blog for information on the Rules of Golf. ... It seems that many golfers \nimagined that the modernisation of the Rules of Golf would result in there being ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3DIcaFTHeVQ7w", 
    "contents": "Jul 22, 2017 - 5 min - Uploaded by Ninh LyNinh explains - The Rules of Golf. Learn how to play golf in this short 5 minute  video. Specific ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3DEWONU9LovFY", 
    "contents": "Mar 5, 2018 - 8 min - Uploaded by Golf MonthlyJeremy Ellwood explains the five Rules of Golf you need to know, including those  around a ..."
  }, 
  {
    "id": "http://www.golf.com/tour-news/2018/06/25/bryson-dechambeau-breaking-rules-golf-his-compass", 
    "contents": "20 hours ago ... But Thomas Pagel, the USGA's senior director for the Rules of Golf and Amateur \nStatus, did direct us to Rule 14-3, which states that a player ..."
  }, 
  {
    "id": "https://www.pgadigitalgolfacademy.com/videos/rules-of-golf/", 
    "contents": "The rules of golf can be extensive, especially to those that play the sport for \nleisure. Whether it's ball placement, cleaning, or rules on the green, our \ninstructional ..."
  }, 
  {
    "id": "http://www.golfeurope.com/almanac/golf_rules.htm", 
    "contents": "summary of the rules of golf as dictated by the United States Golf Association (\nUSGA) and Royal and Ancient (R&A) on Europe's No.1 golf site."
  }, 
  {
    "id": "http://tdgagolf.org/Rules/Rules%2520of%2520Golf%2520for%25202019.pdf", 
    "contents": "All Rights Reserved. New Rules of Golf for 2019. The Full Text of Rules 1-24. \nR&A Rules Limited and the United States Golf Association. Published March \n2018."
  }, 
  {
    "id": "https://www.golfchannel.com/news/collection/proposed-rules-golf/", 
    "contents": "USGA videos explaining the proposed changes to the Rules of Golf."
  }, 
  {
    "id": "https://www.amazon.com/USGA-Golf-Rules-Illustrated-2016/dp/0600632075", 
    "contents": "USGA Golf Rules Illustrated 2016: The Official Illustrated Guide to the Rules of Golf Paperback – February 9, 2016.\n ... This book contains all the Rules of the game as revised 1st January, 2016, together with over 100 illustrations designed to provide easier understanding of those ..."
  }, 
  {
    "id": "http://www.dummies.com/sports/golf/golf-rules-etiquette-for-dummies-cheat-sheet/", 
    "contents": "From Golf Rules and Etiquette For Dummies. By John Steinbreder. Before you hit \nthe course to play a round of golf, for fun or for business, or to attend a golf ..."
  }, 
  {
    "id": "http://www.fsga.org/sections/Volunteer/Rules-of-Golf-Incident-Blog/487", 
    "contents": "The USGA and R&A shook the Golf World as they announced the proposed Rule \nchanges in their effort to modernize the Rules of Golf. The proposed changes ..."
  }, 
  {
    "id": "http://www.ruleshistory.com/", 
    "contents": "The historical Rules of Golf since the formation of the first Rules of Golf \nCommittee by the R&A in 1897, and a selection of older codes as used by \nprominent golf ..."
  }, 
  {
    "id": "http://www.txga.org/USGA-rules-and-amateur-status.html", 
    "contents": "The year 2012 marked the start of a new version of the Rules of Golf that is \neffective worldwide through 2015. The four-year revision cycle ensures any \nchanges ..."
  }, 
  {
    "id": "https://www.quora.com/What-are-the-summer-rules-in-golf", 
    "contents": "Are you assuming that since you've heard the term “Winter Rules” that there must \nbe a set of ... There are no summer rules. You just play by the rules of golf."
  }, 
  {
    "id": "http://www.sdhsaa.com/athletics/boyssports/golf/18mostmisunderstoodrulesofgolf.aspx", 
    "contents": "18 Most Misunderstood Rules of Golf. Boys Golf. Red Lateral Hazard Option 1 - \nPlay it from the hazard. Option 2 - Replay the shot from the original position, ..."
  }, 
  {
    "id": "https://aimermedia.com/app/decisions-on-the-rules-of-golf-2016-2017/", 
    "contents": "The current Decisions on the Rules of Golf will continue to be valid through to the \nend of 2018. The Decisions on the Rules of Golf is the official interpretation of ..."
  }, 
  {
    "id": "https://thewsga.org/championships-home/winter-series/rules-corner/", 
    "contents": "A working group led by the USGA and R&A has unanimously agreed to adopt a \nnew set of protocols for video review when applying the Rules of Golf."
  }, 
  {
    "id": "http://www.ncaa.org/playing-rules/golf-rules-game", 
    "contents": "United State Golf Association Golf House P.O. Box 708 Far Hills, NJ 07931-0708 \nPhone: 908/234-2300http://www.usga.org/"
  }, 
  {
    "id": "https://uga.org/rules/rules-of-golf-workshops/", 
    "contents": "During the winter of 2016-17 the UGA will offer a Rules of Golf workshops; these \nclasses will cover all 34 rules of golf and is designed for the novice and expert ..."
  }, 
  {
    "id": "https://blog.nextgengolf.org/golf-industry/change-to-rules-of-golf-for-2017", 
    "contents": "The USGA and R&A made a change to the rules of golf that will have an impact \non your local tournaments, and stems from a decision made at the 2016 U.S. ..."
  }, 
  {
    "id": "https://www.rules.golf/", 
    "contents": "A Fundamental Revision to the Rules of Golf for 2019."
  }, 
  {
    "id": "https://www.linksmagazine.com/rules-of-golf-are-changing/", 
    "contents": "The USGA and R&A have proposed broad-ranging changes to the Rules of Golf. \nHere is George Pepper's reaction to the proposed Rules changes."
  }, 
  {
    "id": "http://www.coloradogolf.org/index.php%3Fmod%3DSeminars", 
    "contents": "The CGA provides Rules of Golf Seminars at no charge to the CGA member club. \nRules of Golf Seminars are great for clubs in the springtime as the golf season ..."
  }, 
  {
    "id": "https://golfweek.com/2018/03/12/new-rules-of-golf-unveiled-set-for-2019-debut/", 
    "contents": "Mar 12, 2018 ... Beginning in 2012, the U.S. Golf Association and R&A started a process to \nmodernize the Rules of the Golf and make the rules easier to ..."
  }, 
  {
    "id": "https://www.usgapublications.com/products/rules-of-golf-2016-edition", 
    "contents": "*ORDERS ARE LIMITED TO A MAXIMUM OF TWO BOOKS PER ORDER. \nMaintaining the Rules of Golf is one of the most important functions of the USGA."
  }, 
  {
    "id": "https://www.cbssports.com/golf/news/usga-r-a-unveil-new-set-of-2019-golf-rules-could-be-biggest-changes-in-centuries/", 
    "contents": "Mar 13, 2018 ... The USGA and R&A have collaborated to shrink the official golf rule book from 34 \nrules to 24, while also applying some common sense to rules ..."
  }, 
  {
    "id": "https://www.mgagolf.org/rules", 
    "contents": "Rules. The Metropolitan Golf Association promotes playing the game of golf by \nthe Rules ... The annual MGA Rules of Golf Quiz will test your Rules knowledge."
  }, 
  {
    "id": "http://www.ghin.com/eclubhouse/uploadedimages/News/575_9895_A%2520Quick%2520Guide%2520to%2520the%2520Rules%2520of%2520Golf.pdf", 
    "contents": "This guide is not a substitute for the Rules of Golf, which should be ... put an \nidentification mark on your ball; many golfers play the same brand of ball and if \nyou."
  }, 
  {
    "id": "https://www.about-golf.org/rules-of-golf-take-advantage-of-free-relief/", 
    "contents": "There are actually quite a few instances in golf where you are entitled to relief \nwithout penalty. Generally, this ... Rules of Golf – Take Advantage of Free Relief."
  }, 
  {
    "id": "http://golfnb.ca/rules-of-golf/", 
    "contents": "As the governing body of golf in Canada, Golf Canada holds the exclusive right to \npublish and distribute the Rules of Golf in Canada. The Rules are updated ..."
  }, 
  {
    "id": "http://www.myewga.com/Go.aspx%3FNavigationKey%3D459cf18b-780d-423a-950e-2ea3af65c7f8", 
    "contents": "Mulligan: Belief: When you make a shot that is really, really bad, the Rules of Golf \nallow you an occasional “do-over” called a Mulligan. Reality: The Rules Of Golf ..."
  }, 
  {
    "id": "https://www.thoughtco.com/golf-rules-at-a-glance-1565969", 
    "contents": "Here is an introduction to the Rules of Golf that can give beginners in the game a \nquick glance and the key elements, in easy-to-understand points."
  }, 
  {
    "id": "https://www.northgeorgiajuniorgolf.com/academy/rules-of-golf/", 
    "contents": "Hazard Options & Rules. RED HAZARD STAKES & LINES. A red stake or line \ndefines a lateral water hazard. The entire stake or line is considered to be in the ..."
  }, 
  {
    "id": "https://www.gottagogolf.com/blog/susanfornoff/5-stupidest-rules-in-golf", 
    "contents": "Here are five stupid golf rules GottaGoGolf thinks need to be changed \nimmediately so that more women fall in love with the game."
  }, 
  {
    "id": "https://www.multivu.com/players/English/8011851-usga-randa-proposed-changes-to-golf-rules/", 
    "contents": "The USGA and The R&A have unveiled a preview of proposed new Rules of Golf, \nas part of a joint initiative to modernize the Rules."
  }, 
  {
    "id": "https://www.honeybrookgolf.com/members/rules-of-golf-handicap-maintenance", 
    "contents": "Many are not aware that the Rules of Golf provide a way to determine your \"most \nlikely score\" on holes that are conceded or picked up. See Section 4-1 below."
  }, 
  {
    "id": "https://oga.org/rules/rules-workshops", 
    "contents": "The OGA's Rules Workshops are designed for individuals who are familiar with \nthe game and wish to acquire a better understanding of the Rules of Golf."
  }, 
  {
    "id": "https://www.nytimes.com/2018/03/13/sports/golf/original-rules-1744.html", 
    "contents": "Mar 13, 2018 ... The new rules of golf were announced Monday, but a look at the 1744 rule book \nsheds light on a different kind of game."
  }, 
  {
    "id": "https://www.rhodesrulesschool.com/videos/", 
    "contents": "Describing the options for taking relief from Water Hazards (yellow stakes) under Rule 26-1.\n ... Rules of Golf - Barry Rhodes explains the three options available under Rule 28 - Ball Unplayable.\n Relief from Lateral Water Hazards."
  }, 
  {
    "id": "http://www.thousandhills.com/out-of-bounds-golf-rule/", 
    "contents": "The out of bounds golf rule, in my opinion, is one of the harshest rules in golf. It is \nalso one of the most common golf rules that are violated. The rules for both Lost ..."
  }, 
  {
    "id": "http://www.ewgadayton.com/communityresources/education/rulesofgolf", 
    "contents": "The R&A and the United States Golf Association announced new Rules for Golf \nthis week. After a four year study, nine rules have been amended. For details"
  }, 
  {
    "id": "http://pinchasergolf.com/19th-hole/understanding-the-rules-of-golf/lost-ball/", 
    "contents": "Once the ball is declared lost is where most golfers tend to make a mistake. \nEither out of a lack of understanding for the Rules of Golf, or to help speed up \nplay, ..."
  }, 
  {
    "id": "http://golfcanada.ca/rules-of-golf/", 
    "contents": "As the governing body of golf in Canada, Golf Canada holds the exclusive right to \npublish and distribute the Rules of Golf in Canada. The Rules are updated ..."
  }, 
  {
    "id": "https://www.carolinasgolf.org/images/CarolinasGolf/site/rules/CommitteeandLocalRules.pdf", 
    "contents": "a. The Rules of Golf and their interpretations as contained in “Decisions on the \nRules of Golf” b. Any Condition of Competition established by the Committee ..."
  }, 
  {
    "id": "https://golfsidekick.com/knowledge/basic-rules-of-golf/", 
    "contents": "Golfers love rules and some guys can be real sticklers for them. By that, I mean \nthey have arguments and carry a pocket rule book to prove they're right over ..."
  }, 
  {
    "id": "http://www.ewgarochesterny.com/learn1/rulesofgolf", 
    "contents": "While there is a whole book of rules pertaining to the game of golf, some of the \nmost important new ones are contained here. If you'd like a copy of the USGA ..."
  }, 
  {
    "id": "https://monkstowngolfclub.com/2016/02/what-do-we-mean-when-we-say-winter-rules/", 
    "contents": "When 'Winter Rules' are in play players tend to be a little 'casual' about what that \nactually means. For the avoidance of any doubt we have noted a few rules of ..."
  }, 
  {
    "id": "https://www.uiltexas.org/golf/rules-guidelines", 
    "contents": "Golf Rules & Guidelines. 2017-18 Sport Season Dates and Game/Tournament \nLimits - Effective August 1, 2017; Regional & State Golf Practice Round Details ..."
  }, 
  {
    "id": "https://www.healdsburggolfclub.com/10-important-unwritten-rules-golf-2/", 
    "contents": "Personally, “unwritten rule” is a paradox on unwritten rules par with “soft rock” or “\nfun run.” But it got the wheels turning: what are some of golf's implied customs?"
  }, 
  {
    "id": "http://news.bbc.co.uk/sport2/hi/golf/rules_and_equipment/4230206.stm", 
    "contents": "Par is the number of shots (or strokes) a top-class golfer is expected to take to \nplay each hole based on its length and difficulty. It also refers to an expected total\n ..."
  }, 
  {
    "id": "https://www.discgolf.com/disc-golf-rules-for-recreational-play/", 
    "contents": "The following are the disc golf rules for recreational play. The rules are simple \nand are easy to learn and are meant to give the basic framework for playing the ..."
  }, 
  {
    "id": "https://www.pagat.com/draw/golf.html", 
    "contents": "May 31, 2018 ... Rules and variants of the multi-player card game Golf in which each player has a \nrectangular layout of cards and tries to reduce its score to as ..."
  }, 
  {
    "id": "https://www.myscorecard.com/cgi-bin/knowledgecenter.pl%3Fmode%3Darticle%26category%3Drules_of_golf%26file%3Dtee%26article%3DThe-Tee", 
    "contents": "Become a rules expert with these easy-to-read articles that simplify and explain \nthe most important aspects of the rules of golf."
  }, 
  {
    "id": "https://mikefaygolf.com/caddies-responsibility-rules-golf/", 
    "contents": "In this post we discuss what a caddie's responsibility is under the rules of golf. \nRule 6, The Player, is one of the Rules that deals with a players responsibilities ..."
  }, 
  {
    "id": "https://www.bicyclecards.com/how-to-play/six-card-golf/", 
    "contents": "Learn to earn the lowest number of points to win in this six-card game."
  }, 
  {
    "id": "https://www.kystandard.com/content/tee-time-how-well-do-you-know-rules-golf", 
    "contents": "26 minutes ago ... The rules of golf can often work to a golfer's advantage. Jordan Spieth used them \nto get an advantageous but legal drop after that horrendous ..."
  }, 
  {
    "id": "https://eastmangolflinks.com/event/rog-rules-golf-pop-pace-play-workshop/", 
    "contents": "This workshop is free of charge. Any EGL member, ECA property owner and \nguest is welcome. Mark Larrabee and the golf staff will present a fun, interactive \nand ..."
  }, 
  {
    "id": "http://www.qsog.com/lpga-news/breaking-rules-golf/", 
    "contents": "Breaking the Rules in Golf By Mistake During Competition. Within two weeks, we \nhave seen two rules violations, one on the PGA tour and one on the LPGA tour."
  }, 
  {
    "id": "https://play.google.com/store/apps/details%3Fid%3Dair.uk.lightmaker.theanda.rules%26hl%3Den_US", 
    "contents": "From on-course behaviour, through a summary of the fundamental Rules, to the \ncomplete Rules of Golf (effective January 2016), you'll soon find the answer ..."
  }, 
  {
    "id": "http://www.golfhelptips.com/v/articles/basic-golf-rules.html", 
    "contents": "The game of golf is known for its honor and etiquette, especially as it relates to its \nsacred golf rules with origins dating back to mid 18th century in Edinburgh, ..."
  }, 
  {
    "id": "https://thegolfnewsnet.com/golfnewsnetteam/2018/05/27/what-is-one-ball-rule-golf-tournament-competition-109664/", 
    "contents": "May 27, 2018 ... The One Ball Rule isn't part of the Rules of Golf, meaning not every golfer has to \nadhere to it either when playing casually or even in most ..."
  }, 
  {
    "id": "https://www.chegg.com/homework-help/questions-and-answers/golf-association-tests-golf-balls-ensure-conform-rules-golf-balls-tested-weight-diameter-r-q9451281", 
    "contents": "The Golf Association tests golf balls to ensure that they conform to the rules of \ngolf. Balls are tested for weight,diameter, roundness, and overall distance. Refer \nto ..."
  }, 
  {
    "id": "https://laddergolf.com/pages/official-rules", 
    "contents": "Some of you may have landed on this page because you searched for the rules \nof Ladder Golf, yet you are NOT playing on the official Ladder Golf � Brand ..."
  }, 
  {
    "id": "http://knowyourgolfrules.com/", 
    "contents": "Know Your Golf Rules provides golfers with a quick and easy way to check the \nmost common and complicated rules of golf while on the course."
  }, 
  {
    "id": "https://www.sbnation.com/golf/2018/6/16/17471068/phil-mickelson-putts-moving-ball", 
    "contents": "Jun 16, 2018 ... At the par-4 13th hole at Shinnecock Hills Golf Club, Mickelson sent a 7-foot ... \nBut, if the USGA rules that a player has committed a “serious ..."
  }, 
  {
    "id": "http://www.ewga-midtn.com/communityresources/golfeducationandplayerdevelopment/tenbasicrulesforyourfirstroundofgolf", 
    "contents": "The rules place a limit of 14 clubs in each golfer's bag. There is no ... For most \nrounds of golf you play, you'll want to reserve a tee time. You can get a tee time \nby ..."
  }, 
  {
    "id": "https://thesandtrap.com/forums/topic/45049-interesting-flag-stick-rules/", 
    "contents": "Dfreuter415 .. I went up in my attic and found this in an older golf set !! Its a S \nsand wedge !! What do you think the degree is and I know its not a ..."
  }, 
  {
    "id": "http://www.golf-monthly.co.uk/videos/rules/golfs-rules-myths-declaring-your-ball-lost", 
    "contents": "Mar 17, 2015 ... Declaring your ball lost is a tempting option when you hit it deep into the jungle, \nbut such verbal declarations are meaningless under the Rules ..."
  }, 
  {
    "id": "https://media.specialolympics.org/resources/sports-essentials/sport-rules/Golf-Sports-Rules.pdf", 
    "contents": "GOVERNING RULES. The Official Special Olympics Sports Rules for Golf shall \ngovern all Special Olympics competitions. As an international sports program ..."
  }, 
  {
    "id": "https://www.mshsaa.org/resources/pdf/GolfRulesCards.pdf", 
    "contents": "Definitions, Local Rules, and Conditions. A complete text of Rules and Appendix I \nmay be found in the Current Rules of Golf. Unless otherwise noted, the penalty ..."
  }, 
  {
    "id": "http://www.golfwrx.com/493928/10-things-to-know-about-the-2019-rules-of-golf/", 
    "contents": "Mar 1, 2018 ... According to the draft (see “8” below) there will only be 24 Rules in the 2019 \nRules of Golf (there are 34 now). Please be aware, though, that the ..."
  }, 
  {
    "id": "http://www.bearnagolfmembers.com/%3Fpage_id%3D745", 
    "contents": "The rules of golf do not distinguish between rough and fairway. When you drop a \nball it may roll up to two club lengths and as long as it has not rolled nearer the ..."
  }, 
  {
    "id": "https://sports.yahoo.com/rules-golf-finalized-four-tweaks-170000677.html", 
    "contents": "Mar 12, 2018 ... The new Rules of Golf have been finalized, with four tweaks. Rolled out last year \nas a “modernization” to make the game easier to understand ..."
  }, 
  {
    "id": "http://www.augusta.com/masters/story/news/2018-03-13/usga-ra-announce-new-set-modern-rules-golf", 
    "contents": "Mar 13, 2018 ... Golf now has a modern set of rules for the Royal & Ancient game, an extensive \noverhaul that took six years and is aimed at making the rules ..."
  }, 
  {
    "id": "https://www.golfwdw.com/blog/137-the-rules-of-golf-key-changes-coming-in-2018", 
    "contents": "Jan 2, 2018 ... The Rules change is implemented as a \"local rule\", as the next formal update to \nthe Rules of Golf will not take place until 2019, as part of the ..."
  }, 
  {
    "id": "https://www.golfmagic.com/golf-news/final-changes-new-rules-golf-include-huge-amendments", 
    "contents": "Mar 12, 2018 ... New set of golf rules set for January 1, 2019 - what do you make of these \nchanges?"
  }, 
  {
    "id": "https://www.golftec.com/blog/2017/11/proposed-rules-golf-changes/", 
    "contents": "Nov 21, 2017 ... The USGA and R&A recently announced significant Rules of Golf changes that \nwill go into effect in 2019. Here's what you need to know about ..."
  }, 
  {
    "id": "http://www.jacksonville.com/sports/20180312/usga-rampa-finalize-golf-rules-changes-for-2019", 
    "contents": "Mar 12, 2018 ... The United States Golf Association and the Royal and Ancient Golf Club have \nfinalized their changes to the rules of golf effective next year, and ..."
  }, 
  {
    "id": "https://www.usatoday.com/story/sports/golf/2017/03/01/proposed-changes-golf-rules-simplify-game/98559136/", 
    "contents": "Mar 1, 2017 ... Golf leaders say the changes will make the rules more intuitive and \nstraightforward."
  }, 
  {
    "id": "http://www.skysports.com/golf/news/12176/11287124/ra-and-usga-confirm-significant-changes-to-rules-of-golf", 
    "contents": "Mar 12, 2018 ... New regulations for dropping the ball and measures to speed up the pace of play \nhave been incorporated into the new Rules of Golf ..."
  }, 
  {
    "id": "https://www.arccosgolf.com/blogs/community/arccos-caddie-now-permitted-under-the-rules-of-golf", 
    "contents": "Dec 16, 2017 ... In a ruling that Golf Digest states “expands the possibilities of how technology is \nused in competition,” USGA Decision Number 2017-0754 ..."
  }, 
  {
    "id": "https://golfrules.com/blog/2019-rules-of-golf-unveiled-many-changes/", 
    "contents": "Mar 17, 2018 ... There is exciting news from R&A/USGA: The final version of the 2019 Rules of \nGolf has been published (Monday, March 12th 2018)."
  }, 
  {
    "id": "https://www.bbc.com/sport/golf/43374909", 
    "contents": "Mar 12, 2018 ... Golf's governing bodies confirm a radical overhaul of the game's rules to be \nimplemented at the start of next year."
  }, 
  {
    "id": "http://golfcollege.edu/original-13-rules-golf/", 
    "contents": "May 9, 2017 ... The current Rules of Golf published and approved by the United States Golf \nAssociation and the R&A Rules Limited consists of over 200 pages ..."
  }, 
  {
    "id": "https://www.golfaustralia.com.au/news/golfs-modernised-rules-released-486887", 
    "contents": "Mar 13, 2018 ... The Royal & Ancient Golf Club of St Andrews and the United States Golf \nAssociation have unveiled the new Rules of Golf, to be implemented ..."
  }, 
  {
    "id": "https://www.pgatour.com/news/2016/08/31/experts-rules-of-golf.html", 
    "contents": "Aug 31, 2016 ... NEW YORK (AP) -- For the last five years, the top rules experts in golf have come \ntogether from around the world to study a jigsaw puzzle."
  }, 
  {
    "id": "https://www.sporttechie.com/arccos-caddie-permitted-usga-rules-golf/", 
    "contents": "Jan 10, 2018 ... Arccos Caddie, an artificial intelligence platform meant to act as a digital caddie, \nhas been permitted under the rules of golf by the USGA so ..."
  }
]