[
  {
    "id": "https://business.tutsplus.com/tutorials/what-are-wikis-and-why-should-you-use-them--cms-19540", 
    "contents": "Apr 3, 2017 ... What is a 'wiki' defined as today? This term \"wiki\" actually means quick in \nHawaiian. The journey from that definition to today's definition of \"a ..."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Wiki", 
    "contents": "A wiki (/ˈwɪki/ ( listen) WIK-ee) is a website on which users collaboratively modify content and structure directly from the web browser. In a typical wiki, text is written using a simplified markup language and often edited with the help of a rich-text editor."
  }, 
  {
    "id": "http://wikieducator.org/images/3/34/Newbie_Tut1.pdf", 
    "contents": "It is a shortened form of \"wiki- wiki\", the Hawaiian word for quick. A wiki is a web site that is generally editable by anyone with a computer, a web browser, and an internet connection. Wikis use a quick and easy syntax to allow users to apply formatting to text and create links between pages."
  }, 
  {
    "id": "https://www.lifewire.com/what-is-a-wiki-3486702", 
    "contents": "Jan 27, 2018 ... A beginner's guide to understanding what a wiki is and why wikis have become \nsuch a popular source of information gathering and knowledge ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3D-dnL00TdmLY", 
    "contents": "May 29, 2007 - 4 min - Uploaded by Common CraftA short explanation of wikis and how they can be used to coordinate a group.  This video ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3D4C3nnnSmXvk", 
    "contents": "Feb 18, 2016 - 54 sec - Uploaded by Cool Cat TeacherA simple explanation of a wiki for students. Essential Questions: What is a wiki?  Who was the ..."
  }, 
  {
    "id": "https://www.sitepoint.com/what-is-a-wiki/", 
    "contents": "Nov 3, 2003 ... The simplest online database that could possibly work. –Ward Cunningham. \nDifferent people have different ideas about what a wiki really is, ..."
  }, 
  {
    "id": "http://www.ceebl.manchester.ac.uk/events/archive/aligningcollaborativelearning/Wiki.pdf", 
    "contents": "A wiki is a collection of webpages that can be modified by anyone who has been \ngiven access to it. Some wikis are open to anyone with a web connection ..."
  }, 
  {
    "id": "https://whatis.techtarget.com/definition/wiki", 
    "contents": "A wiki (sometimes spelled \"Wiki\") is a server program that allows users to collaborate in forming the content of a Web site. The term comes from the word \"wikiwiki,\" which means \"fast\" in the Hawaiian language."
  }, 
  {
    "id": "http://theelearningcoach.com/elearning2-0/using-wikis-for-elearning/", 
    "contents": "A wiki is a collaborative web site that collects and organizes content, created and \nrevised by its users. The most well-known example is Wikipedia. Wikis are a ..."
  }, 
  {
    "id": "https://www.techopedia.com/definition/5215/wiki", 
    "contents": "A wiki is a website that allows the site visitors to add and edit content. Generally, \nsite visitors use their browser to edit text without requiring HTML code."
  }, 
  {
    "id": "https://techterms.com/definition/wiki", 
    "contents": "A wiki is a Web site that allows users to add and update content on the site using \ntheir own Web browser. This is made possible by Wiki software that runs on the ..."
  }, 
  {
    "id": "https://computer.howstuffworks.com/internet/basics/wiki.htm", 
    "contents": "A wiki is a collection of articles that multiple users can add to and edit freely \nonline. Learn all about wikis and how they are published."
  }, 
  {
    "id": "http://www.smartcopying.edu.au/information-sheets/schools/using-wikis-and-blogs/what-is-a-wiki-or-blog-", 
    "contents": "Blogs and wikis are some of the new and exciting web 2.0 technologies used in \nAustralian classrooms. 'Web 2.0' is a term used to describe online tools which ..."
  }, 
  {
    "id": "https://www.xwiki.org/xwiki/bin/view/Documentation/UserGuide/GettingStarted/WhatIsAWiki", 
    "contents": "Sep 6, 2017 ... A wiki is a website that you can edit online easily. Whenever you want to modify a \npage, click on the \"edit\" button, make your changes and save ..."
  }, 
  {
    "id": "https://meta.discourse.org/t/what-is-a-wiki-post/30801", 
    "contents": "Jul 5, 2015 ... If a post is already a wiki, instead of the Make Wiki button, the Remove Wiki \nbutton will appear. How can I recognize a wiki post from a regular ..."
  }, 
  {
    "id": "https://www.wooster.edu/offices/web/how/scotblogs/wiki-blog/", 
    "contents": "The differences between a Wiki and a Blog. ... A wiki is a website that allows \nmultiple users to create, modify and organize web page content in a collaborative\n ..."
  }, 
  {
    "id": "https://www.mindtools.com/pages/article/how-to-create-a-wiki.htm", 
    "contents": "Learn how to set up a wiki to encourage collaboration and knowledge-building in \nyour team."
  }, 
  {
    "id": "https://teachersfirst.com/content/wiki/", 
    "contents": "TeachersFirst's Wiki Walk-Through explains in teacher-friendly terms what wikis \nare and how they can be used effectively in the classroom. Find out why ..."
  }, 
  {
    "id": "http://wiki.org/wiki.cgi%3FWhatIsWiki", 
    "contents": "Jun 27, 2002 ... Wiki is a piece of server software that allows users to freely create and edit Web \npage content using any Web browser. Wiki supports hyperlinks ..."
  }, 
  {
    "id": "https://elearningindustry.com/how-to-use-wiki-in-the-classroom", 
    "contents": "Oct 6, 2013 ... Wiki is an online application that allows users to contribute to or edit its content. \nMeaning “quick” in the Hawaiian language, wiki is a creative ..."
  }, 
  {
    "id": "https://cft.vanderbilt.edu/guides-sub-pages/wikis/", 
    "contents": "A wiki is a collaborative tool that allows students to contribute and modify one or \nmore pages of course related materials. Wikis are collaborative in nature and ..."
  }, 
  {
    "id": "https://www.webopedia.com/TERM/W/wiki.html", 
    "contents": "(n.) A collaborative Web site comprises the perpetual collective work of many \nauthors. Similar to a blog in structure and logic, a wiki allows anyone to edit, \ndelete ..."
  }, 
  {
    "id": "https://support.office.com/en-us/article/create-and-edit-a-wiki-dc64f9c2-d1a2-44b5-ac59-b9d535551a32", 
    "contents": "See how to create and edit a wiki, and learn about different types of wikis you can \ncreate."
  }, 
  {
    "id": "http://www.mcbeev.com/Blog/July-2010/9-Reasons-Why-Your-Company-Needs-a-Wiki", 
    "contents": "A wiki can be defined as a web page or web site that allows a community of users \nto add, edit, and maintain content that usually surrounds a given topic or topics ..."
  }, 
  {
    "id": "https://www.commoncraft.com/video/wikis", 
    "contents": "Jul 11, 2011Collaboration on the internet is often difficult. Wikis are a kind of website that  helps solve the ..."
  }, 
  {
    "id": "http://www.dictionary.com/e/wikileaks-wikipedia/", 
    "contents": "As a noun, wiki means “a website that allows anyone to add, delete or revise \ncontent by using a web browser.” The term wiki is also used as a verb; if you wiki,\n ..."
  }, 
  {
    "id": "https://www.mediawiki.org/wiki/MediaWiki", 
    "contents": "Dec 4, 2016 ... MediaWiki is a free and open source software wiki package written in PHP, \noriginally for use on Wikipedia. It is now also used by several other ..."
  }, 
  {
    "id": "http://microformats.org/wiki/wiki-better-than-email", 
    "contents": "4.1 what is the best way to capture and resolve issues; 4.2 should we only \ncapture consensus on the wiki; 4.3 what if I cannot find issues on the wiki; 4.4 \nwhy do ..."
  }, 
  {
    "id": "https://www.zoho.com/wiki/help/faq.html", 
    "contents": "Need help using Zoho Wiki? Find answers to your questions here. Learn more \nabout Zoho Wiki."
  }, 
  {
    "id": "https://www.ifixit.com/Help/Wiki_Formatting_And_Syntax", 
    "contents": "Adding content to a wiki is straight forward—it just requires a basic knowledge of \nwiki syntax. So, what is wiki syntax? It's a simple set of commands that format ..."
  }, 
  {
    "id": "https://www.quora.com/What-is-the-difference-between-a-wiki-and-a-blog", 
    "contents": "Wiki comes from the hawaiian word for \"quick\", for the fact that it can be edited \nquickly (as in \"inside the web browser\", which was a new thing once). A blog is ..."
  }, 
  {
    "id": "https://confluence.atlassian.com/get-started-with-bitbucket/create-or-edit-a-wiki-page-861185321.html", 
    "contents": "May 9, 2018 ... The wiki in your repository is a place to keep documents for everything related to \nyour project. If you don't see an wiki on your repository, you ..."
  }, 
  {
    "id": "https://help.github.com/articles/about-github-wikis/", 
    "contents": "Every GitHub repository comes equipped with a section for hosting \ndocumentation, called a wiki. The main wiki showcase. GitHub Wikis are a place \nin your ..."
  }, 
  {
    "id": "https://tettra.co/knowledge-management/why-every-company-needs-a-workplace-wiki/", 
    "contents": "Learn what a workplace wiki is and why your team needs one to succeed."
  }, 
  {
    "id": "https://www.joe.org/joe/2011december/tt4.php", 
    "contents": "A wiki can be a useful collaborative Web tool for managing virtual teamwork. \nAlthough a wiki is easy to use, the challenge comes with enlisting t."
  }, 
  {
    "id": "https://www.igi-global.com/dictionary/social-media-higher-education/32576", 
    "contents": "Short for “wiki wiki” which means “rapidly” in the Hawaiian language is a website \nthat allows users with access to collaboratively create, edit, link, and categorize ..."
  }, 
  {
    "id": "https://edx.readthedocs.io/projects/edx-partner-course-staff/en/latest/course_assets/course_wiki.html", 
    "contents": "As learners and course team members create and edit wiki articles, they \ncontribute to a repository of information about your course that can be \nimmediately ..."
  }, 
  {
    "id": "https://dev.liferay.com/discover/portal/-/knowledge_base/7-0/working-together-with-the-wiki", 
    "contents": "Liferay Portal's Wiki is a full-featured wiki application which has all the features \nyou would expect in a state of the art wiki. Again, though, it has the benefit of ..."
  }, 
  {
    "id": "https://www.dokuwiki.org/", 
    "contents": "Mar 18, 2018 ... DokuWiki is a simple to use and highly versatile Open Source wiki software that \ndoesn't require a database. It is loved by users for its clean and ..."
  }, 
  {
    "id": "https://www.wikihow.com/Start-a-Wiki", 
    "contents": "This wikiHow teaches you how to create a wiki-style website. You can do this by \nusing a free wiki creator such as Wikia or Wikidot, or you can host your own wiki ..."
  }, 
  {
    "id": "https://www.nuclino.com/solutions/company-wiki", 
    "contents": "Nuclino is the easiest company wiki to share and organize knowledge."
  }, 
  {
    "id": "https://www.wikispaces.com/", 
    "contents": "Users: If you are a member of a Classroom, Plus or Super Wiki, please contact \nyour Wikispaces organiser directly. The organiser can be found in the \"members\"\n ..."
  }, 
  {
    "id": "https://www.blackboard.niu.edu/blackboard/_pdf/guides/wikis.pdf", 
    "contents": "Creating a Wiki. 1. From the Control Panel, click Course Tools. 2. Click Wikis. 3. \nClick Create Wiki. 4. On the Create Wiki page, provide the wiki Name and."
  }, 
  {
    "id": "https://docs.gitlab.com/ee/user/project/wiki/", 
    "contents": "Wikis are very convenient if you don't want to keep your documentation in your \nrepository, but you do want to keep it in the same project where your code \nresides ..."
  }, 
  {
    "id": "https://educationaltechnology.net/wikis-in-education/", 
    "contents": "What are Wikis? And should you use them? A Wiki can be defined as ''a system \nthat allows one or more people to build up a corpus of knowledge in a set of ..."
  }, 
  {
    "id": "https://help.blackboard.com/Learn/Instructor/Interact/Wikis", 
    "contents": "Wikis allow course members to contribute and modify one or more pages of \ncourse-related materials and provide a means of sharing and collaboration."
  }, 
  {
    "id": "http://twiki.org/", 
    "contents": "TWiki is leading open source enterprise wiki and Web application platform used \nby 50000 small businesses, many Fortune 500 companies, and millions of ..."
  }, 
  {
    "id": "http://wiki.c2.com/%3FChoosingaWiki", 
    "contents": "Nowadays many people get to know wikis by discovering WikiPedia, or as the \nresult of the use of a SearchEngine such as GoogleSearch. People who are ..."
  }, 
  {
    "id": "https://www.pbworks.com/education.html", 
    "contents": "A single, searchable, central collaborative learning environment for students, \nteachers, and parents that stores all your knowledge and data, from wikis to files\n ..."
  }, 
  {
    "id": "http://www.wikia.com/fandom", 
    "contents": "Explore Wikis · Community Central · Start a Wiki · Sign In. Don't have an account? \nRegister. > Sign In | Register · Games Movies TV Video Wikis. Back Explore ..."
  }, 
  {
    "id": "https://codebeamer.com/cb/wiki/11104", 
    "contents": "CodeBeamer's Wiki can allow your information-flow to be as democratic as Wiki \nsystem used by communities, or it can instead allow structured document ..."
  }, 
  {
    "id": "https://en.share-gate.com/blog/sharepoint-wiki-publishing-web-part-pages-overview", 
    "contents": "Wiki, publishing, and web part pages are various SharePoint pages you can \ncreate in your site. But how do you choose which one to use? Learn more here!"
  }, 
  {
    "id": "http://wikidpad.sourceforge.net/", 
    "contents": "What makes wikidPad different from other notepad applications is the ease with \nwhich you can cross-link your information. Links in a wiki are created by typing in\n ..."
  }, 
  {
    "id": "https://liquipedia.net/", 
    "contents": "The esports wiki, the best resource for live updated results, tournament overview, \nteam and player profiles, game information, and more..."
  }, 
  {
    "id": "https://tiddlywiki.com/", 
    "contents": "In contrast to all other wikis, TiddlyWiki is a single HTML file that runs in the \nbrowser and thus can be used on all modern operating systems. And because \nthere ..."
  }, 
  {
    "id": "https://www.wikidata.org/wiki/Wikidata:Main_Page", 
    "contents": "Apr 15, 2018 ... ... species Wikimedia Commons – Media repository Incubator – New language \nversions Meta-Wiki – Wikimedia project coordination MediaWiki ..."
  }, 
  {
    "id": "https://meta.stackexchange.com/questions/11740/what-are-community-wiki-posts", 
    "contents": "Community Wiki posts work by partly transferring ownership of the post from the \noriginal author to the community. They make the post easier to ..."
  }, 
  {
    "id": "https://minecraft.gamepedia.com/Minecraft_Wiki", 
    "contents": "Minecraft Wiki is a complete resource for Minecraft, including gameplay, blocks, \ncrafting, updates, events, mods, running a server, and resource packs."
  }, 
  {
    "id": "https://en.wiktionary.org/wiki/Wiktionary:Main_Page", 
    "contents": "Wiktionary is a wiki, which means that you can edit it, and all the content is dual-\nlicensed under both the Creative Commons Attribution-ShareAlike 3.0 Unported\n ..."
  }, 
  {
    "id": "https://awoiaf.westeros.org/index.php/Westeros", 
    "contents": "Feb 23, 2018 ... Westeros is one of the four known continents in the known world, the others \nbeing Essos, Sothoryos, and Ulthos. Most of the area of Westeros is ..."
  }, 
  {
    "id": "http://tmbw.net/wiki/Main_Page", 
    "contents": "From This Might Be A Wiki. Welcome to This Might Be A Wiki The They Might Be \nGiants Knowledge Base. Wik the Ki! Wik the Ki! He's the ugliest monitor on the ..."
  }, 
  {
    "id": "https://eacea.ec.europa.eu/national-policies/en/youthwiki", 
    "contents": "Jun 4, 2018 ... The Youth Wiki is Europe's online encyclopaedia in the area of national youth \npolicies. The platform is a comprehensive database of national ..."
  }, 
  {
    "id": "https://eacea.ec.europa.eu/national-policies/en/youthwiki", 
    "contents": ""
  }, 
  {
    "id": "https://wikileaks.org/", 
    "contents": "This key's fingerprint is A04C 5E09 ED02 B328 03EB 6116 93ED 732E 9231 \n8DBA -----BEGIN PGP PUBLIC KEY BLOCK----- ..."
  }, 
  {
    "id": "https://commons.wikimedia.org/wiki/Commons:Wiki_Loves_Africa_2017/en", 
    "contents": "May 7, 2018 ... WIKI LOVES AFRICA 2017. The photo contest around Africa, ... Check it out on \nCommons:Wiki Loves Africa 2017/Winners. Congratulations to ..."
  }, 
  {
    "id": "https://commons.wikimedia.org/wiki/Commons:Wiki_Loves_Africa_2017/en", 
    "contents": ""
  }, 
  {
    "id": "https://wiki.openstreetmap.org/wiki/Map_Features", 
    "contents": "Sep 10, 2017 ... OpenStreetMap represents physical features on the ground (e.g., roads or \nbuildings) using tags attached to its basic data structures (its nodes, ..."
  }, 
  {
    "id": "https://www.w3.org/wiki/WebID", 
    "contents": "Jun 17, 2018 ... WebIDs and the WebID Protocol. The W3C is still exploring better ways to do \nauthentication, for example in the 2014 workshop on ..."
  }, 
  {
    "id": "http://bitcoinwiki.org/", 
    "contents": "A multilingual encyclopedia project on blockchain and cryptocurrency. Find 4000\n+ articles concerning bitcoin, ethereum, exchange, mining, safety, storage, and ..."
  }, 
  {
    "id": "https://www.theiphonewiki.com/wiki/Firmware", 
    "contents": "May 10, 2018 ... A firmware is an IPSW file that contains everything needed to run the core \noperating system, iOS. Beta firmwares have also been released, but ..."
  }, 
  {
    "id": "http://www.answers.com/topic/wiki", 
    "contents": "A \"wiki\" is a website that allows people who use the website to edit it (or specific \nportions, like the answers to questions such as this website allows). It allows ..."
  }, 
  {
    "id": "https://trac.edgewall.org/", 
    "contents": "Jan 6, 2017 ... Trac is an enhanced wiki and issue tracking system for software development \nprojects. Trac uses a minimalistic approach to web-based ..."
  }, 
  {
    "id": "https://www.freeplane.org/wiki/index.php/Home", 
    "contents": "May 13, 2018 ... You can navigate this wiki in different ways. The navigation menu on the left \ndirects you to main support areas. Pages on detailed topics can be ..."
  }, 
  {
    "id": "https://bulbapedia.bulbagarden.net/wiki/Main_Page", 
    "contents": "As part of Bulbagarden, this ever-growing wiki is supported by Bulbanews, \nBulbagarden Archives, and the Bulbagarden forums. You're welcome to browse \nfor a ..."
  }, 
  {
    "id": "https://wikihouse.cc/", 
    "contents": "High-performance homes made simple. Sustainable design solutions that can be \nassembled by anyone. Watch a video. The future of homes by everyone, for ..."
  }, 
  {
    "id": "https://wikihouse.cc/", 
    "contents": ""
  }, 
  {
    "id": "https://wikihouse.cc/", 
    "contents": ""
  }, 
  {
    "id": "https://wikihouse.cc/", 
    "contents": ""
  }, 
  {
    "id": "https://www.pinvoke.net/", 
    "contents": "PInvoke.net is primarily a wiki, allowing developers to find, edit and add PInvoke* \nsignatures, user-defined types, and any other information related to calling ..."
  }, 
  {
    "id": "https://en.bitcoin.it/wiki/Controlled_supply", 
    "contents": "Jun 13, 2018 ... In a centralized economy, currency is issued by a central bank at a rate that is \nsupposed to match the growth of the amount of goods that are ..."
  }, 
  {
    "id": "http://www.arduino.cc/", 
    "contents": "Open-source electronic prototyping platform enabling users to create interactive \nelectronic objects."
  }, 
  {
    "id": "https://creativecommons.org/faq/", 
    "contents": "Mar 7, 2018 ... For guidelines on the permitted uses of the Fedora trademarks, refer to https://\nfedoraproject.org/wiki/Legal:Trademark_guidelines.” ..."
  }, 
  {
    "id": "https://jmeter.apache.org/", 
    "contents": "... that allow you to customize JMeter; Javadoc API documentation · JMeter FAQ (\nWiki) · JMeter Wiki · Building JMeter and Add-Ons for advanced usage ..."
  }, 
  {
    "id": "https://jmeter.apache.org/", 
    "contents": ""
  }, 
  {
    "id": "https://jmeter.apache.org/", 
    "contents": ""
  }, 
  {
    "id": "https://www.r-project.org/", 
    "contents": "The R Project for Statistical Computing. Getting Started. R is a free software \nenvironment for statistical computing and graphics. It compiles and runs on a \nwide ..."
  }, 
  {
    "id": "https://www.r-project.org/", 
    "contents": ""
  }, 
  {
    "id": "https://www.r-project.org/", 
    "contents": ""
  }, 
  {
    "id": "https://www.r-project.org/", 
    "contents": ""
  }
]