[
  {
    "id": "https://www.healthline.com/health/menopause/male", 
    "contents": ""
  }, 
  {
    "id": "https://www.healthline.com/health/menopause/male", 
    "contents": "Mar 8, 2016 ... It describes age-related changes in male hormone levels. The same group of symptoms is also known as testosterone deficiency, androgen deficiency, and late-onset hypogonadism. Male menopause involves a drop in testosterone production in men who are age 50 or older."
  }, 
  {
    "id": "https://www.webmd.com/men/guide/male-menopause", 
    "contents": "Jan 14, 2017 ... Some doctors are noticing that men are reporting some of the same symptoms that women experience in perimenopause and menopause.\n ... Doctors say that men receiving hormone therapy with testosterone have reported relief of some of the symptoms associated with so-called male menopause."
  }, 
  {
    "id": "https://www.mayoclinic.org/healthy-lifestyle/mens-health/in-depth/male-menopause/art-20048056", 
    "contents": "May 18, 2017 ... The term \"male menopause\" is sometimes used to describe decreasing \ntestosterone levels related to aging. Female menopause and so-called ..."
  }, 
  {
    "id": "https://www.medicalnewstoday.com/articles/266749.php", 
    "contents": "Oct 7, 2016 ... They emerge slowly and subtly, and the decrease in the levels of male hormone, or testosterone, is less steep than it is for women. Health professionals do not use the term \"male menopause,\" but they may refer to the phenomenon as andropause, testosterone deficiency, or late-onset hypogonadism."
  }, 
  {
    "id": "https://www.livescience.com/36014-male-menopause-real-signs.html", 
    "contents": "Dec 6, 2011 ... Age-related decline in testosterone levels is also called testosterone deficiency, androgen decline in the aging male (ADAM) or late onset hypogonadism (LOH). Andropause is different from the menopause women experience. In menopause, the production of female hormone drops suddenly."
  }, 
  {
    "id": "https://www.huffingtonpost.com/entry/5-reasons-men-dont-want-to-deal-with-male-menopause_us_561547d7e4b021e856d31916", 
    "contents": "Oct 8, 2015 ... Many men suffer from andropause — frequently referred to as male menopause \n— which occurs when their hormone production drops."
  }, 
  {
    "id": "https://mysecondspring.ie/menopause/male-menopause", 
    "contents": "Male menopause – a real phenomenon or a myth? Read on to find out… Male \nmenopause or andropause can cause a range of symptoms that can affect men \nin ..."
  }, 
  {
    "id": "https://www.medicinenet.com/male_menopause/article.htm", 
    "contents": "Jun 29, 2012 ... Lower production of the male hormone testosterone (androgen) could lead to \nmale menopause symptoms: fatigue, weakness, depression, and ..."
  }, 
  {
    "id": "https://www.medicinenet.com/male_menopause/views.htm", 
    "contents": "Mar 2, 2017 ... Is male menopause fact or fiction? Symptoms of male menopause are not clearly \ndefined but complaints include sexual dysfunction, weight ..."
  }, 
  {
    "id": "http://observer.com/2017/10/male-menopause-does-exist-these-are-the-symptoms/", 
    "contents": "Oct 6, 2017 ... Menopause in men is very different to what women experience, but as they age, \nmen will also see changes from a decline in testosterone."
  }, 
  {
    "id": "https://prostate.net/articles/natural-remedies-for-andropause-male-menopause", 
    "contents": "Feb 2, 2012 ... Natural remedies for andropause, also known as male menopause, can provide \nsignificant relief for many men. Although declining levels of ..."
  }, 
  {
    "id": "https://www.healthxchange.sg/men/prostate-health/andropause-what-causes-it", 
    "contents": "Andropause, also known as male menopause, decreases your sex drive and makes you feel weak and moody.\n The Department of Geriatric Medicine and Urology at Singapore General Hospital shares its causes and symptoms.\n ... If you are a male past middle age, you may be experiencing ..."
  }, 
  {
    "id": "https://www.guystuffcounseling.com/counseling-men-blog/how-to-recognize-male-menopause-symptoms", 
    "contents": "Mar 11, 2017 ... What are the real-life Male Menopause Symptoms? Learn from these true stories \nand an expert in men's health."
  }, 
  {
    "id": "http://www.cnn.com/2010/HEALTH/08/10/treating.male.menopause/index.html", 
    "contents": "Aug 10, 2010 ... Sweaty, sleepless nights. Inexplicable grouchiness. Weight gain, headaches, \nand no sex drive. Many women approaching menopause can ..."
  }, 
  {
    "id": "https://www.bodylogicmd.com/for-men/symptoms-of-andropause", 
    "contents": "Are You Experiencing Andropause Symptoms such as ED, Night Sweats & \nMuscle Loss? Combat Male Menopause Symptoms and Low T Through \nHormone ..."
  }, 
  {
    "id": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1070997/", 
    "contents": "The term “male menopause” is inappropriate because it suggests a sudden drop \nin sex hormones such as occurs in women in the perimenopausal state. It is not ..."
  }, 
  {
    "id": "https://www.amazon.com/Male-Menopause-Jed-Diamond/dp/1570713979", 
    "contents": "Male Menopause [Jed Diamond] on Amazon.com. *FREE* shipping on qualifying \noffers. Describes the medical, psychological, and emotional symptoms of ..."
  }, 
  {
    "id": "https://www.everydayhealth.com/mens-health/managing-male-menopause.aspx", 
    "contents": "Jan 28, 2013 ... Male menopause sounds like a contradiction in terms: Men don't have periods, \nso how can they experience menopause, which is defined as ..."
  }, 
  {
    "id": "https://www.everydayhealth.com/sexual-health/sex-and-aging/is-there-a-male-menopause.aspx", 
    "contents": "Jul 27, 2016 ... Men tend to have declining testosterone levels as they age, which is called late \nonset hypogonadism, or male menopause. Here's how to tell if ..."
  }, 
  {
    "id": "https://www.prevention.com/health/a20500894/could-male-menopause-explain-his-low-sex-drive/", 
    "contents": "Oct 23, 2017 ... The concept of \"male menopause\" is controversial among clinicians, in part \nbecause there's no clear sign for it, as there is for women when ..."
  }, 
  {
    "id": "https://www.thesun.co.uk/fabulous/4195757/male-menopause-symptoms-manopause/", 
    "contents": "Mar 22, 2018 ... Some men in their late 40s and early 50s develop loss of sex drive and \ndepression and have called the condition 'male menopause'"
  }, 
  {
    "id": "http://www.lifeextension.com/Magazine/2015/6/Male-Menopause/Page-01", 
    "contents": "Male Menopause. June 2015. By Abraham Morgentaler, MD, FACS. One of the \nfastest-growing areas in medicine today is the use of testosterone in men, ..."
  }, 
  {
    "id": "http://www.medbroadcast.com/condition/getcondition/andropause", 
    "contents": "Andropause is a condition that is associated with the decrease in the male \nhormone testosterone. It is unlike menopause in that the decrease in testosterone \nand ..."
  }, 
  {
    "id": "https://yourhealthtube.com/deal-male-menopause-symptoms-man/", 
    "contents": "Mar 6, 2018 ... Male menopause symptoms usually appear in the late 40s or early 50s. Male \nmenopause, also known as andropause, refers to a drop in ..."
  }, 
  {
    "id": "https://www.lifehack.org/361611/male-menopause-symptoms-that-may-surprise-you", 
    "contents": "Male menopause is associated with a decline in testosterone level, which is part \nof the aging process. Here are few symptoms that may surprise you."
  }, 
  {
    "id": "https://www.britannica.com/science/male-menopause", 
    "contents": "Other articles where Male menopause is discussed: human endocrine system: \nThe testis: …by late-onset hypogonadism (andropause, or male menopause), ..."
  }, 
  {
    "id": "https://goodmenproject.com/health/male-menopause-hidden-cause-mid-life-marriage-meltdown-wcz/", 
    "contents": "Apr 25, 2017 ... “If menopause is the silent passage,” says author Gail Sheehy, “Male menopause \nis the unspeakable passage. It is fraught with secrecy, shame ..."
  }, 
  {
    "id": "https://www.nhs.uk/conditions/male-menopause/", 
    "contents": "Read about male menopause, where some men develop depression, loss of sex \ndrive, erectile dysfunction and other physical and emotional symptoms when ..."
  }, 
  {
    "id": "https://www.wikihow.com/Understand-Male-Menopause", 
    "contents": "How to Understand Male Menopause. Women may not be alone when it comes \nto suffering from menopause-like symptoms, and the medical community is now ..."
  }, 
  {
    "id": "https://www.globalhealingcenter.com/natural-health/truth-about-male-menopause/", 
    "contents": "May 12, 2014 ... Male menopause is the age-related decline of hormone production and activity. \nThis brings on a spectrum of physical changes — decline in ..."
  }, 
  {
    "id": "https://health.howstuffworks.com/wellness/men/health-tips/men-menopause.htm", 
    "contents": "When a woman is moody, it's hormones. When a man is moody, it's work stress, \nor money problems, or just one of those days. Right? Maybe not. An increasing ..."
  }, 
  {
    "id": "https://www.focusonthefamily.com/family-q-and-a/life-challenges/wife-wonders-if-husband-is-going-through-male-menopause", 
    "contents": "Is my husband going through \"male menopause\"? Lately he's been irritable and \nmoody, but when I ask him about it he says he can't put a finger on anything."
  }, 
  {
    "id": "https://www.drmarinajohnson.com/articles/male-menopause-andropause/", 
    "contents": "This has been referred to as male menopause or Andropause. If a man has a \npermanent decline in testosterone production, it should be treated. However, in ..."
  }, 
  {
    "id": "https://www.womensinternational.com/andropause/", 
    "contents": "Dec 14, 2017 ... What some people don't know is that men also go through a similar transition, \nknown as andropause or male menopause, during their later ..."
  }, 
  {
    "id": "https://www.hotzehwc.com/2017/04/testosterone-beneficial-for-male-menopause-and-prostate/", 
    "contents": "Apr 5, 2017 ... Testosterone is beneficial for male menopause and the prostate. Research \nshows that testosterone does not increase the risk of prostate ..."
  }, 
  {
    "id": "https://obrienrx.com/andropause-male-menopause/", 
    "contents": "Andropause - The Male Menopause authored by Lisa and Erick Everett, Certified \nClinical Nutritionists at O'Brien Pharmacy in Mission KS."
  }, 
  {
    "id": "https://www.coastalpharmacyandwellness.com/andropause-what-to-do/", 
    "contents": "Sep 26, 2017 ... Is male menopause real? Yes and no. Men go through natural hormone decline \nas they age, but the changes are less rapid and less severe ..."
  }, 
  {
    "id": "https://www.cbsnews.com/news/experts-call-male-menopause-a-myth/", 
    "contents": "It may be called \"men\"-opause, but it's a time of life that only belongs to women. \nMale menopause, well, that may be a myth, according to some experts."
  }, 
  {
    "id": "https://www.activebeat.com/your-health/11-true-facts-about-male-menopause/", 
    "contents": "Nov 7, 2013 ... Male menopause doesn't cause the same symptoms as it does in women. Men \naffected by it won't suffer hot flashes, hormones to plummet in a ..."
  }, 
  {
    "id": "https://www.netdoctor.co.uk/healthy-living/sex-life/a27050/does-the-male-menopause-really-exist/", 
    "contents": "Oct 4, 2016 ... The male menopause, the manopause, the andropause. Call it what you like, but \ndoes it really exist? Well, actually, I think it does but not in the ..."
  }, 
  {
    "id": "https://dictionary.cambridge.org/us/dictionary/english/male-menopause", 
    "contents": "male menopause meaning: 1. physical and emotional changes experienced by \nsome men in middle or late life, caused by their body producing less ..."
  }, 
  {
    "id": "https://www.thefreedictionary.com/male%2Bmenopause", 
    "contents": "Define male menopause. male menopause synonyms, male menopause \npronunciation, male menopause translation, English dictionary definition of male\n ..."
  }, 
  {
    "id": "https://medical-dictionary.thefreedictionary.com/male%2Bmenopause", 
    "contents": "Looking for online definition of male menopause in the Medical Dictionary? male \nmenopause explanation free. What is male menopause? Meaning of male ..."
  }, 
  {
    "id": "http://www.serenityhealthcarecenter.com/male-menopause/", 
    "contents": "Menopause and aging is not just for women. Men experience midlife changes as \nwell. This condition is caused by a shift in hormonal balance; however it ..."
  }, 
  {
    "id": "http://www.dictionary.com/browse/male-menopause", 
    "contents": "Male menopause definition, a malaise that allegedly affects men in middle age \nand is said to be responsible for periods of emotional upset and uncharacteristic\n ..."
  }, 
  {
    "id": "https://behealthy.today/male-menopause-real-proof/", 
    "contents": "Apr 19, 2017 ... Now here's something you don't hear every day: male menopause. That's right. \nMale menopause is indeed real. And it can happen to any male ..."
  }, 
  {
    "id": "https://www.collinsdictionary.com/us/dictionary/english/male-menopause", 
    "contents": "Male menopause definition: a period in a man's later middle age in which he may \nexperience an identity crisis as he... | Meaning, pronunciation, translations and ..."
  }, 
  {
    "id": "https://www.diagnose-me.com/symptoms-of/andropause-male-menopause.php", 
    "contents": "Feb 13, 2018 ... Complete information about Andropause/Male Menopause, including signs and \nsymptoms; conditions that suggest it; contributing risk factors."
  }, 
  {
    "id": "https://www.sciencedirect.com/science/article/pii/0378512285900453", 
    "contents": "The existence of a variety of disturbing symptoms, sometimes loosely described \nas 'the male menopause', has received wide confirmation in both professional ..."
  }, 
  {
    "id": "http://akashacenter.com/male-menopause-does-it-really-exist/", 
    "contents": "Male menopause, known as andropause, is strongly debated among many \nmedical specialists, including primary care physicians, endocrinologists, \npsychiatrists ..."
  }, 
  {
    "id": "https://www.usrf.org/news/000908-malemenopause.html", 
    "contents": "3rd Quarter, 2000 - MENOPAUSE refers to the permanent cessation of menses, \nnow occurring in the U.S. at an average age of 51 years. Is there a male ..."
  }, 
  {
    "id": "http://www.blueskymd.com/top-8-signs-you-might-be-going-through-male-menopause", 
    "contents": "Jul 12, 2016 ... Andropause, the male equivalent of menopause, is a gradual, progressive \ndecline in testosterone. Learn the signs and symptoms of ..."
  }, 
  {
    "id": "http://www.totalhealthinstitute.com/male-menopause/", 
    "contents": "While female menopause is an accepted medical condition with an array of \ntreatments and therapies, male menopause is often dismissed as a figment of the\n ..."
  }, 
  {
    "id": "https://www.belmarrahealth.com/andropause-natural-treatment-26-home-herbal-remedies-male-menopause/", 
    "contents": "Jun 9, 2017 ... The term andropause is used to describe men with low testosterone. It is often \ncalled the male menopause. Learn about andropause natural ..."
  }, 
  {
    "id": "http://www.familyhealthonline.ca/fho/growingolder/GO_andropause_FHa03.asp", 
    "contents": "Family Health Magazine - growing older. Male Menopause Is andropause the \nmale equivalent? In North America, people are living longer. They are productive\n ..."
  }, 
  {
    "id": "https://www.macmillandictionary.com/us/dictionary/american/the-male-menopause", 
    "contents": "Define the male menopause (noun) and get synonyms. What is the male \nmenopause (noun)? the male menopause (noun) meaning, pronunciation and \nmore by ..."
  }, 
  {
    "id": "https://consumer.healthday.com/encyclopedia/aging-1/misc-aging-news-10/male-menopause-646132.html", 
    "contents": "Over the years, health journalists, members of the general public, and a few \ndoctors have embraced the term \"male menopause\" to describe the changes that\n ..."
  }, 
  {
    "id": "https://www.hormone.org/hormone/diseases-and-conditions/mens-health/low-testosterone/male-menopause", 
    "contents": "MYTH: Male menopause is real. FACT: No, it's not real. The term “menopause” \nonly pertains to the female condition when the ability to reproduce is halted."
  }, 
  {
    "id": "https://urologyaustin.com/male-menopause-is-it-real/", 
    "contents": "Andropause, or male menopause, is associated with low levels of testosterone \nand strikes 1 in 3 men over the age of 45. This condition is also frequently ..."
  }, 
  {
    "id": "http://www.lakeviewhealth.org/malemenopause", 
    "contents": "Definition: TD (Testosterone Deficiency) has been described in a few different \nterms, including male menopause, andropause, hypogonadism and androgen ..."
  }, 
  {
    "id": "https://www.merriam-webster.com/dictionary/male%2520menopause", 
    "contents": "First Known Use of male menopause. 1949. in the meaning defined above. See \nWords from the same year. NEW! Time Traveler ..."
  }, 
  {
    "id": "https://thebiostation.com/bioblog/hormone-replacement-therapy/symptoms-male-menopause/", 
    "contents": "Mar 3, 2017 ... Suspect that you have male menopause and are looking for answers to your \nissues? If so, click to read about the symptoms and treatments for ..."
  }, 
  {
    "id": "https://www.theguardian.com/world/2002/mar/24/gender.medicalscience", 
    "contents": "Mar 24, 2002 ... Since the speculation about it began more than 50 years ago, the male \nmenopause - sometimes called irritable male syndrome - has entered ..."
  }, 
  {
    "id": "http://journals.sagepub.com/doi/10.1177/089198870001300208", 
    "contents": "The objective of this study was to review the literature on the hormonal changes \nthat occur in aging males in order to determine if testosterone declines in rel..."
  }, 
  {
    "id": "https://www.theturekclinic.com/about/dr-turek-in-the-news-fertility-la-los-angeles-beverly-hills-larchmont-bay-area/male-menopause/", 
    "contents": "Male Menopause? As a men's health specialist, Dr. Turek is interested in the \neffects of a man's age on reproduction and hormones. Here he gives a short \nreview ..."
  }, 
  {
    "id": "https://inclinechiropractic.com/articles/male-menopause/", 
    "contents": "Male menopause is a very real phenomenon and it has a name: Andropause. \nThat's the textbook term for the midlife decline in male hormone production of ..."
  }, 
  {
    "id": "https://www.tandfonline.com/doi/full/10.3109/13697137.2010.507442", 
    "contents": "Several descriptive names, such as andropause, male menopause, partial \nandrogen deficiency of the aging male and late-onset hypogonadism, have been\n ..."
  }, 
  {
    "id": "https://www.urbandictionary.com/define.php%3Fterm%3Dmale%2520menopause", 
    "contents": "May 11, 2016 ... \"Male menopause\" may be the result of hypogonadism, where the testes produce \nfew or no hormones. Kind of lame for all involved."
  }, 
  {
    "id": "https://www.gnjournal.com/article/S0197-4572(01)16707-8/fulltext", 
    "contents": "Cathy R. Kessenich, DSN, ARNP, is an associate professor at the University of \nTampa and a nurse practitioner at the Osteoporosis Testing Center in Tampa, Fla\n."
  }, 
  {
    "id": "https://www.healthyplace.com/depression/articles/male-menopause-men-and-depression", 
    "contents": "Jun 23, 2016 ... Most common problem associated with male menopause is depression which is \nclosely related to impotence and problems with male sexuality."
  }, 
  {
    "id": "https://www.telegraph.co.uk/science/2016/12/22/cure-male-menopause-switching-skin-cells-scientists/", 
    "contents": "Dec 22, 2016 ... A treatment to end the male menopause is in sight after scientists devised a \nmethod of boosting testosterone by injecting reprogrammed skin ..."
  }, 
  {
    "id": "https://juetersonke.com/services/conditions-treated/andropause-male-menopause/", 
    "contents": "What is Male Menopause? “Male Menopause” is the more common term for \nandropause. It describes age-related changes in male hormone levels. The same\n ..."
  }, 
  {
    "id": "https://academic.oup.com/labmed/article-pdf/36/12/771/24959313/labmed36-0771.pdf", 
    "contents": "Testosterone decline is a normal process beginning at age 30 to 40, at a rate of \napproximately 0.4% to 1.6% per year.1,2 If the level decreases faster, men can ..."
  }, 
  {
    "id": "https://www.nytimes.com/1973/01/28/archives/is-there-a-male-menopause-or-what-is-going-on-when-the-glands-the.html", 
    "contents": "Jan 28, 1973 ... M W Lear article on male menopause defines term as 'cluster of physiologic, \nconstitutional and psychological symptoms occurring in some men ..."
  }, 
  {
    "id": "http://www.clevelandclinic.org/health/health-info/docs/3000/3001.asp%3Findex%3D10094", 
    "contents": "Some doctors are noticing that their male patients are reporting some of the same \nsymptoms that women experience in menopause. The medical community is ..."
  }, 
  {
    "id": "https://www.therenewalpoint.com/articles/reversing-male-menopause-testosterone-key-virility", 
    "contents": "Andropause, often called \"male menopause\", used to be seen as part of an aging \nprocess that was to be accepted gracefully. This decline in male health is ..."
  }, 
  {
    "id": "http://www.health.com/health/condition-article/0,,20408367,00.html", 
    "contents": "Dec 2, 2011 ... The symptoms of male menopause and what can be done for treatment."
  }, 
  {
    "id": "https://millennialmagazine.com/2018/01/27/is-male-menopause-reality-or-myth/", 
    "contents": "Jan 27, 2018 ... Pronouncing the term ‛male menopause' is highly controversial, especially in the \ncompany of medically educated persons. The main reason is ..."
  }, 
  {
    "id": "https://www.sharecare.com/health/mens-health/is-there-male-menopause", 
    "contents": "Male menopause is a misnomer or an inaccurate term describing a decline in \ntestosterone in older men. Unlike female menopause, where estrogen is compl."
  }, 
  {
    "id": "https://www.mannaplus.co.za/natural-remedies-for-male-menopause-2/", 
    "contents": "May 10, 2017 ... The male version of menopause is known as Andropause. It is about the same as \nmenopause in women, except this time it is the testosterone ..."
  }, 
  {
    "id": "https://us.myprotein.com/thezone/nutrition/what-is-the-male-menopause-andropause-definition-symptoms/", 
    "contents": "Feb 6, 2018 ... Do you know that males also go through the menopause? Click here to discover \nwhen and what happens during Andropause here!"
  }, 
  {
    "id": "http://menalive.com/male-menopause-andropause-impacts-men-women-families/", 
    "contents": "Male mid life is often talked about in humorous terms but rarely is it discussed \nseriously. Learn 12 tips for dealing with male menopause in the family."
  }, 
  {
    "id": "http://lauda.ulapland.fi/handle/10024/61737", 
    "contents": "The existence of male menopause is uncertain (e.g. Snyder 2004; Rhoden & \nMorgenthaler 2004) and also the effects of HT have not yet been clarified as \nbeing ..."
  }, 
  {
    "id": "http://www.backinform.com/the-influence-of-exercising-on-andropause-aka-male-menopause/", 
    "contents": "This situation is commonly referred to as “male menopause” or “Andropause” aka \nandrogen decline in the aging male (ADAM), partial androgen deficiency in the ..."
  }, 
  {
    "id": "http://www.fertilityanswers.com/male-menopause/", 
    "contents": "Aug 15, 2017 ... Is male menopause real? Our Louisiana fertility specialist explains age-related \nmale fertility decline."
  }, 
  {
    "id": "https://bhrcenter.com/male-menopause/", 
    "contents": "Andropause, male menopause, is result of significant drop of androgens such as \ntestosterone. Andropause is described as aging-related hormone change in ..."
  }, 
  {
    "id": "https://www.wellmedica.com/andropause-male-menopause/", 
    "contents": "Mar 22, 2017 ... However, this is simply not the case. Andropause, more commonly known as \nmale menopause, is a very real condition that occurs when men ..."
  }, 
  {
    "id": "http://www.spanishdict.com/translate/male%2520menopause", 
    "contents": "Translate Male menopause. See Spanish-English translations with audio \npronunciations, examples, and word-by-word explanations."
  }, 
  {
    "id": "https://www.thehealthyhomeeconomist.com/male-menopause-myth-or-reality/", 
    "contents": "Jan 25, 2018 ... We've spent the last three fitness posts on aging women and menopause–what \nabout the other gender? Is Male Menopause a real ..."
  }, 
  {
    "id": "http://balancedocs.com/article-library/male-menopause/", 
    "contents": "Male Menopause Symptoms: Articles on men's health, male menopause, \ntestosterone, hormone testing for men and andropause information by Nisha \nJackson, ..."
  }, 
  {
    "id": "https://pittsburgh.cbslocal.com/2017/03/20/doctors-say-some-may-be-suffering-from-male-menopause/", 
    "contents": "Mar 20, 2017 ... Some doctors call it andropause or “male menopause.” With a woman, it's clear \nwhen menopause begins. For men, it's less clear. It's generally ..."
  }, 
  {
    "id": "http://www.fitnesssolutionsplus.ca/blog/male-menopause/", 
    "contents": "Jul 7, 2017 ... What is male menopause - the signs, differences compared to female \nmenopause, obstacles to proper hormonal balance, and what to do about ..."
  }, 
  {
    "id": "https://alternativemedicine.com/thing-male-menopause/", 
    "contents": "As men enter midlife, levels of their male hormones, known as androgens, \ndecline and can become unbalanced. When this occurs, a variety of symptoms \nbegin ..."
  }, 
  {
    "id": "http://www.nickdelgado.com/is-male-menopause-silently-sabotaging-your-health-happiness-and-sexuality/", 
    "contents": "Feb 9, 2017 ... Andropause, or male menopause, is the term used to describe a set of symptoms \nand risks that occur from a testosterone deficiency. It typically ..."
  }, 
  {
    "id": "https://www.genliferegenerativemedicine.com/age-health/andropause-male-menopause/", 
    "contents": "Andropause, also known as male androgen deficiency syndrome, is the male \nequivalent of female menopause. It results from diminished levels of testosterone\n ..."
  }, 
  {
    "id": "http://www.medic8.com/healthguide/articles/malemenopause.html", 
    "contents": "There is controversy over whether male menopause exists. This article examines \nthe evidence for testosterone replacement therapy and when it may be ..."
  }, 
  {
    "id": "https://www.bbc.com/news/10338355", 
    "contents": "Jun 17, 2010 ... The male menopause does exist - but it is rare, researchers have concluded."
  }, 
  {
    "id": "https://www.realclearscience.com/blog/2015/03/its_time_to_talk_about_male_menopause.html", 
    "contents": "Mar 26, 2015 ... Do women have a monopoly on menopause? Well, depends who you ask. \nPurveyors of testosterone supplements would likely say."
  }, 
  {
    "id": "http://www.bartonhealth.org/tahoe/health-library/male-menopause-885.aspx%3Fiid%3D1_2777", 
    "contents": "Male menopause is an informal term used for a condition caused when \ntestosterone levels decrease in aging men. Experts disagree on how widespread \nthe ..."
  }
]