[
  {
    "id": "https://en.wikipedia.org/wiki/Carpal_tunnel_syndrome", 
    "contents": ""
  }, 
  {
    "id": "https://orthoinfo.aaos.org/en/diseases--conditions/carpal-tunnel-syndrome/", 
    "contents": "Carpal tunnel syndrome is a common condition that causes pain, numbness, and tingling in the hand and arm. The condition occurs when one of the major nerves to the hand — the median nerve — is squeezed or compressed as it travels through the wrist."
  }, 
  {
    "id": "https://www.webmd.com/pain-management/carpal-tunnel/carpal-tunnel-syndrome", 
    "contents": "Oct 11, 2017 ... Articles OnCarpal Tunnel Syndrome - Carpal Tunnel Syndrome.\n ... If you’re feeling numbness, tingling, or weakness in your hand, consider asking your doctor to check you for carpal tunnel syndrome.\n It's caused by pressure on your median nerve, which runs the length of the arm, goes ..."
  }, 
  {
    "id": "https://www.mayoclinic.org/diseases-conditions/carpal-tunnel-syndrome/symptoms-causes/syc-20355603", 
    "contents": "Mar 30, 2017 ... Carpal tunnel syndrome is a condition that causes numbness, tingling and other symptoms in the hand and arm. Carpal tunnel syndrome is caused by a compressed nerve in the carpal tunnel, a narrow passageway on the palm side of your wrist."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Carpal_tunnel_syndrome", 
    "contents": "Carpal tunnel syndrome (CTS) is a medical condition due to compression of the median nerve as it travels through the wrist at the carpal tunnel. The main symptoms are pain, numbness, and tingling, in the thumb, index finger, middle finger, and the thumb side of the ring fingers."
  }, 
  {
    "id": "https://www.medicinenet.com/carpal_tunnel_syndrome/article.htm", 
    "contents": "Learn about carpal tunnel syndrome symptoms (numbness in fingers, toes), \ncauses (pregnancy, diabetes, repetitive motions), treatment, prevention, and ..."
  }, 
  {
    "id": "https://medlineplus.gov/carpaltunnelsyndrome.html", 
    "contents": "Apr 6, 2018 ... Is the numbness and pain in your arm and wrist a passing cramp or carpal tunnel \nsyndrome? Learn about carpal tunnel syndrome symptoms ..."
  }, 
  {
    "id": "https://www.ninds.nih.gov/Disorders/Patient-Caregiver-Education/Fact-Sheets/Carpal-Tunnel-Syndrome-Fact-Sheet", 
    "contents": "May 10, 2017 ... A person with carpal tunnel syndrome may wake up feeling the need to \"shake \nout\" the hand or wrist. As symptoms worsen, people might feel ..."
  }, 
  {
    "id": "http://www.assh.org/handcare/hand-arm-conditions/carpal-tunnel/", 
    "contents": "Carpal tunnel syndrome is a condition brought on by increased pressure on the \nmedian nerve at the wrist. Symptoms may include numbness, tingling, and pain ..."
  }, 
  {
    "id": "https://www.emedicinehealth.com/carpal_tunnel_syndrome/article_em.htm", 
    "contents": "Carpal tunnel syndrome is a disease of the hand characterized by numbness, \ntingling, pain, and weakness. Read about causes, symptoms, treatment, and ..."
  }, 
  {
    "id": "https://www.medicalnewstoday.com/articles/184337.php", 
    "contents": "Jan 22, 2018 ... Carpal tunnel syndrome causes tingling, burning, itching, or numbness in the \nhand, when the median nerve of the wrist becomes compressed."
  }, 
  {
    "id": "https://www.ccohs.ca/oshanswers/diseases/carpal.html", 
    "contents": "Carpal Tunnel Syndrome is a condition affecting the hand and wrist. The carpal \ntunnel is a space in the wrist surrounded by wrist bones and by a rigid ligament ..."
  }, 
  {
    "id": "https://familydoctor.org/condition/carpal-tunnel-syndrome/", 
    "contents": "May 19, 2017 ... Carpal tunnel syndrome is a painful disorder of the wrist and hand. It can be \ntreated and should leave no lasting damage."
  }, 
  {
    "id": "https://www.rheumatology.org/I-Am-A/Patient-Caregiver/Diseases-Conditions/Carpal-Tunnel-Syndrome", 
    "contents": "Information on carpal tunnel syndrome: what it is, common signs and symptoms, \ngetting diagnosed, treatment options and other conditions with similar ..."
  }, 
  {
    "id": "https://my.clevelandclinic.org/health/diseases/4005-carpal-tunnel-syndrome", 
    "contents": "The repetitive motion condition, carpal tunnel syndrome, is one of the most \ncommon problems affecting the hands. Symptoms include numbness and tingling \nin ..."
  }, 
  {
    "id": "https://emedicine.medscape.com/article/327330-overview", 
    "contents": "Feb 27, 2018 ... Carpal tunnel syndrome (CTS) is a collection of characteristic symptoms and \nsigns that occurs following compression of the median nerve ..."
  }, 
  {
    "id": "http://www.aans.org/Patients/Neurosurgical-Conditions-and-Treatments/Carpal-Tunnel-Syndrome", 
    "contents": "Carpal Tunnel Syndrome (CTS) is a common problem affecting hand function, \ncaused by compression of the median nerve at the wrist. It most often occurs \nwhen ..."
  }, 
  {
    "id": "https://www.healthline.com/health/carpal-tunnel-syndrome", 
    "contents": "Mar 16, 2017 ... Carpal tunnel syndrome is the compression of the median nerve as it passes into \nthe hand. The median nerve is located on the palm side of ..."
  }, 
  {
    "id": "https://www.hopkinsmedicine.org/neurology_neurosurgery/centers_clinics/peripheral_nerve_surgery/conditions/carpal-tunnel-syndrome.html", 
    "contents": "Carpal tunnel syndrome is a painful disorder caused by pressure on the median \nnerve in the carpal tunnel in the hand. When the tunnel surrounding the tissues ..."
  }, 
  {
    "id": "https://kidshealth.org/en/kids/carpal.html", 
    "contents": "Carpal tunnel syndrome can make your hands feel numb and tingly. Find out \nmore in this article for kids."
  }, 
  {
    "id": "http://www.arthritis.org/about-arthritis/types/carpal-tunnel-syndrome/", 
    "contents": "Carpal tunnel syndrome affects the arms, wrists and hands. It occurs when the \nnerve that goes from the forearm to the palm of the hand (carpal tunnel) is ..."
  }, 
  {
    "id": "https://www.womenshealth.gov/a-z-topics/carpal-tunnel-syndrome", 
    "contents": "Mar 14, 2018 ... Carpal tunnel syndrome (CTS) is the name for a group of problems that includes \nswelling, pain, tingling, and loss of strength in your wrist and ..."
  }, 
  {
    "id": "https://www.youtube.com/watch%3Fv%3Dz-SeJh5-nOo", 
    "contents": "Apr 10, 2015 - 3 min - Uploaded by Nucleus Medical MediaVisit our website to learn about using Nucleus animations for patient engagement  and content ..."
  }, 
  {
    "id": "https://www.physio-pedia.com/Carpal_Tunnel_Syndrome", 
    "contents": "Carpal tunnel syndrome (CTS) is the most common peripheral nerve entrapment \nword wide. The general trend for this condition is progressive worsening, ..."
  }, 
  {
    "id": "https://boingboing.net/2018/06/25/managing-carpal-tunnel-syndrom.html", 
    "contents": "22 hours ago ... Decades of working on the computer, video games, and riding a motorcycle have \nleft my hands in pretty bad shape. I still like doing all of those ..."
  }, 
  {
    "id": "https://www.livescience.com/34703-carpal-tunnel-syndrome.html", 
    "contents": "Jun 6, 2018 ... Carpal tunnel syndrome is a nerve-related condition that causes pain and \nnumbness in the wrists and hands."
  }, 
  {
    "id": "http://www.aanem.org/Patients/Disorders/Carpal-Tunnel-Syndrome", 
    "contents": "What is Carpal Tunnel Syndrome? The carpal tunnel is a small tunnel made of \nbones and ligaments in the wrist. The median nerve runs down the forearm ..."
  }, 
  {
    "id": "https://www.orthobullets.com/hand/6018/carpal-tunnel-syndrome", 
    "contents": "the most specific test (76%) for carpal tunnel syndrome. Physical exam. \ninspection may show thenar atrophy; carpal tunnel compression test (Durkan's \ntest)."
  }, 
  {
    "id": "https://jamanetwork.com/journals/jama/fullarticle/1104666", 
    "contents": "Carpal tunnel syndrome, a painful condition of the hands, affects millions of \nindividuals around the world. Numbness, tingling, weakness, and pain are \ncaused ..."
  }, 
  {
    "id": "https://www.uofmhealth.org/health-library/hw212331", 
    "contents": "This test is used when severe carpal tunnel syndrome is suspected. It is not very \naccurate for mild carpal tunnel syndrome. To do the test, your doctor has you ..."
  }, 
  {
    "id": "https://www.babycentre.co.uk/a549291/carpal-tunnel-syndrome-in-pregnancy-natural-remedies", 
    "contents": "Carpal tunnel syndrome is common in pregnancy. Find out how natural remedies \ncan help ease your symptoms. - BabyCentre UK."
  }, 
  {
    "id": "http://tria.com/condition/carpal-tunnel-syndrome/", 
    "contents": "Carpal Tunnel Syndrome is a nerve compression syndrome caused by increased \npressure to the median nerve at the wrist."
  }, 
  {
    "id": "https://www.millburnsurgicalcenter.com/conditions/carpal-tunnel-syndrome.html", 
    "contents": "Carpal tunnel syndrome starts gradually with a slight aching in the wrist that can \nextend to the hand and forearm. Other symptoms include tingling or numbness ..."
  }, 
  {
    "id": "https://www.mountainstateorthopedic.com/carpal-tunnel", 
    "contents": "Pain and numbness in the hands are common symptoms of carpal tunnel \nsyndrome. Our orthopedics can help correct the pain with a simple outpatient ..."
  }, 
  {
    "id": "https://www.medstargeorgetown.org/our-services/orthopaedics/conditions/hand-and-wrist-conditions/carpal-tunnel/", 
    "contents": "Carpal tunnel syndrome is a type of hand nerve entrapment that occurs when \nswelling in the tunnel compresses the median nerve."
  }, 
  {
    "id": "https://kidkoala.bandcamp.com/album/carpal-tunnel-syndrome", 
    "contents": "Carpal Tunnel Syndrome by Kid Koala, released 02 January 2000 1. Strut Hear 2\n. Nerdball 3. Fender Bender 4. Drunk Trumpet 5. Roboshuffle 6. Barhopper 1 7."
  }, 
  {
    "id": "https://www.uptodate.com/contents/carpal-tunnel-syndrome-clinical-manifestations-and-diagnosis", 
    "contents": "Apr 25, 2018 ... Carpal tunnel syndrome (CTS) refers to the complex of symptoms and signs \nbrought on by compression of the median nerve as it travels ..."
  }, 
  {
    "id": "https://www.disabilitysecrets.com/social-security-disability-carpal-tunnel-syndrome.html", 
    "contents": "Find out if you are eligible to recieve Social Security Disability benefits based on \ncarpal tunnel syndrome."
  }, 
  {
    "id": "https://www.merckmanuals.com/home/bone,-joint,-and-muscle-disorders/hand-disorders/carpal-tunnel-syndrome", 
    "contents": "Carpal Tunnel Syndrome - Learn about the causes, symptoms, diagnosis & \ntreatment from the Merck Manuals - Medical Consumer Version."
  }, 
  {
    "id": "https://www.spine-health.com/conditions/neck-pain/carpal-tunnel-syndrome-vs-cervical-radiculopathy", 
    "contents": "Carpal tunnel syndrome results in numbness and weakness in the hand and \nwrist. Read more about the symptoms, causes, and treatment of carpal tunnel."
  }, 
  {
    "id": "http://www.orthop.washington.edu/%3Fq%3Dpatient-care/articles/arthritis/carpal-tunnel-syndrome.html", 
    "contents": "Carpal tunnel syndrome (CTS) is a condition that can cause pain, tingling, \nnumbness, and weakness in the fingers and thumb. Specifically, carpal tunnel ..."
  }, 
  {
    "id": "https://www.mvhsc.com/conditions/carpal-tunnel-syndrome.html", 
    "contents": "Warning Signs & Symptoms. Carpal tunnel syndrome starts gradually with a \nslight aching in the wrist that can extend to the hand and forearm. Other \nsymptoms ..."
  }, 
  {
    "id": "https://www.medstarunionortho.org/conditions/hand-wrist/carpal-tunnel-syndrome/", 
    "contents": "The carpal tunnel is a space in the wrist where a nerve and nine tendons pass \nfrom the forearm into the hand. Carpal tunnel syndrome occurs when swelling in\n ..."
  }, 
  {
    "id": "https://www.omim.org/entry/115430", 
    "contents": "A number sign (#) is used with this entry because at least some cases of carpal \ntunnel syndrome are caused by heterozygous mutation in the TTR gene, ..."
  }, 
  {
    "id": "http://www.lifeextension.com/Protocols/Neurological/Carpal-Tunnel-Syndrome/Page-01", 
    "contents": "Carpal tunnel syndrome is a relatively common disorder characterized by pain, \ntingling, numbness, or changes in sensation in the hands, wrists, or fingers."
  }, 
  {
    "id": "https://www.drjohnbergman.com/disease/carpal-tunnel-syndrome/", 
    "contents": "Carpal tunnel syndrome is known as a “double crush” injury because the affected \nnerve is being compressed in 2 separate places. One aspect of the nerve is ..."
  }, 
  {
    "id": "https://www.cedars-sinai.edu/Patients/Health-Conditions/Carpal-Tunnel-Syndrome.aspx", 
    "contents": "Carpal tunnel syndrome develops when the pressure causes a tingling sensation \nin the hand, often accompanied by numbness, aching and impaired hand ..."
  }, 
  {
    "id": "https://www.self.com/story/carpal-tunnel-syndrome-facts", 
    "contents": "Dec 2, 2017 ... No, you don't have to stop typing forever to relieve carpal tunnel syndrome. \nHere's what doctors want you to know about carpal tunnel ..."
  }, 
  {
    "id": "http://www.dictionary.com/browse/carpal-tunnel-syndrome", 
    "contents": "Carpal tunnel syndrome definition, a common disorder of the wrist and hand \ncharacterized by pain, tingling, and muscular weakness, caused by pressure on \nthe ..."
  }, 
  {
    "id": "https://www.seattletimes.com/life/wellness/natural-anti-inflammatory-relief-for-carpal-tunnel-syndrome/", 
    "contents": "Apr 15, 2018 ... Q: I believe my friend has carpal-tunnel syndrome from doing repetitive work at \nhis job. Is there anything he can take for it that's a natural ..."
  }, 
  {
    "id": "https://www.spinemd.com/symptoms-conditions/carpal-tunnel-syndrome", 
    "contents": "Carpal tunnel syndrome is a condition caused by compression of the median \nnerve at the wrist. Within the wrist is a space called the carpal tunnel. Nine \ntendons ..."
  }, 
  {
    "id": "https://www.spinemd.com/symptoms-conditions/carpal-tunnel-syndrome", 
    "contents": "Carpal tunnel syndrome is a condition caused by compression of the median \nnerve at the wrist. Within the wrist is a space called the carpal tunnel. Nine \ntendons ..."
  }, 
  {
    "id": "https://wexnermedical.osu.edu/arthritis-rheumatology/carpal-tunnel-syndrome", 
    "contents": "Early diagnosis and treatment are important to prevent permanent nerve damage\n. Your doctor diagnoses carpal tunnel syndrome with a physical exam and ..."
  }, 
  {
    "id": "https://abcnews.go.com/News/carpal-tunnel-syndrome/story%3Fid%3D55095236", 
    "contents": "May 11, 2018 ... Boston Red Sox Pitcher David Price is ready to return to the field this week after \nbeing diagnosed with carpal tunnel syndrome, a condition ..."
  }, 
  {
    "id": "https://www.resurgens.com/carpal-tunnel-syndrome", 
    "contents": "Carpal tunnel syndrome happens when the area around the median nerve to \nyour hand is too tight. It may cause hand pain, numbness and tingling."
  }, 
  {
    "id": "https://www.sciencedirect.com/science/article/pii/S1297320314000298", 
    "contents": "Carpal tunnel syndrome is the commonest entrapment neuropathy and is due to \ncombined compression and traction on the median nerve at the wrist. It is often ..."
  }, 
  {
    "id": "https://www.yogajournal.com/poses/yoga-by-benefit/carpal-tunnel-syndrome", 
    "contents": "Learn about yoga poses that can help address both the symptoms and root \ncauses of carpal tunnel syndrome."
  }, 
  {
    "id": "https://www.houstonmethodist.org/orthopedics/where-does-it-hurt/hand/carpal-tunnel-syndrome/", 
    "contents": "Carpal tunnel syndrome is a common problem that affects the hand and wrist. \nDiscover more about median nerve compression at Houston Methodist."
  }, 
  {
    "id": "https://www.britannica.com/science/carpal-tunnel-syndrome", 
    "contents": "4 days ago ... Carpal tunnel syndrome (CTS), condition of numbness, tingling, or pain in the \nwrist caused by repetitive flexing or stressing of the fingers or ..."
  }, 
  {
    "id": "https://www.aafp.org/afp/2016/1215/p993.html", 
    "contents": "Dec 15, 2016 ... Carpal tunnel syndrome, the most common entrapment neuropathy of the upper \nextremity, is caused by compression of the median nerve as it ..."
  }, 
  {
    "id": "https://www.prevention.com/fitness/g20506238/5-stretches-that-can-ease-your-carpal-tunnel-pain/", 
    "contents": "Feb 16, 2017 ... These 5 stretches can ease your hand and wrist pain, whether it's caused by \ncarpal tunnel syndrome or simply too much time on a computer."
  }, 
  {
    "id": "https://www.urmc.rochester.edu/neurosurgery/for-patients/conditions/carpal-tunnel.aspx", 
    "contents": "Carpal tunnel syndrome is a condition in which the median nerve is compressed \nas it passes through an opening from the wrist to the hand called the carpal ..."
  }, 
  {
    "id": "https://www.activebeat.com/diet-nutrition/5-exercises-to-help-prevent-carpal-tunnel-syndrome/", 
    "contents": "Dec 19, 2012 ... Carpal tunnel syndrome usually manifests itself with a tingling sensation followed by shooting pain the hands and wrists.\n ... The good news is that with the following five wrist, hand, and shoulder exercises, you can break up the repetitive nature of your day and prevent carpal tunnel ..."
  }, 
  {
    "id": "https://www.arthritis-health.com/blog/your-hand-pain-caused-carpal-tunnel-syndrome", 
    "contents": "Let's say you wake up to find your hand numb and tingly. Did you sleep on it \nwrong? Is it your arthritis acting up? Or could it be carpal tunnel syndrome (CTS)?\n."
  }, 
  {
    "id": "http://www.eatonhand.com/hw/hw006.htm", 
    "contents": "Patient Information regarding Carpal Tunnel Syndrome."
  }, 
  {
    "id": "https://www.thejoint.com/texas/sugar-land/sugar-land-28035/your-chiropractor-can-help-with-carpal-tunnel-synd", 
    "contents": "Your Chiropractor Can Help with Carpal Tunnel Syndrome. I have worked with \npeople who have run into Carpal Tunnel Syndrome. At first they had burning and\n ..."
  }, 
  {
    "id": "https://www.pennmedicine.org/for-patients-and-visitors/patient-information/conditions-treated-a-to-z/carpal-tunnel-syndrome", 
    "contents": "Carpal tunnel syndrome occurs in the hand and arm and is a conditions that \ncauses numbness, tingling and other symptoms."
  }, 
  {
    "id": "https://www.sports-health.com/sports-injuries/hand-and-wrist-injuries/6-myths-and-truths-about-carpal-tunnel-syndrome", 
    "contents": "There are common misconceptions and misinformation about the causes and \ntreatment of carpal tunnel syndrome."
  }, 
  {
    "id": "https://www.sports-health.com/sports-injuries/hand-and-wrist-injuries/causes-and-risk-factors-carpal-tunnel-syndrome", 
    "contents": "Carpal tunnel syndrome is the most frequently occurring mononeuropathy (\ndisorder affecting a single nerve). This condition—which often causes pain and ..."
  }, 
  {
    "id": "http://www.chicagotribune.com/sports/baseball/ct-spt-david-price-carpal-tunnel-fortnite-20180510-story.html", 
    "contents": "May 10, 2018 ... Boston Red Sox left-hander David Price was diagnosed Wednesday with carpal \ntunnel syndrome after twice experiencing numbness in his ..."
  }, 
  {
    "id": "https://www.drweil.com/health-wellness/body-mind-spirit/bone-joint/carpal-tunnel-syndrome/", 
    "contents": "Dr. Weil offers expert advice and information about burns and the natural \ntreatment of carpal tunnel syndrome."
  }, 
  {
    "id": "https://nyulangone.org/conditions/carpal-tunnel-syndrome-in-adults", 
    "contents": "NYU Langone physicians and therapists work together to customize treatment for carpal tunnel syndrome, a condition that causes pain, weakness, or numbness in the hand and wrist.\n ... Damage to the median nerve can be prevented if carpal tunnel syndrome is diagnosed and treated early."
  }, 
  {
    "id": "http://www.sportsinjuryclinic.net/sport-injuries/wrist-pain/carpal-tunnel-syndrome", 
    "contents": "Carpal tunnel syndrome causes a dull ache in the wrist and forearm with pain \nwhich may radiate into the hand and fingers. It is often worse at night. We explain\n ..."
  }, 
  {
    "id": "https://www.verywellhealth.com/treating-carpal-tunnel-syndrome-2549307", 
    "contents": "May 7, 2018 ... Treatment for carpal tunnel syndrome usually begins with splinting. A cortisone \ninjection or carpal tunnel release surgery may be ..."
  }, 
  {
    "id": "http://carpaltunnel.com/", 
    "contents": "Carpal Tunnel Syndrome is caused due to compression of the median nerve in \nthe wrist. This nerve is present between the first three fingers and the thumb and\n ..."
  }, 
  {
    "id": "https://www.brownmed.com/blog/carpal-tunnel-syndrome/best-ways-to-ease-carpal-tunnel-syndrome-pain/", 
    "contents": "If you're dealing with carpal tunnel syndrome, here are a few ways to combat the \npain."
  }, 
  {
    "id": "https://www.rothmaninstitute.com/specialties/conditions/carpal-tunnel-syndrome", 
    "contents": "Carpal tunnel syndrome (CTS) is the condition that results from increased \npressure on one of the nerves in the wrist and hand. In patients with carpal tunnel\n ..."
  }, 
  {
    "id": "https://draxe.com/carpal-tunnel-syndrome-symptoms/", 
    "contents": "Aug 8, 2017 ... Carpal tunnel syndrome symptoms, including pain in the hands & wrists, affect \nabout 4 percent of the general population. Here are ways to ..."
  }, 
  {
    "id": "https://www.myvmc.com/diseases/carpal-tunnel-syndrome/", 
    "contents": "Carpal tunnel syndrome refers to compression of the median nerve. Carpal \ntunnel syptoms include pain, numbness and hand weakness. Treaments include\n ..."
  }, 
  {
    "id": "https://fpnotebook.com/ortho/wrist/CrplTnlSyndrm.htm", 
    "contents": "This page includes the following topics and synonyms: Carpal Tunnel Syndrome, \nMedian Neuropathy, Carpal Tunnel."
  }, 
  {
    "id": "http://time.com/4690200/acupuncture-carpal-tunnel-syndrome/", 
    "contents": "Mar 3, 2017 ... A new study finds that electro-acupuncture provides lasting relief for carpal tunnel \nsyndrome, and it also remaps circuits in the brain."
  }, 
  {
    "id": "http://www.espn.com/mlb/story/_/id/23453106/boston-red-sox-david-price-carpal-tunnel-syndrome", 
    "contents": "May 10, 2018 ... Red Sox pitcher David Price dealing with carpal tunnel syndrome.\n ... Boston Red Sox left-hander David Price has a mild case of carpal tunnel syndrome, but manager Alex Cora said he doesn't think video games brought on the issue.\n ... Carpal tunnel syndrome is an uncommon injury for baseball ..."
  }, 
  {
    "id": "https://www.mountsinai.org/health-library/report/carpal-tunnel-syndrome", 
    "contents": "Learn about Carpal tunnel syndrome or find a doctor at Mount Sinai Health \nSystem."
  }, 
  {
    "id": "https://www.cooperhealth.org/services/carpal-tunnel-syndrome", 
    "contents": "Carpal tunnel syndrome is when the median nerve is compressed as it passes \nthrough the carpal tunnel."
  }, 
  {
    "id": "https://nortonhealthcare.com/services-and-conditions/neurosciences/services/carpal-tunnel-syndrome", 
    "contents": "Carpal tunnel syndrome causes weakness, numbness, tingling and other \nsymptoms in the hand and arm. Several things can cause carpal tunnel \nsyndrome, ..."
  }, 
  {
    "id": "https://www.amazon.com/Treat-Your-Carpal-Tunnel-Syndrome/dp/1457525771", 
    "contents": "Suffering from carpal tunnel syndrome or don't want to get it? In less than 100 \npages, Treat Your Own Carpal Tunnel Syndrome offers a complete."
  }, 
  {
    "id": "http://www.dartmouth-hitchcock.org/carpal_tunnel.html", 
    "contents": "If you have numbness, tingling, weakness, aching, or shooting pain in your hands\n, it could be a sign that you have carpal tunnel syndrome. It is important to catch ..."
  }, 
  {
    "id": "https://www.lexingtonclinic.com/lcsportsmed/carpaltunnelsyndrome.html", 
    "contents": "Carpal tunnel syndrome refers to compression of the median nerve at the level of \nthe palm. It is caused by increased pressure within the carpal tunnel, which ..."
  }, 
  {
    "id": "https://www.orthopedicshoulder.com/services/hand/carpal-tunnel-syndrome/", 
    "contents": "Carpal Tunnel Surgery - Orthopedic & Shoulder Center, serving Normal, \nBloomington, Champagne, Carpal tunnel syndrome is a common condition that \ncauses ..."
  }, 
  {
    "id": "http://www.pinnacle-ortho.com/carpal-tunnel-syndrome", 
    "contents": "These symptoms may be all due to what's known as Carpal Tunnel Syndrome. \nThe carpal tunnel is an anatomical region in the wrist through which a major ..."
  }, 
  {
    "id": "https://www.umms.org/ummc/health-services/orthopedics/services/hand-wrist/services/carpal-tunnel-syndrome", 
    "contents": "Carpal tunnel syndrome is a common cause of finger numbness , tingling and \nhand pain."
  }, 
  {
    "id": "https://www.massgeneral.org/ortho-hand/conditions-treatments/carpal_tunnel.aspx", 
    "contents": "Carpal Tunnel Syndrome is a condition brought on by increased pressure on the median nerve at the wrist.\n ... Carpal Tunnel Syndrome (CTS) is a condition brought on by increased pressure on the median nerve at the wrist.\n ... Symptoms may include numbness, tingling, and pain in the arm, hand ..."
  }, 
  {
    "id": "https://www.good4utah.com/news/local-news/carpal-tunnel-syndrome-symptoms-causes-treatment-options/240733051", 
    "contents": "Carpal Tunnel Syndrome is a condition caused by the compression of the \nmedian nerve in your wrist. This nerve and several tendons run through a small \nspace ..."
  }, 
  {
    "id": "https://stanfordhealthcare.org/medical-conditions/bones-joints-and-muscles/carpal-tunnel-syndrome.html", 
    "contents": "Carpal tunnel syndrome is a condition in which the median nerve is compressed \nas it passes through the carpal tunnel in the wrist, a narrow confined space."
  }, 
  {
    "id": "http://www.fitzhand.com/carpal-tunnel/", 
    "contents": "Hand specialist Dr. Fitzmaurice provides patients with endoscopic carpal tunnel \nsyndrome treatment in Scottsdale. Learn more about nerve compression ..."
  }, 
  {
    "id": "http://www.kdrv.com/content/news/Dispelling-Myths-about-Carpal-Tunnel-Syndrome-480816071.html", 
    "contents": "Apr 25, 2018 ... Many of us worry that it might be the start of carpal tunnel syndrome, but doctors \nsay many common hand ailments are easily mistaken for ..."
  }, 
  {
    "id": "http://www.thelancet.com/journals/laneur/article/PIIS1474-4422(16)30231-9/fulltext", 
    "contents": "Carpal tunnel syndrome is the most common peripheral nerve entrapment \nsyndrome worldwide. The clinical symptoms and physical examination findings in\n ..."
  }, 
  {
    "id": "https://www.everydayhealth.com/news/best-foods-for-carpal-tunnel-syndrome/", 
    "contents": "If you are living with carpal tunnel syndrome, a condition marked by pain, \nnumbness, and inflammation in the wrists, fingers, palms of the hand, and even \nthe ..."
  }, 
  {
    "id": "https://www.bostonglobe.com/sports/redsox/2018/05/09/david-price-diagnosed-with-mild-carpal-tunnel-syndrome/6aDFQrncXULVwwFezIjLcJ/story.html", 
    "contents": "May 9, 2018 ... NEW YORK — David Price could make his next start as soon as Saturday in \nToronto after being diagnosed with a mild case of carpal tunnel ..."
  }, 
  {
    "id": "http://pmj.bmj.com/content/79/934/433", 
    "contents": "Carpal tunnel syndrome of mild to moderate severity can often be effectively \ntreated in a primary care environment. Workplace task modification and wrist \nsplints ..."
  }
]