[
  {
    "id": "https://www.visitphoenix.com/things-to-do/old-town-scottsdale/", 
    "contents": "Old Town—also known as Downtown—Scottsdale offers boutique shopping with \na Southwestern flair, a density of bars, lounges, restaurants and clubs, plus art ..."
  }, 
  {
    "id": "https://www.experiencescottsdale.com/old-town/", 
    "contents": "Discover the best restaurants, bars and things to do in the downtown & Old Town \nScottsdale areas."
  }, 
  {
    "id": "http://oldtownscottsdale.com/", 
    "contents": "Old Town Scottsdale and Scottsdale, AZ your local directory to plan for dining, \nthings to do, hotels and restaurants in Scottsdale to events. You can also find ..."
  }, 
  {
    "id": "https://www.tripadvisor.com/Attraction_Review-g31350-d505365-Reviews-Old_Town_Scottsdale-Scottsdale_Arizona.html", 
    "contents": "Ways to Experience Old Town Scottsdale. Segway Tour of Old Town Scottsdale. \n128 Reviews. from $58.99. More Info. Small-Group Tour: Deluxe Phoenix and."
  }, 
  {
    "id": "http://downtownscottsdale.com/", 
    "contents": "Old Town Scottsdale."
  }, 
  {
    "id": "https://www.10best.com/destinations/arizona/scottsdale/old-town/", 
    "contents": "Scottsdale is famous for sprawling, luxurious resorts, championship golf courses, \nand high-end boutiques, but the heart of the city is Old Town Scottsdale."
  }, 
  {
    "id": "https://www.10best.com/destinations/arizona/scottsdale/old-town/", 
    "contents": "A private investor in Scottsdale has purchased the Comfort Suites Old Town \nScottsdale, 3275 N. Drinkwater Blvd., for $7.25 million, according ..."
  }, 
  {
    "id": "https://www.yelp.com/biz/old-town-scottsdale-scottsdale", 
    "contents": "115 reviews of Old Town Scottsdale \"This is a great place for lots to do for \neveryone. Families can come for a nice afternoon meal, a nice stroll around the \npark or ..."
  }, 
  {
    "id": "https://www.scottsdaleaz.gov/old-town", 
    "contents": "Old Town Scottsdale - Scottsdale's downtown - is among the most vibrant and \nunique urban downtown centers in the American Southwest. Its pedestrian-\nfriendly ..."
  }, 
  {
    "id": "https://www.azcentral.com/story/news/local/scottsdale/2018/01/26/called-old-town-scottsdale-downtown-scottsdale-decision/1065895001/", 
    "contents": "Jan 26, 2018 ... It's part of Scottsdale that's a mix of popular nightclubs and quaint tourist shops, \nposh condos and art galleries. But is it Old Town or Downtown?"
  }, 
  {
    "id": "http://www.thescottresort.com/things-to-do-in-scottsdale/old-town-scottsdale/", 
    "contents": "Discover all of the amazing things to do in Old Town Scottsdale. Enjoy all of the \nattractions during your next getaway with The Scott Resort & Spa."
  }, 
  {
    "id": "https://www.zomato.com/scottsdale-az/old-town-scottsdale-restaurants", 
    "contents": "Restaurants in Old Town Scottsdale; Old Town Scottsdale, Scottsdale \nRestaurants - Menus, Reviews, Photos for Restaurants, Pubs, Lounges, and Bars \nin Old ..."
  }, 
  {
    "id": "https://www.marriott.com/hotels/travel/phxst-scottsdale-marriott-suites-old-town/", 
    "contents": "Discover Old Town Scottsdale at our dynamic hotel.\n ... Prepare for a refreshing stay at the Scottsdale Marriott Suites Old Town.\n Our distinctive hotel is located in the heart of downtown Scottsdale, Arizona, offering travelers an unbeatable vantage point from which to explore the city."
  }, 
  {
    "id": "https://www.marriott.com/hotels/travel/phxst-scottsdale-marriott-suites-old-town/", 
    "contents": ""
  }, 
  {
    "id": "http://hiltongardeninn3.hilton.com/en/hotels/arizona/hilton-garden-inn-scottsdale-old-town-SCTGIGI/index.html", 
    "contents": "Hilton Garden Inn Scottsdale Old Town offers complimentary WiFi, an on-site \nrestaurant, a fitness center, pool, indoor and outdoor event space, and a great ..."
  }, 
  {
    "id": "https://www.choicehotels.com/arizona/scottsdale/old-town-scottsdale-hotels", 
    "contents": "Looking for hotels near Old Town Scottsdale? Choice Hotels provide convenient \nand affordable options. Reserve your room today!"
  }, 
  {
    "id": "https://www.choicehotels.com/arizona/scottsdale/rodeway-inn-hotels/az437", 
    "contents": "The Rodeway Inn Old Town Scottsdale hotel in Scottsdale, AZ offers free \nbreakfast and free WiFi. Book now."
  }, 
  {
    "id": "https://scottsdalerealestate.com/your-guide-to-old-town-scottsdale/", 
    "contents": "Mar 25, 2016 ... Old Town is the heart of Scottsdale and home to some of the Valley's best \nrestaurants, shopping, and art galleries. Here's a quick guide to what ..."
  }, 
  {
    "id": "https://www.trivago.com/scottsdale-34265/city-districts/old-town-scottsdale-2038695", 
    "contents": "Hotels in Scottsdale near Old Town Scottsdale. Visit trivago, compare over 200+ \nbooking sites and find your ideal hotel near Old Town Scottsdale ✅ Save up to ..."
  }, 
  {
    "id": "https://www.opentable.com/n/phoenix/scottsdale/old-town-scottsdale-restaurants", 
    "contents": "Find Old Town Scottsdale restaurants in the Scottsdale area and other \nneighborhoods such as North Scottsdale, Central Scottsdale, Cave Creek, and \nmore."
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/List_of_historic_properties_in_Scottsdale,_Arizona", 
    "contents": "Old Town Scottsdale is located on the original townsite of Scottsdale. The \nfollowing is a brief description of the historic ..."
  }, 
  {
    "id": "https://nextdoor.com/neighborhood/historicoldtownscottsdale--scottsdale--az/", 
    "contents": "Historic Old Town Scottsdale's 2017 Neighborhood Favorites ... Historic Old \nTown Scottsdale neighbors selected these businesses as their Neighborhood ..."
  }, 
  {
    "id": "https://www.expedia.com/Phoenix-Hotels-Fairways-Old-Town-Scottsdale.h23207096.Hotel-Information", 
    "contents": "Book the Fairways Old Town Scottsdale - Situated in Scottsdale, this apartment \nbuilding is 0.4 mi (0.6 km) from Scottsdale Fashion Square and 3 mi (4.9 km) ..."
  }, 
  {
    "id": "https://www.segwayofscottsdale.com/old-town-scottsdale.html", 
    "contents": "Segway of Scottsdale is the original company. Our Old Town Scottsdale Segway \nTours start at $25 and have the best reviews."
  }, 
  {
    "id": "http://www.arizonafarmersmarkets.com/pageScottsdaleOldtown/ScottsdaleOTsat.htm", 
    "contents": "Located in Old Town Scottsdale on Brown Rd. and 1st. St. in the City parking lot \nthis farmers market features farm fresh local produce and food products."
  }, 
  {
    "id": "http://www.theglenatoldtown.com/", 
    "contents": "Apartment living just got better! The Glen at Old Town offers the best location and \nthriving community in Old Scottsdale, Arizona. Check what's available today!"
  }, 
  {
    "id": "http://www.maac.com/arizona/phoenix/colonial-grand-at-old-town-scottsdale", 
    "contents": "Results 1 - 15 of 45 ... Find your new home in Colonial Grand at Old Town Scottsdale, an apartment \ncommunity in Phoenix, Arizona managed by MAA."
  }, 
  {
    "id": "https://thefoundryyoga.com/schedule-old-town-scottsdale/", 
    "contents": "3:00 PM - 3:45 PM, Sign Up 37 of 40 open, Hot HIIT, Joanne Cook, Old Town \nScottsdale ... 3:00 PM - 4:00 PM, Hot Pilates, Jessica Pate, Old Town Scottsdale."
  }, 
  {
    "id": "https://www.scottsdaleindependent.com/opinions/beckerman-the-internet-makes-old-town-scottsdale-new-again/", 
    "contents": "1 day ago ... Old” and “internet” don't always go together. But in Old Town Scottsdale, they do."
  }, 
  {
    "id": "http://www.phoenixnewtimes.com/arts/scottsdale-downtown-rebrand-10077036", 
    "contents": "Feb 6, 2018 ... Scottsdale is rebranding its downtown area as \"Old Town.\" Which, um, isn't \nexactly rebranding."
  }, 
  {
    "id": "https://www.apartments.com/colonial-grand-at-old-town-scottsdale-scottsdale-az/d5rjphj/", 
    "contents": "See all available apartments for rent at Colonial Grand at Old Town Scottsdale in \nScottsdale, AZ. Colonial Grand at Old Town Scottsdale has rental units ranging ..."
  }, 
  {
    "id": "http://oreganos.com/locations/old-town-scottsdale/", 
    "contents": "Located just north of Thomas on Scottsdale Road, this joint is ready to serve tasty \nChicago pizzas and Italian dishes. Our recipes are a mix of old family classics ..."
  }, 
  {
    "id": "http://www.brathausaz.com/", 
    "contents": "Nestled in the heart of Old Town Scottsdale, Brat Haus features Arizona's most \nwelcoming beer garden with 28 craft beers on tap. The menu features made from\n ..."
  }, 
  {
    "id": "https://bookmyvacay.com/old-town-scottsdale-vacation-rentals", 
    "contents": "If you're visiting Scottsdale—or even if you live there—you must check out Old \nTown. A part of Downtown Scottsdale, it's historic, affluent, scenic, and overall a ..."
  }, 
  {
    "id": "http://fast-training.com/location-finder/old-town-scottsdale", 
    "contents": "Our Old Town Scottsdale FAST location offers functional training with dynamic \nprogramming to help athletes and gym-goers of all levels reach their goals ..."
  }, 
  {
    "id": "https://www.booking.com/hotel/us/rodeway-inn-scottsdale.html", 
    "contents": "Located in Scottsdale, Rodeway Inn Old Town Scottsdale is 2 miles from Desert \nBotanical Gardens."
  }, 
  {
    "id": "http://www.thingstodoinphoenixwithkids.com/old-town-scottsdale-with-kids/", 
    "contents": "Mar 5, 2018 ... We recently spent a full day in Old Town Scottsdale! Scottsdale is our hometown \nand the Old Town area is one of our favorites to wander as ..."
  }, 
  {
    "id": "https://www.facebook.com/Old.Town.Scottsdale/", 
    "contents": "When I first moved to Scottsdale in 2002 I practically lived in Old Town. I love the \nshops, restaurants, & scenery. I still go down there from time to time. If you're a ..."
  }, 
  {
    "id": "https://arizonafoodtours.com/", 
    "contents": "Whether strolling Phoenix area's historic Old Town Scottsdale, or downtown \nTempe's vibrant college town atmosphere, Arizona Food Tours is led by true local\n ..."
  }, 
  {
    "id": "https://rnrscottsdale.com/", 
    "contents": "Located in the heart of Old Town Scottsdale, RnR Gastropub provide the only two\n-story dining patio overlooking the vibrancy of Scottsdale Road."
  }, 
  {
    "id": "https://www.destinationhotels.com/scottsdale-resort/scottsdale-resort-blog/exploring-old-town-scottsdale", 
    "contents": "Old Town is the hub of Scottsdale's arts scene, and it's evident through the many \ngalleries scattered throughout the district. The Marshall Way Arts District comes ..."
  }, 
  {
    "id": "https://www.denimscottsdale.com/", 
    "contents": "This newly redesigned community Is the perfect offering of style and \nsophistication. Find yourself just minutes from the Old Town Scottsdale scene \nwhile still ..."
  }, 
  {
    "id": "https://www.12news.com/article/news/local/valley/police-looking-for-suspect-after-scottsdale-double-shooting/75-560737732", 
    "contents": "Jun 1, 2018 ... SCOTTSDALE, Ariz. - Police are investigating a shooting in the area of 75th \nStreet near Main. Police said a woman was found outside the Civic ..."
  }, 
  {
    "id": "https://www.grubhub.com/delivery/az-scottsdale-old_town_scottsdale", 
    "contents": "Hi Old Town Scottsdale—what are you hungry for? Order pickup or delivery \nonline from Scottsdale, AZ restaurants with just a few clicks and satisfy your \nappetite ..."
  }, 
  {
    "id": "https://www.oldtownink.com/", 
    "contents": "Old Town Ink. Home · Home. Artist. Bubba Irwin · Matthew Stella · Glen Coit · Billy \nHermann · Andrew Morales · Jacob Husul · Dj Tambe. Book Appointment."
  }, 
  {
    "id": "https://www.abc15.com/news/region-northeast-valley/scottsdale/woman-found-dead-in-old-town-scottsdale-alley-police-investigating", 
    "contents": "Feb 9, 2018 ... Police are investigating a woman's death as suspicious after she was found dead \nin Old Town Scottsdale Monday morning."
  }, 
  {
    "id": "https://old-town-scottsdale.orangetheoryfitness.com/", 
    "contents": "Orangetheory Fitness is the leading fitness studio in Scottsdale AZ. Visit our local \nhealth studio at the Old Town location."
  }, 
  {
    "id": "https://www.zagat.com/search%3Flocation_term%3DDowntown%252FOld%2BTown%2BScottsdale,%2BScottsdale,%2BArizona", 
    "contents": "Experience the best of Downtown/Old Town Scottsdale, Scottsdale, Arizona with \nthe help of Zagat. We've reviewed the top places to help you find the perfect ..."
  }, 
  {
    "id": "https://www.indeed.com/q-Scottsdale-Old-Town-jobs.html", 
    "contents": "96 Scottsdale Old Town jobs available on Indeed.com. Apply to Account \nManager, Client Advisor, Human Resources Specialist, Front Desk Manager, Tax\n ..."
  }, 
  {
    "id": "http://foothillsrehab.com/location-finder/old-town-scottsdale/", 
    "contents": "The passionate team of front office staff and physical therapists at our Old Town \nScottsdale clinic are committed to delivering quality, personalized care to all ..."
  }, 
  {
    "id": "http://www.kay-grant.com/old-town-scottsdale-condos/", 
    "contents": "New construction luxury condos such as Envy are also being built adding to the \nupscale condo living options in Old Town. These luxury Old Town Scottsdale ..."
  }, 
  {
    "id": "https://www.bourbonandbonesaz.com/", 
    "contents": "A modern, upscale steakhouse in Scottsdale. Serving wet aged & dry-aged \nsteaks, and classic handcrafted cocktails with a modern twist. Book a table now!"
  }, 
  {
    "id": "http://www.sugarmewax.com/old-town-scottsdale/", 
    "contents": "Scottsdale Brazilian Wax & Sugar Salon.\n ... Layne co-founded Sugar Me Wax in 2015 and she has been working with clients to maximize their health and beauty ever since.\n ... I was a client of Layne's at Sugar Me Wax for a year before joining the Sugar Me Wax family as an aesthetician."
  }, 
  {
    "id": "https://dentistryofoldtownscottsdale.com/our-dental-health-professionals/", 
    "contents": "The Dentistry of Old Town Scottsdale team is prepared to beautify your smile, \nwith over 60 years of experience in the dental field. Our team of dedicated dental\n ..."
  }, 
  {
    "id": "http://majerles.com/old-town-scottsdale/", 
    "contents": "This Month at Majerle's Old Town Scottsdale: Majerle's Sports Grill in. Old Town \nScottsdale. 4425 N. Saddlebag Trail Scottsdale, Arizona 85251 Phone: (480) ..."
  }, 
  {
    "id": "https://www.kgun9.com/news/local-news/2-women-shot-in-old-town-scottsdale-business", 
    "contents": "Jun 1, 2018 ... Police say two women were gunned down at a downtown Scottsdale business on \nFriday afternoon."
  }, 
  {
    "id": "https://www.eventbrite.com/e/the-90s-crawl-90s-themed-bar-crawl-in-old-town-scottsdale-tickets-44152658791", 
    "contents": "Apr 14, 2018 ... Eventbrite - The 90's Crawl - 90's Themed Bar Crawl in Old Town, Scottsdale! - \nSaturday, April 14, 2018 at Old Town's BEST Bars (Full List in ..."
  }, 
  {
    "id": "https://www.alphagraphics.com/centers/scottsdale-arizona-us039.html", 
    "contents": "AlphaGraphics in Scottsdale, AZ is the place for all your printing and marketing \nneeds. Call our center today to learn more or start your next project."
  }, 
  {
    "id": "http://www.hiescottsdalehotel.com/", 
    "contents": "Holiday Inn Express Scottsdale Old Town hotel is an all-suite hotel locatenear \nSky Harbor International Airport."
  }, 
  {
    "id": "https://www.groupon.com/local/scottsdale/old-town-scottsdale", 
    "contents": "Find great local, shopping and travel deals at 50 to 90% off in Old Town \nScottsdale. $5 Movie Tickets at Studio Movie Grill (50% Off). 20% Cash Back at \nAuntie ..."
  }, 
  {
    "id": "http://www.tenpoint5.com/old-town-scottsdale/", 
    "contents": "Thu June 21, 2018, Class, Instructor, Location. 9:00 AM - 9:45 AM, Sign Up, Mini \nBarre, Sarah Carlstrom (sub for Barretenders Rotation), Old Town. 12:00 PM ..."
  }, 
  {
    "id": "https://rustyspursaloon.com/", 
    "contents": "The Rusty Spur Saloon is a Scottsdale destination. Celebrities like Clint ... It's \nlocated right on Main Street in Old Town Scottsdale. Look for the cowpoke in the\n ..."
  }, 
  {
    "id": "https://www.livethepalladiumway.com/", 
    "contents": "Scottsdale Apartments are at its finest in The Palladium of Scottsdale offering Full \nScale Amenities in all Apartments For Rent. Visit our Old Town Scottsdale ..."
  }, 
  {
    "id": "http://oldtowntortillafactory.com/", 
    "contents": "Old Town Tortilla Factory - Come on in! Old Town Tortilla Factory - Our outdoor \npatio Old Town Tortilla Factory - Got Tequila? Old Town Tortilla Factory - Private ..."
  }, 
  {
    "id": "https://www.hoteladeline.com/", 
    "contents": "Meet Hotel Adeline, a new boutique hotel in Downtown Scottsdale, Arizona. The \nproperty infuses an eclectic style and energy all within Old Town Scottsdale, AZ."
  }, 
  {
    "id": "https://www.lonelyplanet.com/usa/greater-phoenix/attractions/old-town-scottsdale/a/poi-sig/1346478/362146", 
    "contents": "Tucked among Scottsdale's malls and bistros is its Old Town, a Wild West–\nthemed enclave filled with cutesy buildings, covered sidewalks and stores \nhawking ..."
  }, 
  {
    "id": "http://www.grapevineaz.com/", 
    "contents": "Our Old Town Scottsdale patio bar upstairs serves up the tastiest bar fare and \nMediterranean inspired entrees. Check out our menu to see all of your tasty ..."
  }, 
  {
    "id": "https://www.grimaldispizzeria.com/locations/old-town/", 
    "contents": "Built in 2003, our Grimaldi's in Old Town Scottsdale was the first Grimaldi's \nPizzeria in Arizona. Our restaurant offers you multiple ways to dine with us \ndepending ..."
  }, 
  {
    "id": "https://www.evoscottsdale.com/", 
    "contents": "EVO is a locally-owned and operated restaurant, in the heart of Old Town \nScottsdale. Serving dinner from 4 p.m. to 2 a.m. daily, EVO is a neighborhood ..."
  }, 
  {
    "id": "https://www.secondstoryaz.com/", 
    "contents": "Second Story is a restaurant and cocktail bar in Old Town Scottsdale soaked with \nover 300 whiskeys, craft cocktails and small plates & chef's signature dishes."
  }, 
  {
    "id": "https://www.cornerstoneonline.com/scottsdale/", 
    "contents": "May 7, 2018 ... We are excited to have you join us at our Old Town Scottsdale campus! We have \nGuest Service volunteers ready to help you navigate the ..."
  }, 
  {
    "id": "https://tasteittours.com/tour/old-town-scottsdale-wine-tour/", 
    "contents": "Old Town Scottsdale has plenty of options for you to enjoy a delicious glass of Arizona-produced wine.\n Use the map below for a self-guided tour of Scottsdale’s tasting rooms.\n The wine icon indicates tasting rooms, while the fork and knife icon indicates wine bars that also serve ..."
  }, 
  {
    "id": "https://themintaz.com/", 
    "contents": "The Mint boasts the largest patio in Old Town Scottsdale; 4,500 square feet \ndedicated to al fresco drinking and mingling, resort-style cabanas, in addition to ..."
  }, 
  {
    "id": "https://www.petsmart.com/store-locator/store/%3FstoreID%3D1864", 
    "contents": "PetSmart in Scottsdale, AZ - Scottsdale (Old Town) #1864 is conveniently located \nat 4380 N. Miller Road Scottsdale, AZ 85251. The stores phone number is ..."
  }, 
  {
    "id": "https://www.hotelvalleyho.com/hotel/around-hotel", 
    "contents": "Perfectly situated in Downtown Scottsdale, Hotel Valley Ho is steps away from a \nmix of vibrant culture, inventive dining and trendy nightlife."
  }, 
  {
    "id": "https://www.kayak.com/Scottsdale-Hotels-Howard-Johnson-Scottsdale-Old-Town.433785.ksp", 
    "contents": "Compare prices and find the best deal for the Howard Johnson Scottsdale Old \nTown. Rates from $76. Save up to 25% on Hotels with KAYAK now!"
  }, 
  {
    "id": "http://cnnmortgage.com/old-town-scottsdale/", 
    "contents": "Feel free to call us to learn more about our loan programs. You can also fill out \nour form to the right and a representative will contact you shortly. We respect your\n ..."
  }, 
  {
    "id": "https://www.doordash.com/food-delivery/scottsdale-az-restaurants/local/old-town-scottsdale/", 
    "contents": "Best Old Town Scottsdale, Scottsdale restaurants now deliver. Get breakfast, \nlunch, dinner and more delivered from your favorite restaurants right to your ..."
  }, 
  {
    "id": "https://www.holidayrental.com/vacation-rental/usa/arizona/phoenix/old-town-scottsdale-chateau/", 
    "contents": "NEW!! Just added! An incredible gated 1 acre estate in the heart of Arcadia! \nWalking distance to Old Town Scottsdale! Traditional Southern Charm describes \nthis ..."
  }, 
  {
    "id": "https://order.capriottis.com/menu/capriottis-old-town-scottsdale", 
    "contents": "Order Online at Capriotti's AZ104 Scottsdale Road - Old Town Scottsdale, \nScottsdale. Pay Ahead and Skip the Line."
  }, 
  {
    "id": "https://www.mapquest.com/us/arizona/old-town-scottsdale-375252579", 
    "contents": "Get directions, reviews and information for Old Town Scottsdale in Scottsdale, AZ."
  }, 
  {
    "id": "http://boondocksaz.com/", 
    "contents": "Boondocks Bar & Grill, your Bar in Old Town Scottsdale. Enjoy Comfort Food, \nEclectic Beers, Live Music, Bar Games and Outdoor Fun with all your Friends."
  }, 
  {
    "id": "https://www.zillow.com/scottsdale-az/old-town-scottsdale-_att/", 
    "contents": "Zillow has 285 homes for sale in Scottsdale AZ matching Old Town Scottsdale. \nView listing photos, review sales history, and use our detailed real estate filters to\n ..."
  }, 
  {
    "id": "https://www.hotelplanner.com/Hotels/23299/Reservations-Courtyard-by-Marriott-Old-Town-Scottsdale-Scottsdale-3311-North-Scottsdale-Rd-85251", 
    "contents": "COURTYARD BY MARRIOTT OLD TOWN SCOTTSDALE in Scottsdale AZ at \n3311 North Scottsdale Rd. 85251 US. Check reviews and discounted rates for ..."
  }, 
  {
    "id": "https://www.vrbo.com/898657", 
    "contents": "Welcome to The Miller! Fun, comfortable, and chic - The Miller is a perfect place \nto live and enjoy Old Town Scottsdale The home design and furnishings have ..."
  }, 
  {
    "id": "https://clients.mindbodyonline.com/classic/ws%3Fstudioid%3D204520", 
    "contents": "You must have javascript enabled to use Orangetheory Fitness Old Town \nScottsdale, AZ #0080 Online."
  }, 
  {
    "id": "https://www.itrip.net/vacation-rentals/usa/az/scottsdale/old-town-scottsdale", 
    "contents": "Walking distance to Giants stadium, Close to Old Town Scottsdale, Private Pool ... \nNewly Remodeled 2 story Townhome near Old Town Scottsdale, Large Pool, ..."
  }, 
  {
    "id": "https://scottsdale.house.hyatt.com/en/hotel/rooms.html", 
    "contents": "Relax inside some of the most recently renovated Scottsdale hotel suites with \ncontemporary finishes, free Wi-Fi, LCD TV, separate living area & kitchens."
  }, 
  {
    "id": "https://thehousebrasserie.com/", 
    "contents": "The House Brasserie in Old Town Scottsdale evokes a bygone era-- a time when \nservice and hospitality mattered most in the dining experience ..."
  }, 
  {
    "id": "http://dakotabar.com/", 
    "contents": "Of all of the bars in Scottsdale and nightclubs in Scottsdale Arizona , Dakota in \nthe old town Scottsdale entertainment district has cemented itself as the top club\n ..."
  }, 
  {
    "id": "http://ktar.com/story/403651/iconic-old-town-scottsdale-cowboy-sign-now-belongs-to-city/", 
    "contents": "Apr 25, 2015 ... The sign that welcomes you to Old Town Scottsdale is officially property of the city \nnow. It only took more than 60 years for that to transpire."
  }, 
  {
    "id": "https://www.viator.com/Phoenix-attractions/Old-Town-Scottsdale/d639-a3897", 
    "contents": "The city of Scottsdale sits adjacent to Phoenix, attracting visitors by the bus-load to Scottsdale Old Town.\n ... It’s also where you’ll find museums like Scottsdale’s Museum of Contemporary Art and the city’s historical museum.\n Walking tours highlight the old town’s Old West ..."
  }, 
  {
    "id": "https://www.oldtowntavernaz.com/", 
    "contents": "The biggest little stage in Old Town. A great bar in Scottsdale AZ with Ice cold \nbeer, the best cocktails, live music and good times."
  }, 
  {
    "id": "http://www.oldtowngringos.com/", 
    "contents": "Bar and restaurant in Scottsdale AZ with a dog friendly patio and a both inside \nand outside bar areas serving food until late night."
  }, 
  {
    "id": "https://about.aimbridgehospitality.com/comfort-scottsdale", 
    "contents": "Our Hotel. The Comfort Suites� Old Town Scottsdale hotel in Scottsdale offers all \nthe essentials travelers need to stay on their game and be their best. We're ..."
  }, 
  {
    "id": "https://oldtowncandyandtoys.com/", 
    "contents": "It's All Fun & Games Here at Old Town Candy & Toys. Take a trip down memory \nlane and visit one of downtown Scottsdale's newest and most unique businesses\n ..."
  }, 
  {
    "id": "http://www.papagoinnscottsdale.com/en-us/about-scottsdale/old-town-scottsdale", 
    "contents": "Old Town Scottsdale is a unique place that has something for every type of \nperson. It is a charming mixture of authentic cowboy saloons, eclectic art galleries\n, ..."
  }, 
  {
    "id": "http://www.dailydosegrill.com/", 
    "contents": "Old Town Bar & Grill. OLD TOWN SCOTTSDALE. 4020 N. SCOTTSDALE RD #\n101. SCOTTSDALE AZ 85251. 480-994-3673. MidTown Bar & Grill. MIDTOWN ..."
  }, 
  {
    "id": "http://socialtapeatery.com/scottsdale-location/", 
    "contents": "Social Tap Scottsdale in Old Town. With a large outdoor dining area and bar, \nenjoy local craft beer in the middle of Old Town. Whether you are having a night \nout ..."
  }, 
  {
    "id": "https://www.homeaway.com/theme/742/old-town-scottsdale", 
    "contents": "Book your Old Town Scottsdale, US vacation rentals online. Explore a large \nselection of vacation rentals, including condos, houses & more: over 3500 \nproperties ..."
  }
]