[
  {
    "id": "https://www.hamradio.com/", 
    "contents": "World's Largest Supplier of Amateur Radio, Ham Radio, and Communication Equipment. Sales, Supplies, and Service. "
  }, 
  {
    "id": "http://www.arrl.org/what-is-ham-radio/", 
    "contents": "The American Radio Relay League (ARRL) is the national association for amateur radio, connecting hams around the U.S. with news, information and resources. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Amateur_radio", 
    "contents": "Amateur radio, also known as ham radio, describes the use of radio frequency spectrum for purposes of non-commercial exchange of messages, wireless experimentation, self-training, private recreation, radiosport, contesting, and emergency communication. "
  }, 
  {
    "id": "https://images.search.yahoo.com/search/images?p=ham+radio", 
    "contents": "More Ham Radio images "
  }, 
  {
    "id": "https://www.fcc.gov/wireless/bureau-divisions/mobility-division/amateur-radio-service", 
    "contents": "The amateur and amateur-satellite services are for qualified persons of any age who are interested in radio technique solely with a personal aim and without pecuniary interest. These services present an opportunity for self-training, intercommunication, and technical investigations. The amateur and ... "
  }, 
  {
    "id": "https://hamcity.com/", 
    "contents": "Ham Radio and Amateur Radio online equipment sales. HamCity has more than 30 years of experience in the amateur radio equipment business! Please visit us today for all your ham radio needs! "
  }, 
  {
    "id": "https://video.search.yahoo.com/search/video?p=ham+radio", 
    "contents": "More Ham Radio videos "
  }, 
  {
    "id": "https://www.ebay.com/sch/i.html?_nkw=ham+radio", 
    "contents": "Find great deals on eBay for ham radio. Shop with confidence. "
  }, 
  {
    "id": "https://www.amazon.com/Ham-radio/s?page=1&rh=i%3Aaps%2Ck%3AHam%20radio", 
    "contents": "Quansheng UV-R50 Rechargeable Dual Band Two-way Radios Long Range Walkie Talkies (136-174MHz VHF & 400-520MHz UHF) Ham Amateur Radio Li-ion Battery and Charger included "
  }, 
  {
    "id": "https://electronics.howstuffworks.com/ham-radio.htm", 
    "contents": "Ham radio lets people talk across the globe, wirelessly and inexpensively. Learn how to get started in ham radio, from licenses to equipment, and check out two-way radio reviews. "
  }, 
  {
    "id": "http://www.eham.net/", 
    "contents": "- eHam.net is a Web site dedicated to ham radio (amateur radio). "
  }, 
  {
    "id": "https://news.search.yahoo.com/search?p=ham+radio&fr2=cosmos", 
    "contents": "More news for Ham Radio "
  }, 
  {
    "id": "http://www.arrl.org/", 
    "contents": "The American Radio Relay League (ARRL) is the national association for amateur radio, connecting hams around the U.S. with news, information and resources. "
  }, 
  {
    "id": "https://electronics.howstuffworks.com/ham-radio.htm", 
    "contents": "Ham radio lets people talk across the globe, wirelessly and inexpensively. Learn how to get started in ham radio, from licenses to equipment, and check out two-way radio reviews. "
  }, 
  {
    "id": "http://www.eham.net/", 
    "contents": "- eHam.net is a Web site dedicated to ham radio (amateur radio). "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Amateur_radio_operator", 
    "contents": "An amateur radio operator is someone who uses equipment at an amateur radio station to engage in two-way personal communications with other amateur operators on radio frequencies assigned to the amateur radio service. "
  }, 
  {
    "id": "http://www.kenwood.com/usa/com/amateur/", 
    "contents": "KENWOOD amateur radio products are sold world-wide, building on a reputation for outstanding audio quality both on transmit and receive - since 1955. "
  }, 
  {
    "id": "https://www.arnewsline.org/", 
    "contents": "- australia has field day fever - young ladies' radio league preps for convention - a sporting way to score at the wrtc - ham named minister for science in spain "
  }, 
  {
    "id": "https://www.qrz.com/", 
    "contents": "World's leading amateur radio web site with news, technical articles, discussions, practice exams and more. "
  }, 
  {
    "id": "https://www.gigaparts.com/", 
    "contents": "GigaParts - Your trusted source for Amateur Radio, Computers and More! "
  }, 
  {
    "id": "https://www.legion.org/hamradio", 
    "contents": "The American Legion was chartered and incorporated by Congress in 1919 as a patriotic veterans organization devoted to mutual helpfulness. "
  }, 
  {
    "id": "https://www.mtcradio.com/", 
    "contents": "MTC Texas Sized Ham Radio and Electronic Deals! "
  }, 
  {
    "id": "http://www.qsradio.com/index.html", 
    "contents": "Quicksilver Radio carries only the best in Ham Radio Accessories "
  }, 
  {
    "id": "http://www.qsradio.com/index.html", 
    "contents": "Quicksilver Radio carries only the best in Ham Radio Accessories "
  }, 
  {
    "id": "https://www.hamradiolicenseexam.com/", 
    "contents": "Online courses and practice tests for the ham radio license exams "
  }, 
  {
    "id": "https://www.hamradiodeluxe.com/", 
    "contents": "Ham Radio Deluxe is the world's most popular ham radio software. The Radio Amateur's Best Asset for Rig and Rotor Control, Logging, Digital Modes, and Satellite. Use with LOTW, ClubLog, QRZ, Yaesu, Icom, Kenwood, Elecraft, FlexRadio, Ten-Tec, etc. "
  }, 
  {
    "id": "https://www.eham.net/", 
    "contents": "- eHam.net is a Web site dedicated to ham radio (amateur radio). "
  }, 
  {
    "id": "https://www.universal-radio.com/", 
    "contents": "Universal Radio Inc. Selling new and used amateur and shortwave radio equipment since 1942 "
  }, 
  {
    "id": "https://swap.qth.com/", 
    "contents": "QTH.com Free Ham Radio Classified Ads from QTH.COM. The biggest and best ham radio classifieds on the web! Buy, sell, trade HF and VHF equipment, towers, antennas, rotators and more! "
  }, 
  {
    "id": "https://streema.com/radios/genre/Ham_Radio", 
    "contents": "Ham Radio radio stations from around the world. Listen online to free live Internet radio stations. "
  }, 
  {
    "id": "https://www.gigaparts.com/", 
    "contents": "GigaParts - Your trusted source for Amateur Radio, Computers and More! "
  }, 
  {
    "id": "http://www.dummies.com/programming/ham-radio/ham-radio-for-dummies-cheat-sheet/", 
    "contents": "If you’re new to ham radio, these articles contain information that new ham radio operators should keep handy while gathering experience. You’ll find these references to be just what you need while learning to navigate the radio bands and make contacts. "
  }, 
  {
    "id": "https://hamstudy.org/", 
    "contents": "Free ham radio flash cards, practice tests, and question pools as well as introduction to ham radio and explanations for questions. "
  }, 
  {
    "id": "https://www.weather.gov/pbz/hamradio", 
    "contents": "Ham Radio Program. WX3PIT. Send your comments, questions or any additional information you would like posted on this page to Fred McMullen (WCM) "
  }, 
  {
    "id": "https://www.dxengineering.com/search/brand/dx-engineering", 
    "contents": "DX Engineering products are engineered to be the best. Shop antennas, aluminum tubing, clamps, baluns, array packages, cable assemblies & more. "
  }, 
  {
    "id": "http://www.nws.noaa.gov/os/marine/ham.htm", 
    "contents": "Marine Forecast Offices & Centers provide links to their products as well as additional regionally focused information. . Click on map for "
  }, 
  {
    "id": "http://swap.qth.com/", 
    "contents": "QTH.com Free Ham Radio Classified Ads from QTH.COM. The biggest and best ham radio classifieds on the web! Buy, sell, trade HF and VHF equipment, towers, antennas, rotators and more! "
  }, 
  {
    "id": "https://dxnews.com/", 
    "contents": "DX News. Preferred source of Ham Radio News, DX Peditions, video, articles, images for DXers. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=Ow1hxClR5J8", 
    "contents": "If you value these videos, please consider donating to the Tin Hat Ranch Patreon to continue and expand programming, find out more here- https://goo.gl/zpCL0... "
  }, 
  {
    "id": "https://www.universal-radio.com/", 
    "contents": "Universal Radio Inc. Selling new and used amateur and shortwave radio equipment since 1942 "
  }, 
  {
    "id": "https://www.hamradiolicenseexam.com/", 
    "contents": "Online courses and practice tests for the ham radio license exams "
  }, 
  {
    "id": "https://www.eham.net/", 
    "contents": "- eHam.net is a Web site dedicated to ham radio (amateur radio). "
  }, 
  {
    "id": "https://www.dxzone.com/", 
    "contents": "DX Zone is a portal dedicated to ham radio (amateur radio) with a human edited links directory dedicated to long-distance and two-way radio communictations "
  }, 
  {
    "id": "http://hamradio360.com/", 
    "contents": "Legacy Podcast. Ham Radio 360 was a bi-weekly Amateur Radio Podcast created for the “New Guy”. Hosted by Cale Nelson, K4CDN, the show chronicled his journey with over 3 and a half years of interviews and projects for all things Ham Radio. "
  }, 
  {
    "id": "https://www.hamradiosecrets.com/listen-to-ham-radio-online.html", 
    "contents": "Want to listen to ham radio online? Frustrated by dead links? You will only find live links here! "
  }, 
  {
    "id": "http://www.hamsphere.com/", 
    "contents": "HamSphere® is a Virtual Ham Radio transceiver for Windows, Mac, Linux, Android and iPhone "
  }, 
  {
    "id": "https://www.hamradiodeluxe.com/", 
    "contents": "Ham Radio Deluxe is the world's most popular ham radio software. The Radio Amateur's Best Asset for Rig and Rotor Control, Logging, Digital Modes, and Satellite. Use with LOTW, ClubLog, QRZ, Yaesu, Icom, Kenwood, Elecraft, FlexRadio, Ten-Tec, etc. "
  }, 
  {
    "id": "https://streema.com/radios/genre/Ham_Radio", 
    "contents": "Ham Radio radio stations from around the world. Listen online to free live Internet radio stations. "
  }, 
  {
    "id": "https://www.dxzone.com/", 
    "contents": "DX Zone is a portal dedicated to ham radio (amateur radio) with a human edited links directory dedicated to long-distance and two-way radio communictations "
  }, 
  {
    "id": "http://www.amateurradio.com/here-are-8-great-ham-radio-podcasts/", 
    "contents": "Over the last decade, I’ve listened to many ham radio podcasts and found them to be a great way to pass the time while driving or working in my home office. Some of the best podcasts have come and gone, and some wax and wane on a regular basis as the host’s time permits (Jerry, […] "
  }, 
  {
    "id": "https://qth.com/", 
    "contents": "QTH.com provides Web Hosting and Ham Radio services. So good, you will tell your friends!. "
  }, 
  {
    "id": "http://www.ustower.com/product_cat/ham-radio-fixed-towers/", 
    "contents": "702 E. North Street Lincoln, KS 67455. sales@ustower.com. Tel: 559-564-6000. Fax: 559-564-6011 "
  }, 
  {
    "id": "http://yaesu.com/", 
    "contents": "The Yaesu brand is well known among ham radio aficionados and is synonymous with premium quality ham radios. From stationary multi-feature communications equipment to portable devices, YAESU has consistently represented the best in communications equipment to the world's top DX'ers for over half a century. "
  }, 
  {
    "id": "http://www.artscipub.com/repeaters/", 
    "contents": "Amateur GMRS and Ham radio repeater database with map frequency directory listing repeaterbook "
  }, 
  {
    "id": "http://www.cq-amateur-radio.com/", 
    "contents": "CQ Amateur Radio is the world's leading independent ham radio magazine, with an emphasis on operating, DXing, contesting, propagation, public service, mobiling and construction articles. "
  }, 
  {
    "id": "http://www.ustower.com/product_cat/ham-radio-fixed-towers/", 
    "contents": "702 E. North Street Lincoln, KS 67455. sales@ustower.com. Tel: 559-564-6000. Fax: 559-564-6011 "
  }, 
  {
    "id": "https://hamexam.org/exam/12-Technician", 
    "contents": "Study material for this question can be found in the following resources: ARRL Ham Radio License Manual - 3rd Edition Chapter 3, Page 7; KB6NU's No-Nonsense Technician-Class License Study Guide "
  }, 
  {
    "id": "https://www.dxzone.com/5-free-ham-radio-logbook-programs/", 
    "contents": "A selection of five free ham radio logging programs, Logger 32, DXKeeper, Swisslog, Log4OM and BBLogger taken from the amateur radio logging software category. "
  }, 
  {
    "id": "https://sourceforge.net/directory/communications/hamradio/os:windows/", 
    "contents": "Compare the best free open source Windows Ham Radio Software at SourceForge. Free, secure and fast Windows Ham Radio Software downloads from the largest Open Source applications and software directory "
  }, 
  {
    "id": "http://qrznow.com/top-5-ham-radio-app/", 
    "contents": "If you're a member of ARRL, the national association for Amateur Radio, install this app and have QST, the ARRL membership journal, delivered to your Android device every month!QST entertains and informs with news, construction "
  }, 
  {
    "id": "http://w4ehw.fiu.edu/", 
    "contents": "Amateur Radio Station at the National Hurricane Center Located on the campus of Florida International University Miami, Florida Celebrating 38 years of Public Service ! Our Mission: To Help Save Lives. "
  }, 
  {
    "id": "http://www.cushcraftamateur.com/", 
    "contents": "Cushcraft Compact HF Multi-Band Beam 10-20 Meters The MA5B, Compact HF Multi-Band Beam Small Footprint -- Big Signal MA5B, Cushcraft’s multiband HF antenna provides 5-Band operation in a package small enough to mount to a tripod. "
  }, 
  {
    "id": "https://heilsound.com/heil-amateur-radio/", 
    "contents": "Heil Sound is the only high performance microphone manufacturer for amateur radio. Period. Company founder Bob Heil understood very early in his career as a microphone designer that voice articulation is key to ham radio, both for emergency use as well as for the hobbyist. "
  }, 
  {
    "id": "http://qrznow.com/top-5-ham-radio-app/", 
    "contents": "If you're a member of ARRL, the national association for Amateur Radio, install this app and have QST, the ARRL membership journal, delivered to your Android device every month!QST entertains and informs with news, construction "
  }, 
  {
    "id": "https://heilsound.com/heil-amateur-radio/", 
    "contents": "Heil Sound is the only high performance microphone manufacturer for amateur radio. Period. Company founder Bob Heil understood very early in his career as a microphone designer that voice articulation is key to ham radio, both for emergency use as well as for the hobbyist. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=OO_sil00UD8", 
    "contents": "Like any thing ham radio has its share of dorks Support the channel on Patreon: https://www.patreon.com/dighsx Check out my TeeSpring T-shirt campaign: https... "
  }, 
  {
    "id": "https://www.facebook.com/HamRadios", 
    "contents": "Ham Radio. 15K likes. Ham Radio friends. Kevin Baxter 10 November 22:42 Hi my name is Kevin Baxter I have been a ham for almost 2years my call sign is KG7IPJ: I love this hobby there are a lot of different types of things you can do with this hobby plus there are a hole bunch of wonderful people that are always happy to help if you need any ... "
  }, 
  {
    "id": "http://www.hamcrazy.com/index.php?main_page=index&cPath=2", 
    "contents": "Window decals for amateur radio ham callsigns. Let them know that you are a part of your local CERT Team. Die-cut design means that only the image is opaque. "
  }, 
  {
    "id": "https://www.reddit.com/r/amateurradio/", 
    "contents": "Reddit gives you the best of the internet in one place. Get a constantly updating feed of breaking news, fun stories, pics, memes, and videos just for you. Passionate about something niche? "
  }, 
  {
    "id": "http://noji.com/hamradio/hamradio.php", 
    "contents": "Amateur (ham) radio is a medium by which people can communicate on specific frequency ranges designated by the FCC for personal, hobby, educational / training, or emergency purposes. "
  }, 
  {
    "id": "http://www.sckans.edu/~sireland/radio/q_signals.html", 
    "contents": "Amateur Radio \"Q\" signals. Below a number of Q signals are listed whose meanings most often need to be expressed with brevity and clarity in amateur radio work. "
  }, 
  {
    "id": "https://www.cheapham.com/", 
    "contents": "Amateur radio, ham radio, cb, marine band and electoinc components "
  }, 
  {
    "id": "http://www.hamcrazy.com/", 
    "contents": "Ham Crazy! : - License Plaques Decals Keychains & Tools ARES - RACES - SKYWARN QSL Items Banners Callsign Displays Bumper Stickers Pens & Gadgets License Frames Callsign Caps ID Badges Buttons Ham Free Zone Mugs & Drinkware Gift Cards Wall Clocks License Plates Signs Hitch Covers Christmas Items ecommerce, ham, amateur, ham radio, amateur radio ... "
  }, 
  {
    "id": "http://hamradio.repair/", 
    "contents": "hamradio.repair We service and repair a wide variety of amateur radio transceivers, amplifiers and shortwave radio receivers. "
  }, 
  {
    "id": "https://www.facebook.com/groups/12699105116/", 
    "contents": "HAM RADIO has 30,875 members. Ham Radio/Amateur Radio A worldwide hobby of communication using VHF/UHF/HF radios. Though a hobby, during disaster HAM... "
  }, 
  {
    "id": "http://hamradio360.com/", 
    "contents": "Legacy Podcast. Ham Radio 360 was a bi-weekly Amateur Radio Podcast created for the “New Guy”. Hosted by Cale Nelson, K4CDN, the show chronicled his journey with over 3 and a half years of interviews and projects for all things Ham Radio. "
  }, 
  {
    "id": "https://www.youtube.com/user/K7AGE", 
    "contents": "Randy, K7AGE, has many videos about amateur, ham, radio. Learn how to operate and program your 2 meter FM radio, operate PSK-31 and how to build antennas. Ma... "
  }, 
  {
    "id": "https://searchmobilecomputing.techtarget.com/definition/amateur-radio", 
    "contents": "Amateur radio, also known as ham radio, is a hobby enjoyed by several hundred thousand people in the United States and by over a million people worldwide. "
  }, 
  {
    "id": "https://hamradio.arc.nasa.gov/", 
    "contents": "The Ames Amateur Radio Club (AARC), chartered in 1984, exists to provide a matrix of services, technologies, skills, equipment, opportunities, and resources for those at the Moffett Federal Airfield, and in the local community, who are interested in amateur radio. "
  }, 
  {
    "id": "https://hamexam.org/", 
    "contents": "HamExam.org offers free practice exams and flash cards to help you study for your amateur radio exam. "
  }, 
  {
    "id": "https://www.hamradiohomes.com/", 
    "contents": "If you have real estate that is ‘Ham Friendly’ and you are looking for a buyer, this is the perfect place to list your property! For a flat-fee of $99, it will be listed on this site until it’s sold. "
  }, 
  {
    "id": "http://www.hamradio-friedrichshafen.de/ham-en/", 
    "contents": "05.06.2018 | Ham Radio and Maker Faire Bodensee attracts amateur radio enthusiasts, scouts and tinkerers – Strong international flavor among exhibitors and visitors. more "
  }, 
  {
    "id": "http://yaesu.com/", 
    "contents": "The Yaesu brand is well known among ham radio aficionados and is synonymous with premium quality ham radios. From stationary multi-feature communications equipment to portable devices, YAESU has consistently represented the best in communications equipment to the world's top DX'ers for over half a century. "
  }, 
  {
    "id": "https://sourceforge.net/directory/communications/hamradio/", 
    "contents": "Compare the best free open source Ham Radio Software at SourceForge. Free, secure and fast Ham Radio Software downloads from the largest Open Source applications and software directory "
  }, 
  {
    "id": "https://qth.com/", 
    "contents": "QTH.com provides Web Hosting and Ham Radio services. So good, you will tell your friends!. "
  }, 
  {
    "id": "http://www.ac6v.com/nets.htm", 
    "contents": "OKDXA Information Net-- 3860 Khz @ 6:30 PM LOCAL Time. YL DX Nets -- From The Buckeye Belle's Pages . YL's On The Air-- Pics and lots of links. YL Clubs-- From The Buckeye Belle's Pages "
  }, 
  {
    "id": "http://aa9pw.com/radio/", 
    "contents": "Welcome to the AA9PW Amateur Exam practice pages. This site helps you practice for the any of the three written examinations required to obtain a US Amateur Radio license. "
  }, 
  {
    "id": "http://www.instructables.com/id/How-to-Talk-to-Someone-Using-Ham-Radio/", 
    "contents": "Ham radio is cool, but it can be very nerve wracking to talk to someone using it. Talking to someone using ham radio is commonly known as a 'QSO' or a 'contact'. ... "
  }, 
  {
    "id": "http://w1wc.com/", 
    "contents": "Ham radio site with Amateur radio links and a collection of over 2800 Ham Radio sites services verified each week. Including DX band conditions(DX spots) for beginners and seasoned ham operators alike. "
  }, 
  {
    "id": "https://www.americanradiosupply.com/", 
    "contents": "AmericanRadioSupply.com is a National Supplier of Radio Communication Parts and RF Wireless Components | Coaxial Adapters Connectors Cables | DC Pwr Plug Connectors and Wiring, DAS Distributed Antenna Systems, Wireless Networks "
  }, 
  {
    "id": "https://www.hamradionow.tv/home", 
    "contents": "Amateur Radio, Ham Radio, podcasts and video programs. "
  }, 
  {
    "id": "http://qrznow.com/", 
    "contents": "70MHz experimental NoVs now easier. Following agreement with Ofcom, the RSGB is pleased to announce that a new much faster online process is now a... "
  }, 
  {
    "id": "http://www.remotehamradio.com/", 
    "contents": "Fully portable high performance. Operate stations with just your web browser – no hardware or software is required. Or, if you prefer a real radio, use an Elecraft K3 or K3/0-Mini. "
  }, 
  {
    "id": "https://dmv.ny.gov/plates/ham-radio-operator", 
    "contents": "The annual custom plate renewal fee is in addition to your vehicle registration renewal fee. You will be billed for the plates every two years when you renew your registration. "
  }, 
  {
    "id": "http://trbo.org/docs/Amateur_Radio_Guide_to_DMR.pdf", 
    "contents": "$200 Amateur Radio Guide to Digital Mobile Radio (DMR) By John S. Burningham, W2XAB February 2015 "
  }, 
  {
    "id": "http://fallout.wikia.com/wiki/Ham_radio", 
    "contents": "A ham radio is a small radio transceiver popular among amateur radio enthusiasts. Amateur radio began as a popular hobby and ersatz disaster relief service in the 1940s and 1950s in North America, and remained a popular pastime up until the Great War. "
  }, 
  {
    "id": "http://hamshirts.com/", 
    "contents": "High quality ham radio T-shirts, Plaques, Mugs, and accessories. Made by Hams for Hams. Made in the USA. "
  }, 
  {
    "id": "http://ksarrl.org/deeplink/", 
    "contents": "OVER 600 AMATEUR RADIO WEB SITES All ham radio links! Nothing but amateur radio web sites! The largest ad-free ham linking site on the web. "
  }, 
  {
    "id": "http://hamradio360.com/", 
    "contents": "Legacy Podcast. Ham Radio 360 was a bi-weekly Amateur Radio Podcast created for the “New Guy”. Hosted by Cale Nelson, K4CDN, the show chronicled his journey with over 3 and a half years of interviews and projects for all things Ham Radio. "
  }, 
  {
    "id": "https://www.wikihow.com/Build-Several-Easy-Antennas-for-Amateur-Radio", 
    "contents": "How to Build Several Easy Antennas for Amateur Radio. Amateur Radio has been a supreme way of communications for many ways of getting messages from one place to another for decades! "
  }
]