[
  {
    "id": "https://www.traversecity.com/", 
    "contents": "Find information on hotels, events, restaurants and things to do in Traverse City, Michigan. Start Planning your summer trip to Traverse City today! "
  }, 
  {
    "id": "https://www.tripadvisor.com/Attractions-g42758-Activities-Traverse_City_Grand_Traverse_County_Michigan.html", 
    "contents": "Things to Do in Traverse City, Michigan: See TripAdvisor's 11,669 traveler reviews and photos of Traverse City tourist attractions. Find what to do today, this weekend, or in June. "
  }, 
  {
    "id": "https://www.tripadvisor.com/Tourism-g42758-Traverse_City_Grand_Traverse_County_Michigan-Vacations.html", 
    "contents": "Traverse City Tourism: TripAdvisor has 67,159 reviews of Traverse City Hotels, Attractions, and Restaurants making it your best Traverse City resource. "
  }, 
  {
    "id": "https://images.search.yahoo.com/search/images?p=traverse+city", 
    "contents": "More Traverse City images "
  }, 
  {
    "id": "https://www.michigan.org/city/traverse-city", 
    "contents": "Traverse City is a four-season playground for anyone who loves the Great Outdoors. Here, you'll find 180 miles of beaches where you can wander as far as you like…romantic lighthouses and picturesque lakeside villages… "
  }, 
  {
    "id": "http://www.traversecitymi.gov/", 
    "contents": "This section shows current and upcoming meetings. To find past meetings, please use the Find Meetings page. "
  }, 
  {
    "id": "https://video.search.yahoo.com/search/video?p=traverse+city", 
    "contents": "More Traverse City videos "
  }, 
  {
    "id": "https://www.downtowntc.com/", 
    "contents": "Unique & Custom Stores Shopping. Whether you're looking for some new duds, gear for an adventure, the perfect art piece or something completely different, you'll find it and so much more in Downtown Traverse City. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Traverse_City,_Michigan", 
    "contents": "Traverse City (/ ˈ t r æ v ər s ˈ s ɪ t i / or locally / ˈ t r æ v ər. s ɪ t i /) is a city in the U.S. state of Michigan.It is the county seat of Grand Traverse County, although a small portion extends into Leelanau County. "
  }, 
  {
    "id": "https://www.mapquest.com/us/mi/traverse-city-282029136", 
    "contents": "Get directions, maps, and traffic for Traverse City, MI. Check flight prices and hotel availability for your visit. "
  }, 
  {
    "id": "https://www.wunderground.com/weather/us/mi/traverse-city", 
    "contents": "Weather Underground provides local & long range weather forecasts, weather reports, maps & tropical weather conditions for locations worldwide. "
  }, 
  {
    "id": "https://www.traversecity.com/summer/things-to-do/events/", 
    "contents": "Explore all the events happening in Traverse City, Michigan this summer with our calendar. Find festivals, fairs, or even add your own event. "
  }, 
  {
    "id": "https://weather.com/weather/today/l/Traverse+City+MI+USMI0829:1:US", 
    "contents": "Today’s and tonight’s Traverse City, MI weather forecast, weather conditions and Doppler radar from The Weather Channel and Weather.com "
  }, 
  {
    "id": "https://www.wunderground.com/weather/us/mi/traverse-city", 
    "contents": "Weather Underground provides local & long range weather forecasts, weather reports, maps & tropical weather conditions for locations worldwide. "
  }, 
  {
    "id": "https://www.expedia.com/Traverse-City-Hotels.d3577.Travel-Guide-Hotels", 
    "contents": "Choose from 148 Traverse City hotels with huge savings! Traverse City is known for its wine, lakeside setting and beer. Don’t miss out on great hotels near City Opera House and Clinch Park. "
  }, 
  {
    "id": "https://www.zillow.com/traverse-city-mi/", 
    "contents": "Zillow has 223 homes for sale in Traverse City MI. View listing photos, review sales history, and use our detailed real estate filters to find the perfect place. "
  }, 
  {
    "id": "https://www.facebook.com/places/Things-to-do-in-Traverse-City-Michigan/106152729415232/", 
    "contents": "Discover Traverse City, Michigan with the help of your friends. Search for restaurants, hotels, museums and more. "
  }, 
  {
    "id": "https://www.hotels.com/de1410100/hotels-traverse-city-michigan/", 
    "contents": "Compare 88 hotels in Traverse City using 9172 real guest reviews. Earn free nights and get our Price Guarantee - booking has never been easier on Hotels.com! "
  }, 
  {
    "id": "https://www.ihg.com/hotelindigo/hotels/us/en/traverse-city/tvcin/hoteldetail", 
    "contents": "Official site of Hotel Indigo Traverse City. A boutique hotel that features neighborhood charm, serves people & pets, and provides the Best Price Guarantee. "
  }, 
  {
    "id": "https://realtor.com/realestateandhomes-search/Traverse-City_MI/pg-2", 
    "contents": "Page 2 | View 1,349 homes for sale in Traverse City, MI at a median listing price of $294,900. See pricing and listing details of Traverse City real estate for sale. "
  }, 
  {
    "id": "https://www.homedepot.com/l/Traverse-City/MI/Traverse-City/49684/2726", 
    "contents": "Visit our Traverse City location to shop exclusive deals, get DIY advice, or pick up your online purchase. Call us at (231) 922-9440. "
  }, 
  {
    "id": "https://www.greatwolf.com/traverse-city", 
    "contents": "At Great Wolf Lodge in Traverse City, we offer a wide variety of family-friendly attractions at our Michigan water park. Plan your next vacation here. "
  }, 
  {
    "id": "https://www.expedia.com/Traverse-City.d3577.Destination-Travel-Guides", 
    "contents": "Travel the world better. Build your own Traverse City vacation. Bundle flight + hotel & save 100% off your flight. Expedia Price Guarantee on 321,000+ hotels & 400+ airlines worldwide. "
  }, 
  {
    "id": "https://www.realtor.com/realestateandhomes-search/Traverse-City_MI", 
    "contents": "View 1,368 homes for sale in Traverse City, MI at a median listing price of $299,950. See pricing and listing details of Traverse City real estate for sale. "
  }, 
  {
    "id": "http://www.traversecitymi.gov/about.asp", 
    "contents": "Traverse City is located in portions of both Grand Traverse County and Leelanau County within Northern Lower Michigan. Traverse City is situated on the shores of picturesque East Grand Traverse Bay and West Grand Traverse Bay, which both flow into Lake Michigan. "
  }, 
  {
    "id": "https://www.accuweather.com/en/us/traverse-city-mi/49684/weather-radar/333683", 
    "contents": "See the latest Traverse City, MI Doppler weather radar map including areas of rain, snow and ice on AccuWeather.com "
  }, 
  {
    "id": "https://www.trulia.com/MI/Traverse_City/", 
    "contents": "1,388 Homes For Sale in Traverse City, MI. Browse photos, see new properties, get open house info, and research neighborhoods on Trulia. "
  }, 
  {
    "id": "https://www.yelp.com/search?cflt=bars&find_loc=Traverse+City%2C+MI", 
    "contents": "Best Bars in Traverse City, MI - Low Bar, Rare Bird Brew Pub, Traverse City Whiskey Co, 7 Monks Taproom, The Workshop Brewing Company, The Little Fleet, 123 Speakeasy, The Parlor, North Peak Brewing, U And I Lounge, Union Street Station,… "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Traverse_City,_Michigan", 
    "contents": "Traverse City (/ ˈ t r æ v ər s ˈ s ɪ t i / or locally / ˈ t r æ v ər. s ɪ t i /) is a city in the U.S. state of Michigan.It is the county seat of Grand Traverse County, although a small portion extends into Leelanau County. "
  }, 
  {
    "id": "https://www.trulia.com/for_rent/Traverse_City,MI/", 
    "contents": "Search 43 Rental Properties in Traverse City, Michigan. Find Traverse City apartments, condos, town homes, single family homes and much more on Trulia. "
  }, 
  {
    "id": "https://www.yelp.com/search?cflt=wineries&find_loc=Traverse+City%2C+MI", 
    "contents": "Best Wineries in Traverse City, MI - Brys Estate Vineyard & Winery, Black Star Farms Old Mission, Mari Vineyards, Chateau Grand Traverse Winery, Bowers Harbor Vineyards, Bonobo Winery, Peninsula Cellars, Rove Estate, Left Foot Charley, Hawthorne… "
  }, 
  {
    "id": "https://www.greatwolf.com/traverse-city", 
    "contents": "At Great Wolf Lodge in Traverse City, we offer a wide variety of family-friendly attractions at our Michigan water park. Plan your next vacation here. "
  }, 
  {
    "id": "https://www.vrbo.com/vacation-rentals/usa/michigan/northwest/traverse-city", 
    "contents": "Explore an array of Traverse City, MI vacation rentals, including houses, cottages & more bookable online. Choose from more than 1,500 properties, ideal house rentals for families, groups and couples. "
  }, 
  {
    "id": "https://www.greatwolf.com/traverse-city", 
    "contents": "At Great Wolf Lodge in Traverse City, we offer a wide variety of family-friendly attractions at our Michigan water park. Plan your next vacation here. "
  }, 
  {
    "id": "https://www.monster.com/jobs/l-traverse-city,-mi.aspx", 
    "contents": "Search Traverse City jobs and find great employment opportunities. Browse Monster's collection of full time and part time jobs in Traverse City, Michigan and build your career today. "
  }, 
  {
    "id": "https://www.cherrytreeinn.com/", 
    "contents": "Treat yourself to a beautiful beachfront hotel stay when you choose the Cherry Tree Inn & Suites in Traverse City, MI. "
  }, 
  {
    "id": "https://www.apartments.com/traverse-city-mi/", 
    "contents": "See all 83 apartments in Traverse City, MI currently available for rent. Each Apartments.com listing has verified availability, rental rates, photos, floor plans and more. "
  }, 
  {
    "id": "https://www.homeaway.com/d/94/traverse-city", 
    "contents": "Book your Traverse City, MI vacation rentals online. Explore a large selection of vacation rentals, including houses, cottages & more: over 1,500 properties for short or long stays. "
  }, 
  {
    "id": "http://www.midwestliving.com/travel/michigan/traverse-city/", 
    "contents": "Grand and Little Traverse bays bookend this northwestern corner of Michigan's Lower Peninsula. Things to do in the Traverse City area include Sleeping Bear Dunes National Lakeshore, Little Traverse Wheelway, Earl Young's Mushroom Houses and the Tunnel of Trees. "
  }, 
  {
    "id": "https://www.kayak.com/Traverse-City-Hotels.7978.hotel.ksp", 
    "contents": "Looking for a Traverse City Hotel? 2-star hotels from $45, 3 stars from $74 and 4 stars+ from . Stay at Bayshore Resort from $92/night, Comfort Inn Traverse City from $78/night, Park Place Hotel from $111/night and more. "
  }, 
  {
    "id": "https://www.indeed.com/l-Traverse-City,-MI-jobs.html", 
    "contents": "1,858 jobs available in Traverse City, MI on Indeed.com. Apply to Peer Counselor, Crew Member, Entry Level Production Operator, Baggage Handler, Assistant and more! "
  }, 
  {
    "id": "http://obituaries.record-eagle.com/", 
    "contents": "David L. Childs, 59, of Bellaire, passed away on June 13, 2018 at Munson Medical Center in Traverse City. David was born on Oct. 11, 1958 in Dowagiac to the late... "
  }, 
  {
    "id": "http://www.midwestliving.com/travel/michigan/traverse-city/", 
    "contents": "Grand and Little Traverse bays bookend this northwestern corner of Michigan's Lower Peninsula. Things to do in the Traverse City area include Sleeping Bear Dunes National Lakeshore, Little Traverse Wheelway, Earl Young's Mushroom Houses and the Tunnel of Trees. "
  }, 
  {
    "id": "https://www.cherryrepublic.com/locations/traverse-city/", 
    "contents": "The Cherry Capital of the World, Traverse City is the natural spot for our second Flagship store! Located right on Front Street, our Downtown TC location opened in 2007 and features a wine/soda pop tasting bar, homemade ice cream, The Grand Cafe, and a cherry climbing tree. "
  }, 
  {
    "id": "http://traversecitykoa.com/", 
    "contents": "Traverse City KOA Campground is located in a heartwarming country setting only 15 miles south of Traverse City. Relax in comfort and wake ... "
  }, 
  {
    "id": "https://www.accuweather.com/en/us/traverse-city-mi/49684/weather-forecast/333683", 
    "contents": "Get the Traverse City weather forecast. Access hourly, 10 day and 15 day forecasts along with up to the minute reports and videos for Traverse City, MI 49684 from AccuWeather.com "
  }, 
  {
    "id": "http://www.city-data.com/city/Traverse-City-Michigan.html", 
    "contents": "According to our research of Michigan and other state lists there were 184 registered sex offenders living in Traverse City, Michigan as of June 15, 2018. The ratio of number of residents in Traverse City to the number of sex offenders is 84 to 1. Median real estate property taxes paid for housing ... "
  }, 
  {
    "id": "https://www.mapquest.com/search/results?slug=%2Fus%2Fmi%2Ftraverse-city&query=Traverse%20City,%20MI&page=0", 
    "contents": "Map of Traverse City, MI and surrounding areas. Get detailed driving directions with road conditions, live traffic updates, and reviews of local businesses along the way. "
  }, 
  {
    "id": "https://www.theweathernetwork.com/us/weather/michigan/traverse-city", 
    "contents": "If severe weather is happening in your area, let us know! Call the Stormline toll free at 1-800-463-9463 "
  }, 
  {
    "id": "https://www.groupon.com/local/traverse-city-mi", 
    "contents": "Find great local, shopping and travel deals at 50 to 90% off in Traverse City, MI. One-Year Costco Gold Star Membership with $20 Costco Cash Card and Exclusive Coupons (Up to $144.98 Value). "
  }, 
  {
    "id": "https://stores.staples.com/mi/traverse-city/2632-crossing-circle", 
    "contents": "Visit this Traverse City Staples® for office supplies & furniture, school supplies, printers, ink & toner, copy paper, computers, technology, and more. "
  }, 
  {
    "id": "https://www.cherryfestival.org/Default.aspx", 
    "contents": "The National Cherry Festival is more than a single summer celebration. We hold events all year long and are committed to pouring into our community. "
  }, 
  {
    "id": "https://www.realtor.com/realestateandhomes-search/Traverse-City_MI", 
    "contents": "View 1,368 homes for sale in Traverse City, MI at a median listing price of $299,950. See pricing and listing details of Traverse City real estate for sale. "
  }, 
  {
    "id": "https://www.realtor.com/apartments/Traverse-City_MI/", 
    "contents": "Get easy access to 23 apartments for rent in Traverse City, MI on realtor.com®. Find the ideal Traverse City apartments today. "
  }, 
  {
    "id": "http://www.city-data.com/city/Traverse-City-Michigan.html", 
    "contents": "According to our research of Michigan and other state lists there were 184 registered sex offenders living in Traverse City, Michigan as of June 15, 2018. The ratio of number of residents in Traverse City to the number of sex offenders is 84 to 1. Median real estate property taxes paid for housing ... "
  }, 
  {
    "id": "https://stores.advanceautoparts.com/mi/traverse-city/2420-south-airport-road", 
    "contents": "Advance Auto Parts 2420 South Airport Road in Traverse City, MI. Visit us for quality auto parts, advice and accessories. "
  }, 
  {
    "id": "https://www.zomato.com/traverse-city-mi/best-restaurants", 
    "contents": "Best Restaurants in Traverse City. Menus, Photos, Ratings and Reviews for Best Restaurants in Traverse City "
  }, 
  {
    "id": "http://www.legacy.com/obituaries/local/michigan/traverse-city-obituaries", 
    "contents": "Browse the most recent Traverse City, Michigan obituaries and condolences. Celebrate and remember the lives we have lost in Traverse City, Michigan. "
  }, 
  {
    "id": "https://www.chemicalbank.com/About/Community/Traverse-City", 
    "contents": "Traverse City is situated on the shores of picturesque East Grand Traverse Bay and West Grand Traverse Bay, which both flow into Lake Michigan. "
  }, 
  {
    "id": "https://www.uber.com/cities/traverse-city/", 
    "contents": "Uber is the best way to get around Traverse City. Download the app and get a ride in minutes. Or sign up to drive and earn money on your schedule. "
  }, 
  {
    "id": "https://www.tcbeaches.com/", 
    "contents": "Welcome to the best waterfront hotel resorts located in Traverse City, Michigan. Traverse City hotels with over 600' of sandy beaches. "
  }, 
  {
    "id": "http://www.saginaw.va.gov/locations/TraverseCity.asp", 
    "contents": "Features. Primary care services for veterans in the Traverse City area. Handicapped Accessible: full and easy access for all veterans. Personal Care: Highly qualified primary care providers, specialty care referrals to the VA Medical Centers in Saginaw, Detroit and Ann Arbor. "
  }, 
  {
    "id": "http://www.legacy.com/obituaries/local/michigan/traverse-city-obituaries", 
    "contents": "Browse the most recent Traverse City, Michigan obituaries and condolences. Celebrate and remember the lives we have lost in Traverse City, Michigan. "
  }, 
  {
    "id": "https://wikitravel.org/en/Traverse_City", 
    "contents": "Traverse City is known as the Cherry Capital of the World; around 75 percent of the nation's cherries are grown in Michigan, and most of those come from the Traverse City area. "
  }, 
  {
    "id": "https://www.travelandleisure.com/travel-guide/traverse-city", 
    "contents": "Picture the perfect small-town getaway: autumnal trees in gold and red, local diners where everyone knows your name, vineyards within short driving distance. "
  }, 
  {
    "id": "http://upnorthlive.com/", 
    "contents": "WPBN offers news, sports, weather and items of local interest in Traverse City, Michigan and nearby towns, including Frankfort, Beulah, Interlochen, Kingsley, Garfield Township, Glen Arbor, Suttons Bay, Kalkaska, Kingsley and Manton, Michigan. "
  }, 
  {
    "id": "https://www.greatwolf.com/traverse-city/plan", 
    "contents": "Create great family memories with a getaway to Great Wolf Lodge in Traverse City, Michigan. Rooms are available at prices as low as $169.99, so book today! "
  }, 
  {
    "id": "https://www.opentable.com/red-ginger-of-traverse-city?page=1", 
    "contents": "Book now at Red Ginger of Traverse City in Traverse City, MI. Explore menu, see photos and read 1335 reviews: \"Great meal as always\" "
  }, 
  {
    "id": "https://www.homes.com/traverse-city-mi/homes-for-sale/", 
    "contents": "Search Traverse City, MI homes for sale, real estate, and MLS Listings. View for sale listing photos, sold history, nearby sales, and use our match filters to find your perfect home in Traverse City, MI. "
  }, 
  {
    "id": "http://www.record-eagle.com/", 
    "contents": "Traverse City, MI (49684) Today. A mix of clouds and sun during the morning will give way to cloudy skies this afternoon. "
  }, 
  {
    "id": "https://www.marriott.com/hotels/travel/tvcfi-fairfield-inn-and-suites-traverse-city/", 
    "contents": "Discover Fairfield Inn & Suites Traverse City by Marriott, one of the friendliest and most affordable Traverse City hotels. Located just off US-31 near downtown, our Traverse City, MI, hotel features free breakfast and Wi-Fi in spacious rooms. "
  }, 
  {
    "id": "http://www.9and10news.com/", 
    "contents": "Murdick's Fudge in Mack. Co. Offers Sweet Opportunity for Father's Day, National Fudge Day "
  }, 
  {
    "id": "https://koa.com/campgrounds/traverse-city/", 
    "contents": "Traverse City KOA is located in Buckley, Michigan and offers great camping sites! Click here to find out more information or to book a reservation. "
  }, 
  {
    "id": "https://www.theweathernetwork.com/us/weather/michigan/traverse-city", 
    "contents": "If severe weather is happening in your area, let us know! Call the Stormline toll free at 1-800-463-9463 "
  }, 
  {
    "id": "https://westbaybeachresorttraversecity.com/", 
    "contents": "West Bay Beach Resort a Holiday Inn Resort Traverse City hotel is located beachfront on Lake Michigan walking distance from downtown. Book now. "
  }, 
  {
    "id": "https://www.greatwolf.com/traverse-city/plan", 
    "contents": "Create great family memories with a getaway to Great Wolf Lodge in Traverse City, Michigan. Rooms are available at prices as low as $169.99, so book today! "
  }, 
  {
    "id": "https://www.resortsandlodges.com/lodging/usa/michigan/traverse-city.html", 
    "contents": "Traverse City Resorts and Lodges: Resort directory featuring a complete list of 29 Resorts and Lodges. Browse property descriptions, reviews, photos, video, rates, number of rooms, amenities, activities and much more. "
  }, 
  {
    "id": "http://hamptoninn3.hilton.com/en/hotels/michigan/hampton-inn-traverse-city-TVCLMHX/index.html", 
    "contents": "Welcome to the Hampton Inn hotel in Traverse City, MI. Our hotel offers some of the best amenities. Enjoy free breakfast, WiFI, and more. "
  }, 
  {
    "id": "https://www.booking.com/hotel/us/motel-6-traverse-city.html", 
    "contents": "Located in scenic Northern Michigan, this Traverse City hotel is minutes from beautiful beaches and many area attractions, and features a number of... "
  }, 
  {
    "id": "https://www.bankmbank.com/TraverseCity/", 
    "contents": "Welcome to the Traverse City Site Like Traverse City itself, mBank offers the best blend of big-city and small-town living. Here you’ll find big-city services like sophisticated online banking and remote deposit capture delivered with all the warmth of a small-town bank. "
  }, 
  {
    "id": "http://www.munsonhealthcare.org/", 
    "contents": "Munson Healthcare is a regional, nonprofit health care system annually serving 24 counties throughout northern lower Michigan and the eastern Upper Peninsula. "
  }, 
  {
    "id": "http://www.tcaps.net/", 
    "contents": "Traverse City Area Public Schools welcome to tcaps. We exist to educate. Education improves the quality of life for all. "
  }, 
  {
    "id": "http://www.grandtraversetours.com/", 
    "contents": "We offer winery tours in Traverse City, limousine service, and Old Mission winery tours and Leelanau Peninsula. "
  }, 
  {
    "id": "https://www.ssbankmi.com/about/traverse-city.html", 
    "contents": "State Savings Bank is a full-service community bank dedicated to caring for the financial needs of our neighbors in Grand Traverse County. We offer checking and savings accounts, CDs, IRAs; mortgage, home equity, consumer, and commercial loans; and business cash management including ACH and remote deposit. "
  }, 
  {
    "id": "https://www.serrasubaruoftraversecity.com/", 
    "contents": "Want to know why drivers keep coming back from Kalkaska, Kingsley, Manton and Rapid City, MI, for New and Used Cars? Visit Serra Subaru of Traverse City. "
  }, 
  {
    "id": "https://kensingtonchurch.org/campus/traverse-city/", 
    "contents": "Patrick Holden. Welcome to Kensington Traverse City. I’m Patrick Holden, and I’m the Lead Pastor of Kensington’s 8th campus, launched in September of 2016. "
  }, 
  {
    "id": "http://realestate.mlive.com/michigan/grand-traverse-county/traverse-city", 
    "contents": "Looking to rent or buy a property in Traverse City Michigan? Find thousands of real estate / mls listings and rental properties at MLive.com "
  }, 
  {
    "id": "https://www.choicehotels.com/michigan/traverse-city/comfort-inn-hotels/mi344", 
    "contents": "Book now at the Comfort Inn Traverse City hotel. This Traverse City hotel is near Traverse City State Park and Cherry Capital Airport. Free airport shuttle. "
  }, 
  {
    "id": "https://locations.crackerbarrel.com/mi/traverse-city/464/", 
    "contents": "Store information for your local Traverse City, MI Cracker Barrel restaurant. Get delicious family, homestyle cooking and country food for breakfast, lunch, and dinner. "
  }, 
  {
    "id": "http://tvcairport.com/", 
    "contents": "TVC Awarded Airport of the Year (Traverse City, MI) February 23rd, 2018 – Cherry Capital Airport (TVC) was awarded Airport of the Year by MDOT-AERO (2017), for the outstanding efforts associated with the rehabilitation and extension of Runway 10/28. "
  }, 
  {
    "id": "https://koa.com/campgrounds/traverse-city/", 
    "contents": "Traverse City KOA is located in Buckley, Michigan and offers great camping sites! Click here to find out more information or to book a reservation. "
  }, 
  {
    "id": "https://www.serratraversecity.com/", 
    "contents": "Serra Traverse City of Traverse City MI serving Cadillac, Manistee, Ludington Gaylord is one of the finest Group dealerships. Please research our website for your next vehicle purchase. "
  }, 
  {
    "id": "https://www.gvsu.edu/traverse/", 
    "contents": "Traverse City Regional Center, Northern Michign Programs, Social Work, Physician Assistant, Liberal Studies, Public Health, Occupational Therapy, Allied Health Degree, University, Traverse City "
  }, 
  {
    "id": "https://www.resortsandlodges.com/lodging/usa/michigan/traverse-city.html", 
    "contents": "Traverse City Resorts and Lodges: Resort directory featuring a complete list of 29 Resorts and Lodges. Browse property descriptions, reviews, photos, video, rates, number of rooms, amenities, activities and much more. "
  }, 
  {
    "id": "http://tcchamber.org/", 
    "contents": "Growing the business community that makes northwest lower Michigan thrive. Creating a better place to live, work, play, and raise a family. "
  }, 
  {
    "id": "https://suburbanstats.org/population/michigan/how-many-people-live-in-traverse-city", 
    "contents": "Traverse City Michigan Population 2017 2018, Traverse City Michigan Population 2018, Traverse City Michigan Population 2017, Traverse City Michigan Demographics 2017 2018, Traverse City Michigan Statistics 2017 2018 "
  }, 
  {
    "id": "https://www.niche.com/places-to-live/traverse-city-grand-traverse-mi/", 
    "contents": "See what it's like to live in Traverse City, MI. Explore reviews and statistics on crime, real estate, and cost of living. "
  }, 
  {
    "id": "https://www.stateandbijou.org/calendar", 
    "contents": "State Theatre 233 E. Front St. Traverse City MI 49684 231-947-3446 Bijou by the Bay 181 E. Grandview Parkway Traverse City MI 49684 231-486-5222 "
  }, 
  {
    "id": "https://www.theknot.com/marketplace/wedding-reception-venues-traverse-city-mi", 
    "contents": "Find, research and contact wedding reception venues in Traverse City on The Knot, featuring reviews and info on the best wedding vendors. "
  }, 
  {
    "id": "https://www.tcbeaches.com/", 
    "contents": "Welcome to the best waterfront hotel resorts located in Traverse City, Michigan. Traverse City hotels with over 600' of sandy beaches. "
  }
]