[
  {
    "id": "https://www.allrecipes.com/recipes/16979/fruits-and-vegetables/beans-and-peas/cannellini-beans/", 
    "contents": "With cannellini bean recipes from soups to salads and more, Allrecipes has more than 110 trusted cannellini bean recipes for you to try. "
  }, 
  {
    "id": "https://www.bushbeans.com/en_US/product/cannellini-beans", 
    "contents": "This favorite from the Mediterranean pairs well with many summer foods. Its silky texture and nutty flavor complement tuna and pasta salads. Learn more about BUSH’S® Cannellini Beans. "
  }, 
  {
    "id": "https://recipes.search.yahoo.com/search?p=cannellini%20beans", 
    "contents": ""
  }, 
  {
    "id": "https://images.search.yahoo.com/search/images?p=cannellini+beans", 
    "contents": "More Cannellini Beans images "
  }, 
  {
    "id": "http://www.cannellini.com/", 
    "contents": "Cannellini-beans.com contains information about Cannellini beans and where to buy them. Nutrition data, history, origins. "
  }, 
  {
    "id": "https://www.cooksillustrated.com/how_tos/5446-cannellini-bean-substitute", 
    "contents": "Dried cannellini beans can be difficult to find. Are dried great Northern or navy beans comparable replacements? "
  }, 
  {
    "id": "https://www.foodnetwork.com/recipes/anne-burrell/cannellini-beans-recipe-2012487", 
    "contents": "Get Cannellini Beans Recipe from Food Network. 1 pound dried cannellini beans; 1 rib celery, broken in 1/2; 1 large or two small carrots, peeled and broken in 1/2 "
  }, 
  {
    "id": "http://www.wisegeek.com/what-are-cannellini-beans.htm", 
    "contents": "Cannellini beans are a popular variety of white beans. High in iron, magnesium, and folate, cannellini beans are excellent for... "
  }, 
  {
    "id": "https://video.search.yahoo.com/search/video?p=cannellini+beans", 
    "contents": "More Cannellini Beans videos "
  }, 
  {
    "id": "https://www.bonappetit.com/recipes/article/12-easy-ways-to-cook-a-can-of-cannellini-beans", 
    "contents": "...about what to do with a can of cannellini beans. And we came up with 12 easy, awesome recipes, from white-bean fritters to jalapeno flautas "
  }, 
  {
    "id": "https://draxe.com/cannellini-beans/", 
    "contents": "You may know them as white kidney beans, but no matter what you call them, cannellini beans benefit health in so many ways. Here's how. "
  }, 
  {
    "id": "http://www.healwithfood.org/health-benefits/cannellini-beans.php", 
    "contents": "When boiled long enough, cannellini beans lose their toxicity and become a real super food with extraordinary health benefits. Cannellini beans lead the pack of low glycemic legumes, promote intestinal health, and provide an abundant supply of molybdenum, antioxidants, copper, and protein. "
  }, 
  {
    "id": "https://www.bbcgoodfood.com/glossary/cannellini-bean", 
    "contents": "Slightly kidney-shaped with squarish ends, cannellini beans are from Italy and are creamy white in colour. When cooked, they have a fluffy texture and a slightly nutty, mild flavour. "
  }, 
  {
    "id": "https://www.marthastewart.com/285798/cannellini-bean-soup", 
    "contents": "A dietary staple in Italian cuisine, cannellini beans bring tremendous flavor to this soup. Make it a day ahead of time -- it will taste even better when you're ready to eat it. "
  }, 
  {
    "id": "https://www.bbcgoodfood.com/glossary/cannellini-bean", 
    "contents": "Slightly kidney-shaped with squarish ends, cannellini beans are from Italy and are creamy white in colour. When cooked, they have a fluffy texture and a slightly nutty, mild flavour. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Cannellini_bean", 
    "contents": "The navy bean, haricot, pearl haricot bean, boston bean, white pea bean, or pea bean, is a variety of the common bean (Phaseolus vulgaris) native to the Americas, where it was domesticated. "
  }, 
  {
    "id": "https://draxe.com/cannellini-beans/", 
    "contents": "You may know them as white kidney beans, but no matter what you call them, cannellini beans benefit health in so many ways. Here's how. "
  }, 
  {
    "id": "https://www.bbc.com/food/cannellini_beans", 
    "contents": "A small, white, kidney-shaped bean that is good for using in salads and casseroles. The dried variety needs to be soaked in cold water before cooking. "
  }, 
  {
    "id": "https://www.eatthismuch.com/food/view/cannellini-beans,162162/", 
    "contents": "View the nutrition for Cannellini Beans, including calories, carbs, fat, protein, cholesterol, and more (Box, No Salt - 365 Everyday Value). Want to use it in a meal plan? "
  }, 
  {
    "id": "https://www.merriam-webster.com/dictionary/cannellini%20bean", 
    "contents": "These example sentences are selected automatically from various online news sources to reflect current usage of the word 'cannellini bean.' Views expressed in the examples do not represent the opinion of Merriam-Webster or its editors. Send us feedback ... "
  }, 
  {
    "id": "https://www.bonappetit.com/recipe/cannellini-beans-with-spinach", 
    "contents": "If there is a lot of liquid in the pan when the spinach is done, drain it before adding the beans. "
  }, 
  {
    "id": "https://www.allrecipes.com/recipes/16979/fruits-and-vegetables/beans-and-peas/cannellini-beans/?page=3", 
    "contents": "With cannellini bean recipes from soups to salads and more, Allrecipes has more than 110 trusted cannellini bean recipes for you to try. "
  }, 
  {
    "id": "https://www.marthastewart.com/1513958/cannellini-beans-recipes", 
    "contents": "Looking for cannellini beans recipes? Find here warm soups, salads, pasta with cannellini, dips and more ideas featuring these white beans. "
  }, 
  {
    "id": "https://www.healwithfood.org/health-benefits/cannellini-beans.php", 
    "contents": "When boiled long enough, cannellini beans lose their toxicity and become a real super food with extraordinary health benefits. Cannellini beans lead the pack of low glycemic legumes, promote intestinal health, and provide an abundant supply of molybdenum, antioxidants, copper, and protein. "
  }, 
  {
    "id": "https://www.gourmetsleuth.com/ingredients/detail/cannellini-beans", 
    "contents": "Cannellini Beans are large white Italian kidney beans available both dried and canned. Soak dried beans overnight, then boiled for 10 minutes,reduce the heat and simmer for about 1-2 hours or until tender. "
  }, 
  {
    "id": "https://woodlandfoods.com/products/cannellini-beans/c-23/p-10693", 
    "contents": "Cannellini Beans are white kidney beans with a mild, nutty flavor and smooth, tender texture. They are extremely popular in Italian cuisine. Also known as \"Italian white kidney beans\" or \"fasolia beans,\" they resemble kidney beans in size and shape, but are creamy off-white in color. "
  }, 
  {
    "id": "http://www.geniuskitchen.com/recipe/cannellini-bean-soup-292594", 
    "contents": "We eat a lot of bean based soups in this house and I am always looking for another one to try. Cannellini beans are some of my favorites so I had to grab this recipe when I saw it in the Winter 2008 copy of the BBC Easy Cook magazine. "
  }, 
  {
    "id": "https://foodnessgracious.com/cannellini-bean-salad/", 
    "contents": "A light and healthy Cannellini Bean Salad tossed in a lemon and olive oil dressing. This is a perfect side salad to any grilled meat or take it to a summer pot luck! "
  }, 
  {
    "id": "https://www.simplyrecipes.com/recipes/ingredient/cannellini_bean/", 
    "contents": "Looking for the best Cannellini Bean recipes? Get recipes like How To Make Fast, No-Soak Beans in the Pressure Cooker, Easy Tuscan Bean Soup and Creamy Tomato and White Bean Soup from Simply Recipes. "
  }, 
  {
    "id": "https://www.foodandwine.com/beans-legumes/cannellini-bean/cannellini-bean-recipes", 
    "contents": "Seafood, salad, soup and more Food and Wine Recipes featuring cannellini beans. "
  }, 
  {
    "id": "https://www.tasteofhome.com/recipes/sausage---cannellini-bean-soup/", 
    "contents": "Here's my reproduction of a dish from a famous Chicago eatery. We think it rivals the original. I usually cook this at least once a week. It's a tasty way to keep my lunchbox full of healthy options. &mdash;Marilyn McGinnis, Peoria, Arizona "
  }, 
  {
    "id": "https://www.bushbeans.com/en_US/recipe/tuna-and-cannellini-bean-salad", 
    "contents": "Make this tasty Tuna and Cannellini Bean Salad recipe using BUSH’S® Beans. Explore this and other recipes at BushBeans.com! "
  }, 
  {
    "id": "https://www.camelliabrand.com/4-types-of-white-beans-whats-the-difference/", 
    "contents": "Have you ever seen the term “white beans” and wondered if it was referring to Navy beans, Great Northern beans, Cannellini beans, or Baby Lima beans? Well, it could be referring to any and all of them. And since there are so many varieties of white beans, it’s easy to be confused by what ... "
  }, 
  {
    "id": "https://www.foodnetwork.com/recipes/melissa-darabian/sauteed-cannellini-beans-recipe-1923212", 
    "contents": "Get Sauteed Cannellini Beans Recipe from Food Network "
  }, 
  {
    "id": "https://www.foodandwine.com/beans-legumes/cannellini-bean/cannellini-bean-recipes", 
    "contents": "Seafood, salad, soup and more Food and Wine Recipes featuring cannellini beans. "
  }, 
  {
    "id": "https://www.bobsredmill.com/cannellini-beans.html", 
    "contents": "Bob's Red Mill's Cannellini Beans are a great source of protein with great health benefits. Shop today and get free shipping on orders over $50! "
  }, 
  {
    "id": "https://www.bushbeans.com/en_US/recipe/tuna-and-cannellini-bean-salad", 
    "contents": "Make this tasty Tuna and Cannellini Bean Salad recipe using BUSH’S® Beans. Explore this and other recipes at BushBeans.com! "
  }, 
  {
    "id": "https://www.foodandwine.com/beans-legumes/cannellini-bean", 
    "contents": "Looking for Cannellini Bean recipes? Find the best Cannellini Bean ideas on Food & Wine with recipes that are fast & easy. "
  }, 
  {
    "id": "https://www.epicurious.com/recipes/food/views/escarole-with-cannellini-beans", 
    "contents": "This makes an extra quart of cooked beans. Save (or freeze) for another batch of escarole, or serve them simply warmed in their broth. "
  }, 
  {
    "id": "https://www.foodpleasureandhealth.com/blog/2017/03/cannellini-bean-salad-with-basil-and-sun-dried-tomatoes.html", 
    "contents": "Cannellini Bean Salad with Basil and Sun-Dried Tomatoes makes a lovely light lunch or can be enjoyed as a refreshing side, or take it to a picnic, potluck. "
  }, 
  {
    "id": "https://www.tasteofhome.com/recipes/cannellini-bean-salad", 
    "contents": "Here's a perfect side dish for a backyard picnic or barbecue. Celery and red pepper accent this bean salad that's dressed with a mild oil and vinegar dressing. "
  }, 
  {
    "id": "https://www.yummly.com/recipes/chicken-cannellini-beans#!", 
    "contents": "The Best Chicken Cannellini Beans Recipes on Yummly | Fast White Bean Stew, Tuscan Chicken Pitas, Chicken With Tomato And Bean Stew "
  }, 
  {
    "id": "https://www.realsimple.com/food-recipes/browse-all-recipes/cannellini-bean-stew", 
    "contents": "Cannellini Bean Stew. To all: Sometimes Extra Virgin olive oil is added at the END of a dish purely for flavor. "
  }, 
  {
    "id": "https://www.northbaytrading.com/cannellini-bean", 
    "contents": "Shop Cannellini Beans at NorthBayTrading.com, buy in retail or bulk packages. "
  }, 
  {
    "id": "https://www.camelliabrand.com/products/cannellini-beans/", 
    "contents": "Camellia Brand Cannellini Beans are large white beans that cook up creamy and smooth with a nutty flavor. Especially popular in Italian cuisine, they are often found in soups like minestrone, or paired with tuna, but can be used in any recipe calling for Navy or Great Northern beans. "
  }, 
  {
    "id": "https://foodbabe.com/marinated-cannellini-bean-salad/", 
    "contents": "This chilled bean salad recipe is perfect for a backyard BBQ on a hot day or for a simple protein-packed lunch! I've always loved to eat tangy bean salads, but never the stale store-bought versions that are usually made with inflammatory soybean oil and added sweeteners. "
  }, 
  {
    "id": "https://www.yummly.com/recipes/cannellini-bean-side-dish", 
    "contents": "The Best Cannellini Bean Side Dish Recipes on Yummly | Mashed White Beans, Zucchini With Quinoa Stuffing, Cannellini Beans With Garlic And Sage "
  }, 
  {
    "id": "https://www.davidwolfe.com/cannellini-beans-benefits/", 
    "contents": "Cannellini beans, which are part of the legume family, are an excellent choice when it comes to a high-fiber and high-protein food. You typically find these beans dry, and they can be used in several different dishes. "
  }, 
  {
    "id": "https://www.deliaonline.com/ingredient/cannellini-beans", 
    "contents": "There are three main types of haricot bean: firstly, the long, thin, shiny-ivory one that the Italians sometimes call cannellini. These are delicious in salads, stews, and Tuscan bean and pasta soup; they are also the kind used in France, cooked in the Br "
  }, 
  {
    "id": "http://www.geniuskitchen.com/recipe/penne-with-cannellini-beans-152412", 
    "contents": "This is a quick, 5 ingredient recipe. It comes from Light and Tasty. You should definitely be using the Italian-style diced tomatoes that come already seasoned with herbs for flavor. "
  }, 
  {
    "id": "https://www.simpletruth.com/products/cannellini-beans/", 
    "contents": "Ingredients. Water, Organic Cannellini Beans, Sea Salt. *Actual product packaging and materials may contain additional and/or different ingredient, nutritional, or proper usage information than the information displayed on our website. "
  }, 
  {
    "id": "https://www.pillsbury.com/recipes/cannellini-bean-veggie-burgers/11264b61-46a7-4f8d-bbc6-526132f7e7c1", 
    "contents": "Enjoy these tasty bean patties made using Progresso® Italian style bread crumbs - a perfect dinner that’s ready in 25 minutes. "
  }, 
  {
    "id": "https://www.cookincanuck.com/cannellini-bean-vegetarian-meatballs-with-tomato-sauce-recipe/", 
    "contents": "Why should you have to miss out on 'meatballs' if you don't eat meat? This vegetarian version is satisfying & easy to make. Before I met my husband, I wasn’t much of a bean eater. "
  }, 
  {
    "id": "https://www.bettycrocker.com/recipes/turkey-and-cannellini-bean-chili/7f3f156b-5625-42fa-8fbb-18b359684f58", 
    "contents": "For a leaner take on chili, use ground turkey in place of ground beef, and combine with cannellini beans and green chiles for extra flavor. "
  }, 
  {
    "id": "https://www.realsimple.com/food-recipes/recipe-collections-favorites/cannellini-bean-recipes", 
    "contents": "A can of these is cheap and can live for up to two years in your cupboard. But what’s even better is that the creamy, protein-packed beans make soups, salads, and dips deliciously hearty. Think you’ve bean there, done that? These fast, no-cook recipes just might change your mind ... "
  }, 
  {
    "id": "http://www.italianfoodforever.com/2018/02/creamy-cannellini-rosemary-soup/", 
    "contents": "Cucina povera at its best! A creamy, hearty soup made from canned or dried beans. "
  }, 
  {
    "id": "https://www.thebeaderchef.com/sausage-cannellini-beans-white-wine/", 
    "contents": "Tied together with sautéed onions and carrots, this Sausage and Cannellini Beans in White Wine recipe has all the wonderful deliciousness cooking in one pan! "
  }, 
  {
    "id": "https://www.chowhound.com/recipes/cannellini-bean-dip-24709", 
    "contents": "This easy, healthy dip is made with tangy whipped white beans, olive oil, and chives. "
  }, 
  {
    "id": "https://www.splendidtable.org/recipes/cannellini-beans-with-pancetta-spinach", 
    "contents": "Creamy beans, salty pancetta, and bright color from the spinach -- a winning combination on the fly! "
  }, 
  {
    "id": "https://mayihavethatrecipe.com/meatless-monday-kale-cannellini-bean-soup/", 
    "contents": "Things I've learned over the past month, part deux: - Having your house on the market is no fun - Apartment hunting is no fun - All the paperwork involved in putting your house on the market and renting an apartment, is no fun - Packing is no fun - Doing all of the above while starting a new job, is no fun - Getting no sleep, is no fun You know ... "
  }, 
  {
    "id": "https://www.sparkpeople.com/calories-in.asp?food=cannellini+beans", 
    "contents": "Calories in Cannellini Beans based on the calories, fat, protein, carbs and other nutrition information submitted for Cannellini Beans. "
  }, 
  {
    "id": "https://www.livestrong.com/article/533050-can-you-substitute-kidney-bean-for-cannellini-bean/", 
    "contents": "Understanding the difference between the cannellini and kidney beans can help you decide if a substitution is possible, depending largely on the recipe you... "
  }, 
  {
    "id": "https://www.wegmans.com/products/grocery-food/vegetables/beans/cannellini-beans.html", 
    "contents": "Gluten free. Lactose free. Vegan. Heart healthy. While many factors affect heart disease, diets low in saturated fat and cholesterol may reduce the risk of this disease. "
  }, 
  {
    "id": "https://www.eatthismuch.com/food/view/cannellini-beans,140919/", 
    "contents": "View the nutrition for Cannellini Beans, including calories, carbs, fat, protein, cholesterol, and more (Tesco). Want to use it in a meal plan? Head to the diet generator and enter the number of calories you want. "
  }, 
  {
    "id": "https://foodtolive.com/shop/cannellini-beans/", 
    "contents": "Buy Cannellini Beans online from Food to Live and enjoy all the health benefits they offer. Free Shipping, No Tax. Order now! "
  }, 
  {
    "id": "https://www.doterra.com/US/en/blog/recipe-cannellini-bean-bowl", 
    "contents": "The perfect side dish for any meal. Instructions. Drain can of beans, reserving two to three tablespoons of liquid. "
  }, 
  {
    "id": "http://www.myrecipes.com/recipe/cannellini-bean-stew", 
    "contents": "Learn how to make Cannellini Bean Stew. MyRecipes has 70,000+ tested recipes and videos to help you be a better cook. "
  }, 
  {
    "id": "https://www.finecooking.com/ingredient/cannellini-beans", 
    "contents": "These large Italian beans are one of the many varieties of the common bean. They are ivory in color, relatively large and long when cooked, with a creamy texture. When a recipe simply calls for “white beans,” cannellini are an excellent, widely available choice. Choose dried beans that look ... "
  }, 
  {
    "id": "https://recipes.sparkpeople.com/great-recipes.asp?food=cannellini+bean", 
    "contents": "Top cannellini bean recipes and other great tasting recipes with a healthy slant from SparkRecipes.com. "
  }, 
  {
    "id": "https://www.abeautifulplate.com/slow-cooker-cannellini-bean-soup-with-fresh-rosemary/", 
    "contents": "Slow Cooker Cannellini Bean Soup with Fresh Rosemary - this soup is packed with flavor, healthy protein and fiber, and only a handful of ingredients! "
  }, 
  {
    "id": "https://www.theguardian.com/lifeandstyle/2015/apr/25/cannellini-beans-recipes-batch-cooking-get-ahead", 
    "contents": "Get ahead: Welcome to our new column for the busy home cook. First up, four meals fashioned from the same pan of cannellini beans "
  }, 
  {
    "id": "https://www.precisionnutrition.com/encyclopedia/food/cannellini-beans", 
    "contents": "Cannellini beans are large white beans that, when cooked, have a creamy texture and mild flavor. One cup of cooked cannellini beans contains over 15 grams of protein. "
  }, 
  {
    "id": "https://www.weightwatchers.com/us/recipe/kale-bacon-and-cannellini-beans-1/5626a62d3d92b3c10eb8d0aa", 
    "contents": "Enjoy a tasty and delicious meal with your loved ones. Learn how to make Kale with Bacon and Cannellini Beans & see the Smartpoints value of this great recipe. "
  }, 
  {
    "id": "https://www.deliaonline.com/ingredient/cannellini-beans", 
    "contents": "Cannellini beans. There are three main types of haricot bean: firstly, the long, thin, shiny-ivory one that the Italians sometimes call cannellini. These are delicious in salads, stews, and Tuscan bean and pasta soup; they are also the kind used in France, cooked in the Breton way and served with mutton and lamb. "
  }, 
  {
    "id": "https://www.forksoverknives.com/recipes/cannellini-bean-sauce/", 
    "contents": "1. Purée the beans, garlic, and tamari in a food processor until very smooth, adding water as needed: use more water for a thinner dressing, or less for a thicker dip. "
  }, 
  {
    "id": "https://www.pillsbury.com/recipes/chicken-and-cannellini-bean-salad/5a0b2a44-91e1-40e7-9efc-4007cd77dca3#!", 
    "contents": "Dinner ready in 20 minutes! Enjoy this yummy chicken and beans salad coated with vinaigrette – a delightful meal. "
  }, 
  {
    "id": "https://www.tasteofhome.com/recipes/cannellini-bean-salad", 
    "contents": "2 cans (15 ounces each) cannellini or white kidney beans, rinsed and drained. 3 celery ribs with leaves, sliced. 3/4 cup chopped red onion. 1/2 cup chopped sweet red pepper. 1/2 cup minced fresh parsley. 1/4 cup chopped green onions. 2 tablespoons olive oil. 2 tablespoons balsamic vinegar. "
  }, 
  {
    "id": "https://www.weightwatchers.com/us/recipe/kale-bacon-and-cannellini-beans-1/5626a62d3d92b3c10eb8d0aa", 
    "contents": "Enjoy a tasty and delicious meal with your loved ones. Learn how to make Kale with Bacon and Cannellini Beans & see the Smartpoints value of this great recipe. "
  }, 
  {
    "id": "https://www.davidwolfe.com/cannellini-beans-benefits/", 
    "contents": "Cannellini beans benefits also include the ability to fight free radicals, thanks to a high level of antioxidants. Additionally, cannellini beans contain polyphenols, which is a type of antioxidant that can decrease your risk of heart disease as well as cancer. "
  }, 
  {
    "id": "http://jessicaseinfeld.com/recipes/cannellini-bean-soup", 
    "contents": "A quick and easy recipe for Cannellini Bean Soup Recipe from Jessica Seinfeld "
  }, 
  {
    "id": "http://www.territorialseed.com/product/Cannellini_Lingot_Bean_Seed/dry_shelling_beans_seed", 
    "contents": "Our Cannellini Lingot variety produces delectable, hearty beans in 6-8 inch pods on bush-type plants that reach 22-26 inches tall. Open Pollinated Approximately 45 seeds per ounce. "
  }, 
  {
    "id": "https://foodchannel.com/recipes/escarole-with-cannellini-beans", 
    "contents": "Escarole with Cannellini Beans recipe. This traditional Italian combination of mellow white beans and earthy dark greens can be served in a variety of ways: as a salad to start a meal, as a side dish or base for roasted or grilled meats or poultry, or as a sauce for bite-size al dente pasta. "
  }, 
  {
    "id": "https://www.bbcgoodfood.com/recipes/1363664/cannellini-bean-cherry-tomato-and-red-onion-salad", 
    "contents": "A superhealthy salad that counts as 3 of your 5-a-day and is low fat - great for al fresco eating. From BBC Good Food magazine. "
  }, 
  {
    "id": "https://www.wikihow.com/Prepare-Cannellini-Beans", 
    "contents": "How to Prepare Cannellini Beans. Sometimes referred to as \"white kidney beans\", these beans are used in many Mediterranean meals such as minestrone, salads, and soups with tomato bases. "
  }, 
  {
    "id": "https://www.thebeaderchef.com/escarole-cannellini-bean-soup/", 
    "contents": "Escarole is a underused greens and is great in soups like this one! Garlic, escarole, and cannellini beans come together in this quick to make soup! "
  }, 
  {
    "id": "https://cookingbride.com/soups-and-stews/cannellini-bean-sausage-and-kale-soup/", 
    "contents": "Warm up with this healthy recipe Cannellini Bean, Sausage and Kale Soup. Italian sausage is simmered in tomato broth with tender cannellini beans, vegetables, and kale. "
  }, 
  {
    "id": "https://www.williams-sonoma.com/recipe/escarole-with-cannellini-beans.html", 
    "contents": "Pick over the beans, removing any misshapen beans or grit. Rinse under cold running water. Put the beans in a large bowl, add cold water to cover by at least 2 inches and let stand at room temperature overnight. Alternatively, for a quick soak, put the beans in a large pot, add water to cover by at ... "
  }, 
  {
    "id": "http://www.dictionary.com/browse/cannellini-bean", 
    "contents": "Cannellini bean definition, a medium-sized, white, oval bean with a thin skin and mild flavor. See more. "
  }, 
  {
    "id": "https://spoonuniversity.com/lifestyle/cannellini-beans-vs-great-northern-beans", 
    "contents": "When a recipe calls for white beans, I'm just as confused as the next person. With rows and rows of beans lining the grocery store shelves, which am I to choose? The cans aren't exactly labeled so simply. And contrary to my prior beliefs, cannellini beans and Great Northern beans have differences ... "
  }, 
  {
    "id": "https://recipeforperfection.com/cannellini-bean-dip/", 
    "contents": "Make this delicious cannellini bean dip for your favorite crackers or veggies! You can even use it as a tasty sandwich spread. Get the simple recipe! "
  }, 
  {
    "id": "https://www.bobsredmill.com/recipes/how-to-make/creamy-cannellini-bean-dip/", 
    "contents": "Try Creamy Cannellini Bean Dip from Bob's Red Mill. Visit today and start cooking! "
  }, 
  {
    "id": "https://www.positivehealthwellness.com/diet-nutrition/need-know-cannellini-beans/", 
    "contents": "As you can see, cannellini beans are a pretty awesome food! They're rich in nutrients, fairly low in calories, and provide a hefty dose of protein. "
  }, 
  {
    "id": "https://www.bbcgoodfood.com/recipes/1363664/cannellini-bean-cherry-tomato-and-red-onion-salad", 
    "contents": "A superhealthy salad that counts as 3 of your 5-a-day and is low fat - great for al fresco eating. From BBC Good Food magazine. "
  }, 
  {
    "id": "https://www.northbaytrading.com/beans-lentils/beans/cannellini-bean", 
    "contents": "Shop Cannellini Beans at NorthBayTrading.com, buy in retail or bulk packages. "
  }, 
  {
    "id": "https://pickyeaterblog.com/cannellini-bean-gratin/", 
    "contents": "At one of my favorite restaurants in SF, Nopa, they serve the most delicious baked white beans, topped with feta, herbs and breadcrumbs. It comes warm and sizzling in a skillet: crispy from the breadcrumbs, creamy from the beans, and with a little bit of bite from the feta. "
  }, 
  {
    "id": "https://www.ifsbulk.com/wholesale-cannellini-beans", 
    "contents": "Wholesale Cannellini Beans in sizes for your restaurant or market to save money. We offer sizes starting at 25 pounds and up. "
  }, 
  {
    "id": "http://tastykitchen.com/recipes/salads/cannellini-bean-salad/", 
    "contents": "Preparation. Drain and rinse cannellini beans. In a large serving dish combine cannellini beans, sliced cherry tomatoes, sliced onions, crumbled feta and basil leaves and toss to combine. "
  }, 
  {
    "id": "https://www.purplecarrot.com/plant-based-recipes/cannellini-bean-burger-with-caper-aioli-and-fennel", 
    "contents": "These aren’t your average veggie burgers! Cannellini beans are rich and creamy, and parsley, lemon, and red pepper flakes add loads of brightness. "
  }, 
  {
    "id": "https://simpleveganblog.com/15-minute-cannellini-bean-stew/", 
    "contents": "This tasty 15-minute cannellini bean stew is a super healthy, nutritious, quick and easy meal which is ready in less than 15 minutes. "
  }, 
  {
    "id": "https://www.huffingtonpost.com/2015/03/12/white-bean-recipes-photos_n_4183871.html", 
    "contents": "Most well-stocked pantries are equipped with a can or two of white beans, one of those versatile ingredients that can quickly be cooked into a meal. W... "
  }
]