[
  {
    "id": "https://recipes.search.yahoo.com/search?p=beef%20stroganoff", 
    "contents": ""
  }, 
  {
    "id": "https://www.simplyrecipes.com/recipes/beef_stroganoff/", 
    "contents": "Oh Beef Stroganoff—the ultimate comfort food! Tender strips of beef and mushrooms are first sautéed in butter, then swirled with sour cream to make a creamy sauce, and served over noodles, rice, or fries. "
  }, 
  {
    "id": "https://www.allrecipes.com/recipe/25202/beef-stroganoff-iii/", 
    "contents": "In a large skillet over medium heat, melt the butter and brown the beef strips quickly, then push the beef strips off to one side. Add the onions and cook slowly for 3 to 5 minutes, then push to the side with the beef strips. Stir the flour into the juices on the empty side of the pan. Pour in beef broth and bring to a boil, stirring constantly. "
  }, 
  {
    "id": "https://www.bettycrocker.com/recipes/classic-beef-stroganoff/c17a904f-a8f6-48ae-bedb-5b301a8ea317", 
    "contents": "Basic ingredients, quick prep and great flavor—all reasons that this dish is a classic! "
  }, 
  {
    "id": "https://www.foodnetwork.com/recipes/paula-deen/beef-stroganoff-recipe-1940482", 
    "contents": "Total: 45 min. Yield: 4 servings. For a comforting weeknight dinner, make Paula Deen's mushroom-loaded Beef Stroganoff recipe from Food Network, perfect over a bowl of egg noodles. You can also find 1000s of Food Network's best recipes from top chefs, shows and experts. And watch videos demonstrating recipe prep and cooking techniques. "
  }, 
  {
    "id": "https://www.allrecipes.com/recipe/11880/easy-beef-stroganoff/", 
    "contents": "A lusciously tart sauce of sauteed mushrooms, onions and sour cream is beefed up and served over tender egg noodles. Hint: do not bring the sour cream sauce to a boil. "
  }, 
  {
    "id": "https://www.foodnetwork.com/topics/beef-stroganoff-recipes", 
    "contents": "Beef Stroganoff Recipes Beef stroganoff is the ultimate comfort food. With switched-up ingredients and creative twists, these popular variations elevate the classic dish from familiar to fabulous. "
  }, 
  {
    "id": "https://video.search.yahoo.com/search/video?p=beef+stroganoff+recipe", 
    "contents": "More Beef Stroganoff Recipe videos "
  }, 
  {
    "id": "http://thepioneerwoman.com/cooking/beef-stroganoff/", 
    "contents": "beef stock cornstarch sour cream Dijon mustard noodles parsley an appetites ... Now, if you compare this to other images of regular Beef Stroganoff recipes, ... "
  }, 
  {
    "id": "https://www.thespruceeats.com/classic-beef-stroganoff-3051443", 
    "contents": "Add 1 clove of finely minced garlic to the same skillet used for cooking the beef. Saute for about 2 minutes; add to the beef and sauce mixture. Alternatively, add about 1/2 teaspoon of garlic powder to the sauce mixture. For extra an extra saucy stroganoff, increase the flour to 2 tablespoons and increase the beef broth to 1 1/2 cups. "
  }, 
  {
    "id": "https://www.epicurious.com/recipes/food/views/beef-stroganoff-102134", 
    "contents": "This Russian dish has been around for several centuries, but it wasn’t until the fifties that it became all the rage in the United States (despite our fear of Communism). Here is a delicious rendition that pays tribute to the \"gourmet\" chafing-dish dinner party. Now, as then, beef stroganoff is a ... "
  }, 
  {
    "id": "http://www.geniuskitchen.com/recipe/best-beef-stroganoff-73922", 
    "contents": "My mom made this beef stroganoff weekly when I was younger. I dont have the same metabolism I did then, but its still the best $%#And* beef stroganoff I have ever had. "
  }, 
  {
    "id": "https://www.epicurious.com/recipes/food/views/beef-stroganoff-102134", 
    "contents": "This Russian dish has been around for several centuries, but it wasn’t until the fifties that it became all the rage in the United States (despite our fear of Communism). Here is a delicious rendition that pays tribute to the \"gourmet\" chafing-dish dinner party. Now, as then, beef stroganoff is a ... "
  }, 
  {
    "id": "http://www.geniuskitchen.com/recipe/best-beef-stroganoff-73922", 
    "contents": "My mom made this beef stroganoff weekly when I was younger. I dont have the same metabolism I did then, but its still the best $%#And* beef stroganoff I have ever had. "
  }, 
  {
    "id": "https://www.tasteofhome.com/course/dinner-recipes/beef-dinner-recipes/beef-stroganoff/", 
    "contents": "Looking for recipes for beef stroganoff? Taste of Home has the best beef stroganoff recipes from real cooks, featuring reviews, ratings, how-to videos and tips. "
  }, 
  {
    "id": "https://www.marthastewart.com/336714/beef-stroganoff", 
    "contents": "Prep these beef stroganoff ingredients, cover the pot, and go! Simmering and braising beef stroganoff for a long time at a low temperature yields extra-intense flavor with little effort. "
  }, 
  {
    "id": "https://www.campbells.com/kitchen/recipes/beef-stroganoff/", 
    "contents": "Our classic beef stroganoff recipe owes it's rich flavor and creaminess to Campbell's® Condensed Cream of Mushroom Soup. It's also perfect to make now and freeze for later. "
  }, 
  {
    "id": "https://www.gimmesomeoven.com/easy-beef-stroganoff-recipe/", 
    "contents": "This easy beef stroganoff recipe is simple to make in just 30 minutes, it's lightened up a bit, and it's SO creamy and delicious! "
  }, 
  {
    "id": "https://www.pauladeen.com/recipe/beef-stroganoff/", 
    "contents": "Thin strips of round steak, onions & mushrooms over a bowl of egg noodles make this the perfect comfort food. Easy to make any night of the week. "
  }, 
  {
    "id": "https://www.recipetineats.com/beef-stroganoff/", 
    "contents": "Juicy beef smothered in a creamy mushroom and onion gravy. Beef Stroganoff is a crowd favourite that tastes like a slow cooked stew but is on the table in 30 minutes! "
  }, 
  {
    "id": "http://www.goldmedalflour.com/recipes/classic-beef-stroganoff/95c076bf-b4e2-4aa4-b7bd-715bcac7183f", 
    "contents": "Recipes; Classic Beef Stroganoff; Prep ... Classic Beef Stroganoff. Basic ingredients, quick prep and great flavor—all reasons that this dish is a classic! "
  }, 
  {
    "id": "https://www.lecremedelacrumb.com/slow-cooker-creamy-beef-stroganoff/", 
    "contents": "Slow cooker creamy beef stroganoff made with sour cream, stew meat, and no cream of soup! A healthy, easy crockpot version of classic beef stroganoff. "
  }, 
  {
    "id": "https://cooking.nytimes.com/recipes/1019085-beef-stroganoff", 
    "contents": "This classic recipe appeared in a 1963 Times article by Craig Claiborne about the increasing popularity of beef stroganoff (the article featured not one, but two slightly different recipes for the dish.) "
  }, 
  {
    "id": "https://www.lecremedelacrumb.com/slow-cooker-creamy-beef-stroganoff/", 
    "contents": "Slow cooker creamy beef stroganoff made with sour cream, stew meat, and no cream of soup! A healthy, easy crockpot version of classic beef stroganoff. "
  }, 
  {
    "id": "http://www.myrecipes.com/recipe/beef-stroganoff-10", 
    "contents": "This classic Beef Stroganoff recipe uses ingredients commonly kept on hand for an easy and delicious family meal. Garnish with fresh dill, if desired. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Strogonoff", 
    "contents": "Beef Stroganoff or Beef Stroganov (Russian: бефстроганов befstróganov) is a Russian dish of sautéed pieces of beef served in a sauce with smetana ().From its origins in mid-19th-century Russia, it has become popular around the world, with considerable variation from the original recipe. "
  }, 
  {
    "id": "https://www.thecountrycook.net/beef-stroganoff/", 
    "contents": "Ground Beef Stroganoff Beef stroganoff. Definitely a comfort food dish. For me, it's up on the list near fried chicken and okra. I love the humble roots of stroganoff. "
  }, 
  {
    "id": "https://shewearsmanyhats.com/beef-stroganoff-recipe/", 
    "contents": "Beef Stroganoff is made with beef, mushrooms and onions, plus a cast of delectable seasonings that mingle together to create this classic comfort food. "
  }, 
  {
    "id": "https://www.jamieoliver.com/recipes/beef-recipes/beef-stroganoff/", 
    "contents": "There are a myriad of beef stroganoff recipes, you will not be disappointed by Jamie's take on this classic dish of beef, soured cream and mushrooms. "
  }, 
  {
    "id": "http://www.hairybikers.com/recipes/view/beef-stroganoff", 
    "contents": "You may need to cook this in batches up to step 4, then mix everything together in a large pot before transferring to ovenproof dishes. "
  }, 
  {
    "id": "https://www.thewholesomedish.com/crock-pot-beef-stroganoff/", 
    "contents": "Crock Pot Beef Stroganoff is serious comfort food. Tender beef, mushrooms, and onions are cooked in a slow cooker and mixed with a sour cream sauce and egg noodles. I loooove this recipe! It’s hearty, rich, and unbelievably flavorful. And, the slow cooker does most of the work, making it a ... "
  }, 
  {
    "id": "https://www.campbells.com/kitchen/recipes/slow-cooker-creamy-beef-stroganoff/", 
    "contents": "Your slow cooker gets the job done with this savory stroganoff recipe featuring fork-tender beef in a creamy mushroom sauce. Prep it in the morning before work and you'll come home ready to serve a delicious dish the whole family will enjoy! "
  }, 
  {
    "id": "https://www.thewholesomedish.com/crock-pot-beef-stroganoff/", 
    "contents": "Crock Pot Beef Stroganoff is serious comfort food. Tender beef, mushrooms, and onions are cooked in a slow cooker and mixed with a sour cream sauce and egg noodles. I loooove this recipe! It’s hearty, rich, and unbelievably flavorful. And, the slow cooker does most of the work, making it a ... "
  }, 
  {
    "id": "https://norecipes.com/beef-stroganoff-recipe", 
    "contents": "Beef Stroganoff is such an easy meal and yet it's flavorful and comforting. My secrets for making the best Beef Stroganoff. "
  }, 
  {
    "id": "https://www.tasteofhome.com/recipes/slow-cooker-beef-stroganoff", 
    "contents": "No more standing and stirring at the stove. This creamy Stroganoff preps in a skillet, then cooks all day while you’re away. —Sarah C. Vasques, Milford, New Hampshire "
  }, 
  {
    "id": "https://www.bbc.com/food/recipes/beefstroganoffwithma_71568", 
    "contents": "Rick Stein cooks up a classic Russian beef stroganoff recipe, and reveals his incredibly moreish matchstick potatoes. "
  }, 
  {
    "id": "https://www.letsdishrecipes.com/2016/09/pressure-cooker-beef-stroganoff.html", 
    "contents": "Pressure cooker beef stroganoff, featuring tender chunks of beef in a savory mushroom sauce, ready in about 40 minutes in your Instant Pot. "
  }, 
  {
    "id": "https://www.marthastewart.com/341384/beef-stroganoff", 
    "contents": "Stir in the sour cream just before serving this hearty Russian dish. We chose tenderloin, but you can substitute trimmed rib-eye, which is less expensive. "
  }, 
  {
    "id": "http://www.kraftrecipes.com/recipes/dinner/stroganoff-recipes.aspx", 
    "contents": "Sure, we've got beef stroganoff recipes. We also have stroganoff recipes that showcase shrimp, chicken and short ribs. Welcome to Stroganoff Central! "
  }, 
  {
    "id": "https://www.myketokitchen.com/keto-recipes/low-carb-classic-beef-stroganoff/", 
    "contents": "This Keto Beef Stroganoff Recipe is a low carb slow cooker version of the classic Russian dish. Originating in Russia, Beef Stroganoff or Stroganov, is a dish of sauteed beef served with smetana - a European soured cream. "
  }, 
  {
    "id": "https://temeculablogs.com/easy-beef-stroganoff-casserole-recipe/", 
    "contents": "This easy beef stroganoff casserole recipe is totally amazing!! Super simple to make, creamy, and total comfort food that even my kids love. Topped with those crispy fried onions you love it's like beef stroganoff on another level. "
  }, 
  {
    "id": "https://www.daringgourmet.com/slow-cooker-beef-stroganoff/", 
    "contents": "A thoroughly delicious and fuss-free beef stroganoff for your slow cooker! Full of flavor with a creamy sauce you can enjoy over egg noodles or rice, this is a guaranteed family favorite! "
  }, 
  {
    "id": "http://www.kraftrecipes.com/recipes/dinner/stroganoff-recipes.aspx", 
    "contents": "Sure, we've got beef stroganoff recipes. We also have stroganoff recipes that showcase shrimp, chicken and short ribs. Welcome to Stroganoff Central! "
  }, 
  {
    "id": "https://www.thespruceeats.com/russian-beef-stroganoff-recipe-1137304", 
    "contents": "This recipe for Russian beef stroganoff (or bef stroganov or govjadina po strogonovski) is made with beef tenderloin, onion, and a sour cream sauce. "
  }, 
  {
    "id": "https://www.foodandwine.com/recipes/beef-stroganoff", 
    "contents": "Chef Jonathan Waxman's fantastic beef tenderloin stroganoff is enriched with creme fraiche and mustard and dotted with sauteed mushrooms. "
  }, 
  {
    "id": "https://vikalinka.com/2014/10/02/best-beef-stroganoff/", 
    "contents": "Best authentic Beef Stroganoff that is ready in under 30 minutes and uses simple everyday ingredients. "
  }, 
  {
    "id": "https://www.bbcgoodfood.com/recipes/beef-stroganoff", 
    "contents": "Make a classic beef stroganoff with steak and mushrooms for a tasty midweek meal. Garnish with parsley and serve with pappardelle pasta or rice "
  }, 
  {
    "id": "https://www.curiouscuisiniere.com/beef-stroganoff/", 
    "contents": "Our easy and authentic Russian Beef Stroganoff recipe combines tender beef and flavorful mushrooms in a creamy sauce for an elegant, yet quick dish. "
  }, 
  {
    "id": "https://www.simplyrecipes.com/recipes/hamburger_stroganoff/", 
    "contents": "Hamburger stroganoff made with ground beef in a sour cream mushroom sauce, with onions, parsley, paprika, served over egg noodles. "
  }, 
  {
    "id": "https://www.theguardian.com/lifeandstyle/wordofmouth/2016/nov/24/how-to-cook-the-perfect-beef-stroganoff", 
    "contents": "How to cook the perfect beef stroganoff ... Elena Molokhovets, who includes the first recipe for “stroganoff” in the 1871 edition of her book, ... "
  }, 
  {
    "id": "https://www.williams-sonoma.com/recipe/beef-stroganoff.html", 
    "contents": "Rated 5 out of 5 by tripeach from Vegetarian Version After reading these reviews and those of the vegetarian stroganoff on the William-Sonoma site, I decided to use this recipe as my basis. "
  }, 
  {
    "id": "https://www.yummly.com/recipes/beef-stroganoff-sour-cream-mushroom", 
    "contents": "The Best Beef Stroganoff Sour Cream Mushroom Recipes on Yummly | Sour Cream Beef Stroganoff, Slow Cookers Beef Stroganoff, Slow Cooker Beef Stroganoff "
  }, 
  {
    "id": "https://www.pillsbury.com/recipes/beef-stroganoff/b1ed969c-648a-4927-b59e-1161f8562568", 
    "contents": "Just as creamy as the classic, this delicious dish serves eight and is done in 35 minutes. "
  }, 
  {
    "id": "https://mommyshomecooking.com/easy-beef-stroganoff/", 
    "contents": "Very excited to try a favorite food, and your recipe for beef stroganoff looked incredibly easy. Unfortunately, there’s no way that step #3, (“cook till sauce is THICK and creamy, 8-10 minutes. 2 cups beef broth, 1 cup heavy cream , does not thicken. "
  }, 
  {
    "id": "https://lifemadesweeter.com/easy-beef-stroganoff/", 
    "contents": "Make Ahead Tips for this One Pot Beef Stroganoff. slice the beef ahead of time and store in a large zip-top freezer bag in the fridge; leftovers make a delicious lunch or dinner the net day. Just heat up with 1/4 cup of milk in a large skillet until heated through. "
  }, 
  {
    "id": "https://aseasyasapplepie.com/healthier-beef-stroganoff/", 
    "contents": "Beef stroganoff is a quick and easy weeknight meal that’s ready in 30 minutes and it tastes even better the next day. Feel free to make it a day in advance or double the recipe and freeze for later. "
  }, 
  {
    "id": "https://www.cdkitchen.com/recipes/dish/beef/beef-stroganoff/", 
    "contents": "beef stroganoff recipe finder Enter a word or two in the box to find recipes within the beef stroganoff section. You can search the title, ingredients, or entire recipe by selecting the appropriate option. "
  }, 
  {
    "id": "https://www.bhg.com/recipe/beef/beef-stroganoff/", 
    "contents": "Beef Stroganoff Serve this easy Beef Stroganoff sauce recipe over hot noodles for a quick comfort food dinner. It tastes just like traditional beef stroganoff, but comes together in a flash thanks to beef bouillon and thinly-sliced sirloin steak. "
  }, 
  {
    "id": "http://www.kraftcanada.com/recipes/dinner/beef-stroganoff-recipes", 
    "contents": "Serving up savoury, homemade comfort food is easy with these beef stew recipes. Stove-top or slow cooker beef stew recipes offer plenty of options for stirring up some hearty goodness in a bowl. "
  }, 
  {
    "id": "https://www.jamieoliver.com/recipes/beef-recipes/beef-stroganoff-fluffy-rice-red-onion-parsley-pickle/", 
    "contents": "Jamie's beef stroganoff recipe is a quick and easy hearty meal to suit the whole family, with a dollop of yoghurt and fluffy rice you can't go wrong. "
  }, 
  {
    "id": "https://showmetheyummy.com/slow-cooker-beef-stroganoff-recipe/", 
    "contents": "Love beef stroganoff? You’ll love my Slow Cooker Beef Stroganoff! It’s made in the crockpot, has no 'cream of x' soup, & uses my blend of spices! This Slow Cooker Beef Stroganoff is one of our most popular recipes (originally posted February 12, 2016), so I’ve updated it to include a how-to video! "
  }, 
  {
    "id": "http://abc.go.com/shows/the-chew/recipes/beef-stroganoff-clinton-kelly", 
    "contents": "Season steaks generously with salt and pepper. Place a large nonstick skillet over medium-high heat. Add a tablespoon of olive oil. Once hot, add the seasoned steaks, and cook to desired doneness, about 4 minutes per side for medium-rare. Remove steaks to platter and cover with foil. To the same pan ... "
  }, 
  {
    "id": "https://www.cdkitchen.com/recipes/dish/beef/beef-stroganoff/", 
    "contents": "Find lots of delicious recipes for beef stroganoff and over 100,000 other recipes with reviews and photos. "
  }, 
  {
    "id": "https://www.bonappetit.com/recipe/adams-beef-stroganoff", 
    "contents": "Check out Adam Rapoport's recipe for beef stroganoff. If you buy a whole 3-lb. beef tenderloin from the butcher, you can eyeball the weight called for here. "
  }, 
  {
    "id": "https://showmetheyummy.com/slow-cooker-beef-stroganoff-recipe/", 
    "contents": "Love beef stroganoff? You’ll love my Slow Cooker Beef Stroganoff! It’s made in the crockpot, has no 'cream of x' soup, & uses my blend of spices! This Slow Cooker Beef Stroganoff is one of our most popular recipes (originally posted February 12, 2016), so I’ve updated it to include a how-to video! "
  }, 
  {
    "id": "https://www.jamieoliver.com/recipes/beef-recipes/beef-stroganoff-fluffy-rice-red-onion-parsley-pickle/", 
    "contents": "Jamie's beef stroganoff recipe is a quick and easy hearty meal to suit the whole family, with a dollop of yoghurt and fluffy rice you can't go wrong. "
  }, 
  {
    "id": "http://abc.go.com/shows/the-chew/recipes/beef-stroganoff-clinton-kelly", 
    "contents": "Season steaks generously with salt and pepper. Place a large nonstick skillet over medium-high heat. Add a tablespoon of olive oil. Once hot, add the seasoned steaks, and cook to desired doneness, about 4 minutes per side for medium-rare. Remove steaks to platter and cover with foil. To the same pan ... "
  }, 
  {
    "id": "https://www.finecooking.com/recipe/classic-beef-stroganoff", 
    "contents": "This classic stroganoff recipe features thin slices of sautéed beef with mushrooms and onions in a sour cream sauce, all served over buttery egg noodles. It's a rich yet homey meal that comes together quickly enough to make even on a weeknight. "
  }, 
  {
    "id": "https://www.recipesthatcrock.com/crock-pot-beef-stroganoff/", 
    "contents": "This creamy Crock Pot Beef Stroganoff recipe is the ultimate comfort food and so easy to throw in the slow cooker on a busy day. Cris here. I found this recipe in Gooseberry Patch’s Slow-Cooker Christmas Favorites a while back and instantly added it to my menu. "
  }, 
  {
    "id": "https://www.afamilyfeast.com/beef-stroganoff/", 
    "contents": "Beef Stroganoff prepared the way it should be! Tender chunks of beef and sliced mushrooms in a fantastic, flavorful sauce. "
  }, 
  {
    "id": "http://www.kraftrecipes.com/recipes/slow-cooker-beef-stroganoff-60834.aspx", 
    "contents": "Prepare this classic Slow-Cooker Beef Stroganoff for your next family meal. Simply prep the pasta while the beef, garlic, onions and mushrooms simmer away. "
  }, 
  {
    "id": "https://www.thecountrycook.net/the-best-beef-stroganoff/", 
    "contents": "Mom's recipe for the best homemade beef stroganoff. No cream soups and made from scratch but still easy! So good and always a hit with my family! "
  }, 
  {
    "id": "https://www.thedailymeal.com/best-recipes/beef-stroganoff", 
    "contents": "From easy Beef Stroganoff recipes to masterful Beef Stroganoff preparation techniques, find Beef Stroganoff ideas by our editors and community in this recipe collection. "
  }, 
  {
    "id": "https://www.mayoclinic.org/healthy-lifestyle/recipes/beef-stroganoff/rcp-20049741", 
    "contents": "Instead of egg noodles, try this beef stroganoff over rice pilaf — a Middle Eastern dish with sauteed rice or other grains, seasonings and various vegetables. "
  }, 
  {
    "id": "https://www.eazypeazymealz.com/crock-pot-beef-stroganoff/", 
    "contents": "A fast and easy crock pot beef stroganoff that takes just a few minutes of prep work for a fantastic, hearty, family friendly meal. "
  }, 
  {
    "id": "https://www.pressurecookrecipes.com/instant-pot-beef-stroganoff/", 
    "contents": "Make Umami Instant Pot Beef Stroganoff Recipe (Pressure Cooker Beef Stroganoff)! A satisfying mouthful sensation of tender beef in addictive umami sauce. "
  }, 
  {
    "id": "https://www.epicurious.com/recipes/food/views/beef-stroganov-105587", 
    "contents": "Active time: 35 min Start to finish: 35 min This recipe makes good use of the tail-end portion of a tenderloin. "
  }, 
  {
    "id": "https://www.chelseasmessyapron.com/instant-pot-beef-stroganoff/", 
    "contents": "Creamy and flavorful beef stroganoff made in the slow cooker and served over delicious egg noodles. This dish will become a family favorite! "
  }, 
  {
    "id": "http://www.pressurecooker.com.au/beef-stroganoff-recipe", 
    "contents": "Creamy and full of flavour, this beef stroganoff recipe will feed a large family. Beef stroganoff has been marked as one of the most popular comfort foods during winter. "
  }, 
  {
    "id": "https://www.ibreatheimhungry.com/low-carb-beef-stroganoff-meatballs-recipe/", 
    "contents": "These Keto Beef Stroganoff meatballs are inspired by the classic dish of beef simmered in a sauce of mushrooms, onions, and sour cream. Low carb, gluten free, family friendly! "
  }, 
  {
    "id": "http://pinchofnom.com/recipes/low-syn-beef-stroganoff-slimming-world/", 
    "contents": "This Slimming World Low Syn Beef Stroganoff, is so creamy and indulgent. It's as low as half a Syn a portion if you use your Healthy Extra A choice!! "
  }, 
  {
    "id": "https://www.taste.com.au/recipes/beef-stroganoff-2/0a72ad16-e0e6-4a98-8656-a02ffaffd9ce", 
    "contents": "A low-fat and tasty version of classic beef stroganoff. "
  }, 
  {
    "id": "https://showmetheyummy.com/slow-cooker-beef-stroganoff-recipe/", 
    "contents": "Love beef stroganoff? You’ll love my Slow Cooker Beef Stroganoff! It’s made in the crockpot, has no 'cream of x' soup, & uses my blend of spices! This Slow Cooker Beef Stroganoff is one of our most popular recipes (originally posted February 12, 2016), so I’ve updated it to include a how-to video! "
  }, 
  {
    "id": "https://www.soscuisine.com/recipe/beef-stroganoff", 
    "contents": "Beef cooked in a creamy tomato sauce with mushrooms. A classic in international cuisine. Named after a nineteenth-century Russian diplomat, Count Paul Stroganov. "
  }, 
  {
    "id": "https://www.jocooks.com/recipes/beef-stroganoff-soup/", 
    "contents": "This Beef Stroganoff Soup takes all the rich and delicious flavors of Beef Stroganoff and transforms them into a one-pot 30-minute soup, full of tender beef and loads of noodles. "
  }, 
  {
    "id": "https://www.beefitswhatsfordinner.com/recipes/recipe/214/easy-beef-stroganoff", 
    "contents": "Easy Beef Stroganoff. Looking for a faster and easier beef stroganoff recipe? This classic recipe has been tested and perfected just for you! "
  }, 
  {
    "id": "http://livinglovingpaleo.com/2016/02/19/beef-stroganoff/", 
    "contents": "This recipe holds a special place in my heart, as beef stroganoff was one of my favorite recipes that my mom made when I was a kid. I haven’t had beef stroganoff in years, as it typically includes ingredients that I avoid, but I was determined to recreate my childhood favorite in a paleo-friendly way! "
  }, 
  {
    "id": "https://tatyanaseverydayfood.com/recipe-items/beef-stroganoff/", 
    "contents": "Creamy, aromatic beef stroganoff over egg noodles is a true classic! This recipe is loaded with tender beef, sliced mushrooms and plenty of onion and garlic! You’ll love the creamy and aromatic sauce! "
  }, 
  {
    "id": "https://www.taste.com.au/recipes/beef-stroganoff-4/3574df69-6fc1-4473-a0a6-582ff24c8779", 
    "contents": "Taste members love a dash of sweet paprika in this scrumptious beef stroganoff recipe. "
  }, 
  {
    "id": "http://littlespicejar.com/beef-stroganoff/", 
    "contents": "Beef Stroganoff is the ultimate comfort food! Learn how to make a simple and quick beef stroganoff that is so delicious to serve of buttered egg noodles. "
  }, 
  {
    "id": "https://iwashyoudry.com/one-skillet-ground-beef-stroganoff/", 
    "contents": "One Skillet Ground Beef Stroganoff is filled with hearty ground beef, mushrooms and tender egg noodles in a delicate and simple sauce. "
  }, 
  {
    "id": "https://www.wholefoodsmarket.com/recipe/beef-stroganoff", 
    "contents": "This classic, budget-friendly beef stroganoff is sure to be a family favorite. Serve with a green salad or steamed peas and carrots for a complete meal. "
  }, 
  {
    "id": "https://www.foodandwine.com/recipes/beef-stroganoff-0", 
    "contents": "Beef tenderloin and a little cream are the picture of royal extravagance. Here they are entwined in a satisfying classic version of Beef Stroganoff. "
  }, 
  {
    "id": "http://www.oliviascuisine.com/the-best-beef-stroganoff-ever/", 
    "contents": "Brazilian style beef stroganoff. So delicious you'll be going for seconds (and thirds!). "
  }, 
  {
    "id": "https://mealthy.com/recipes/1778/pressure-cooker-beef-stroganoff", 
    "contents": "Beef Stroganoff (or Beef Stroganov) is a dish with Russian origins. Pieces of sauteed deef is served in a sour cream sauce. It's origins go all the way back to mid-19th-century Russia, but it has since become popular around the world, with variations from the original recipe. "
  }, 
  {
    "id": "https://juliegoodwin.com.au/beef-stroganoff-recipe/", 
    "contents": "Beef Stroganoff - with this recipe it is critical that the beef is sliced very thinly - to make this easier, place the steak flat in the freezer for half an hour to an hour, until firmed but not frozen through "
  }, 
  {
    "id": "https://www.crunchycreamysweet.com/2016/02/22/20-minute-beef-stroganoff-recipe/", 
    "contents": "20-Minute Beef Stroganoff Recipe - make this classic dish right in your kitchen with just a few ingredients and only 20 minutes from start to finish! "
  }, 
  {
    "id": "http://tiphero.com/easy-beef-stroganoff/", 
    "contents": "In just a half hour you can serve up the easiest comfort food ever: a mound of hearty egg noodles topped with strips of sirloin steak, all bathed in a silky sour cream and mushroom sauce. And we spiked it with two secret ingredients that every great beef stroganoff recipe should have — mustard and ... "
  }, 
  {
    "id": "https://www.facebook.com/recipes/beef-stroganoff-recipes/", 
    "contents": "See and share hundreds of beef stroganoff recipes on Facebook "
  }, 
  {
    "id": "https://www.dietdoctor.com/recipes/low-carb-beef-stroganoff", 
    "contents": "Low-carb beef stroganoff. Creamy beef and blue cheese come together into a dish that will leave you humming with joy. ... this beef stroganoff recipe is delish, ... "
  }
]