[
  {
    "id": "https://www.dickssportinggoods.com/products/golf-gps.jsp", 
    "contents": "Shop golf GPS so you can shoot better. Find all golf GPS devices from top brands including golf GPS watches and hand-held devices from DICK'S Sporting Goods. "
  }, 
  {
    "id": "https://www.walmart.com/c/kp/golf-gps", 
    "contents": "You are eligible for a full refund if no ShippingPass-eligible orders have been placed.You cannot receive a refund if you have placed a ShippingPass-eligible order.In this case, the Customer Care team will remove your account from auto-renewal to ensure you are not charged for an additional year and you can continue to use the subscription ... "
  }, 
  {
    "id": "https://www.amazon.com/Golf-Course-GPS-Units/b?node=3411001", 
    "contents": "Shop through a wide selection of Golf GPS Units at Amazon.com. Free shipping and free returns on eligible items. "
  }, 
  {
    "id": "https://images.search.yahoo.com/search/images?p=golf+gps", 
    "contents": "More Golf Gps images "
  }, 
  {
    "id": "https://www.ebay.com/sch/i.html?_nkw=golf+gps", 
    "contents": "Find great deals on eBay for golf gps. Shop with confidence. "
  }, 
  {
    "id": "https://www.tgw.com/golf-gps-systems", 
    "contents": "Shop TGW.com for golf GPS systems from Garmin, Skygolf, Golf Buddy, and more! Make the most of every round with the latest golf GPS technology at a low price. "
  }, 
  {
    "id": "https://www.tripadvisor.com/Attraction_Review-g60713-d562111-Reviews-GoCar_GPS_Guided_Tours-San_Francisco_California.html", 
    "contents": "Book your tickets online for GoCar GPS Guided Tours, San Francisco: See 1,049 reviews, articles, and 195 photos of GoCar GPS Guided Tours, ranked No.81 on TripAdvisor among 314 attractions in San Francisco. "
  }, 
  {
    "id": "http://www.pgatoursuperstore.com/golf-gadgets-technology/technology/gpsunits.jsp", 
    "contents": "Need a GPS golf watch or other high-precision golf GPS devices? Shop our selection of golf GPS units from brands like Bushnell, Garmin, Golf Buddy & more! "
  }, 
  {
    "id": "http://www.golf.com/", 
    "contents": "GOLF.com delivers news on masters, golf tournaments, players and schedules. Find golf instructions, equipment reviews, course updates and more. "
  }, 
  {
    "id": "https://www.yelp.com/biz/tpc-harding-park-san-francisco", 
    "contents": "212 reviews of TPC Harding Park \"TPC Harding Park is awesome! ... this was based on the golf carts GPS not by any complaints from any players. "
  }, 
  {
    "id": "https://www.precisionprogolf.com/products/gps-golf-band", 
    "contents": "35,000 preloaded courses to ensure you’re ready to go on the 1st tee. The GPS Golf Band by Precision Pro Golf has all the features you need and is thinner, lighter, and more comfortable than the leading GPS golf watch. "
  }, 
  {
    "id": "https://wiki.ezvid.com/best-golf-gps-units", 
    "contents": "Currently, the best golf gps unit is the Voice Caddie VC300SE. Wiki researchers have been writing reviews of the latest golf gps units since 2015. "
  }, 
  {
    "id": "https://g.factoryoutletstore.com/cat/76804/Golf-GPS.html", 
    "contents": "Garmin Approach S60. Touchscreen GPS-Enabled Golf Watch; Convenient QuickFit™ Bands; High-Resolution Color Touchscreen; Battery Life - 10 Days (Activity Mode) "
  }, 
  {
    "id": "https://www.golfgalaxy.com/f/rangefinders", 
    "contents": "Shop our wide selection of Rangefinders and choose from the top brands you trust. Make your game better with top quality equipment at competitive prices. "
  }, 
  {
    "id": "https://www.ebay.com/b/Golf-GPS/111289/bn_7213119", 
    "contents": "Shop from the world's largest selection and best deals for Golf GPS. Shop with confidence on eBay! "
  }, 
  {
    "id": "https://www.rockbottomgolf.com/electronics/rangefinders/", 
    "contents": "In need of a Golf Rangefinder? Discover the industry's top brand rangefinders for the best prices guaranteed anywhere. "
  }, 
  {
    "id": "https://www.walmart.com/browse/sports-outdoors/golf-gps-rangefinders/4125_1224931_4152_1023519", 
    "contents": "Shop for Golf GPS & Rangefinders in Golf. Buy products such as Pinty Waterproof Golf Laser Rangefinder Trinocular Fog Mode w/Free Battery at Walmart and save. "
  }, 
  {
    "id": "https://www.amazon.com/golf-gps-watches/s?page=1&rh=i%3Aaps%2Ck%3Agolf%20gps%20watches", 
    "contents": "Product Features... Sleek GPS golf watch that reflects your passion on and off the course. ... "
  }, 
  {
    "id": "https://www.lifewire.com/golf-gps-mastery-1683664", 
    "contents": "The latest generation of golf GPS devices give you quick and accurate guidance from anywhere on the course. "
  }, 
  {
    "id": "https://www.tgw.com/golf-gps-watch", 
    "contents": "Shop TGW.com for golf GPS watches from Garmin, SkyGolf, Bushnell and Golf Buddy. Download course maps, calculate distance and more with the latest technology from golf GPS watches. "
  }, 
  {
    "id": "https://www.dickssportinggoods.com/f/golf-gps-watches", 
    "contents": "Shop a wide selection of golf GPS watches from DICK'S Sporting Goods. Find a golf watch, including the top-rated Garmin golf watch to improve your game. "
  }, 
  {
    "id": "https://www.golfgalaxy.com/f/golf-gps-watches", 
    "contents": "Shop the latest golf GPS watches from top brands like Garmin & Bushnell at Golf Galaxy. Use a GPS watch to enhance your game & knowledge of the course by learning about distance from the pin, length of the fairway and more. "
  }, 
  {
    "id": "https://www.dickssportinggoods.com/f/golf-gps-watches", 
    "contents": "Shop a wide selection of golf GPS watches from DICK'S Sporting Goods. Find a golf watch, including the top-rated Garmin golf watch to improve your game. "
  }, 
  {
    "id": "https://golfbee.net/golf-gps-reviews/", 
    "contents": "Discover the best golf GPS with latest technologies available in 2018. See our top 10 picks, comparisons, in-depth buyer's guide and make the right decision when choosing a golf GPS for you! "
  }, 
  {
    "id": "https://www.tgw.com/golf-gps-watch", 
    "contents": "Shop TGW.com for golf GPS watches from Garmin, SkyGolf, Bushnell and Golf Buddy. Download course maps, calculate distance and more with the latest technology from golf GPS watches. "
  }, 
  {
    "id": "https://www.bestconsumerreviews.com/golf-gps-reviews/", 
    "contents": "The SkyCaddie SGX-W Golf GPS is a great device to have while playing a round of golf. This Golf GPS has unbeatable accuracy allowing you to view the golf course and your targets easily due to the wireless connectivity. "
  }, 
  {
    "id": "https://www.bestbuy.com/site/shop/best-golf-gps", 
    "contents": "Shop for best golf gps at Best Buy. Find low everyday prices and buy online for delivery or in-store pick-up. "
  }, 
  {
    "id": "https://www.golfrangefinderspro.com/guide-best-golf-gps/", 
    "contents": "Use this guide to help you find the best golf GPS or best golf watch for your next game! We have listed the top golf GPS and top golf watches and compared them in our golf GPS reviews. "
  }, 
  {
    "id": "https://www.walmart.com/browse/sports-outdoors/golf-gps-rangefinders/4125_1224931_4152_1023519", 
    "contents": "Shop for Golf GPS & Rangefinders in Golf. Buy products such as Pinty Waterproof Golf Laser Rangefinder Trinocular Fog Mode w/Free Battery at Walmart and save. "
  }, 
  {
    "id": "https://www.worldwidegolfshops.com/Golf-GPS/Search", 
    "contents": "Search Results - WorldwideGolfShops.com. LEARN MORE. 90 Day 100% Satisfaction Gurantee. LEARN MORE. Looking to trade-in your used golf clubs? "
  }, 
  {
    "id": "https://practical-golf.com/best-golf-gps-watch/", 
    "contents": "We have scoured the market to find you the best golf GPS watch for your game. Our complete guide gives you five options based on your golfing needs. "
  }, 
  {
    "id": "http://mggolf.com/", 
    "contents": "MG Golf has the best selection & lowest prices on Pro Golf Gloves, Golf Balls, Golf Bags, GPS Rangefinders and More. "
  }, 
  {
    "id": "https://www.microsoft.com/en-us/p/golflogix-golf-gps/9nblggh09nl5", 
    "contents": "Download this app from Microsoft Store for Windows 10 Mobile, Windows Phone 8.1, Windows Phone 8. See screenshots, read the latest customer reviews, and compare ratings for GolfLogix: Golf GPS. "
  }, 
  {
    "id": "https://practical-golf.com/golf-gps-app-free/", 
    "contents": "We tested almost every golf gps app out there, and did a roundup of the best free apps that golfers should know about. Find out which one topped our list! "
  }, 
  {
    "id": "https://play.google.com/store/apps/details?id=com.shotzoom.golfshot2&hl=en_US", 
    "contents": "Improve your game and master the course while enjoying a whole, new golf experience with Golfshot. Over 2 million members of the Golfshot community rely on our golf GPS apps to save time, money, and strokes. "
  }, 
  {
    "id": "https://www.golfdiscount.com/rangefinders/gps", 
    "contents": "The latest generation of golf GPS devices gives you an edge on the competition with competitive intelligence about the course. Get the best insights about any course in an intuitive graphical format in the palm of your hand. "
  }, 
  {
    "id": "https://www.golfio.com/electronics/golf-gps/", 
    "contents": "Free Shipping On All Orders! Buy Now and Save on Golf GPS! "
  }, 
  {
    "id": "https://lasergolfrangefinder.com/handheld-golf-gps-comparision-table/", 
    "contents": "The various handheld Golf GPS currently available will vary is features and ease of use and so before buying one you need to read reviews to know more about it. "
  }, 
  {
    "id": "https://buy.garmin.com/en-US/US/p/105648", 
    "contents": "Pocket-sized Golf GPS. Tough, durable, bright, sunlight readable touchscreen; Preloaded with more than 40,000 golf courses around the world, with free lifetime updates "
  }, 
  {
    "id": "http://www.golf-monthly.co.uk/best-golf-deals/best-golf-gps-devices-2018-94809", 
    "contents": "We take you through the best golf GPS devices 2018 has to offer to help you make a decision on which is right for your game as well as your bank balance. "
  }, 
  {
    "id": "https://www.skygolf.com/", 
    "contents": "SkyGolf "
  }, 
  {
    "id": "http://www.golf-monthly.co.uk/best-golf-deals/best-golf-gps-devices-2018-94809", 
    "contents": "We take you through the best golf GPS devices 2018 has to offer to help you make a decision on which is right for your game as well as your bank balance. "
  }, 
  {
    "id": "https://buy.garmin.com/en-US/US/into-sports/golfing/cIntoSports-cGolfing-p1.html", 
    "contents": "High-sensitivity GPS golf devices that give you precise distances and other features for thousands of preloaded courses, so you can play your best golf. "
  }, 
  {
    "id": "https://www.bestbuy.com/site/shop/golf-gps-watches", 
    "contents": "Shop for golf gps watches at Best Buy. Find low everyday prices and buy online for delivery or in-store pick-up. "
  }, 
  {
    "id": "https://www.rockbottomgolf.com/electronics/gps-units/", 
    "contents": "In need of a Golf GPS Unit to take out with you on to the course? Shop the industry's top brand GPS units for the best prices guaranteed. "
  }, 
  {
    "id": "https://www.facebook.com/GolfshotGPS", 
    "contents": "Golfshot: Golf GPS. 7.6K likes. Golfshot is the most comprehensive golf GPS, GolfNow tee times, Handicap Index®, and scorecard app that over 2.7 million... "
  }, 
  {
    "id": "https://www.ubergolf.net/golf-gps-reviews/", 
    "contents": "Are you looking for the best golf GPS watches and handhelds 2018 to give you instant distances? Apart from having insightful golf GPS reviews, this is a comprehensive buying guide that explains how golf GPS reduces your handicap and brings a new lease of life to your game. "
  }, 
  {
    "id": "https://www.bestadvisor.com/golf-gps", 
    "contents": "Detailed Golf GPS Devices reviews, along with specs, comparisons and guides to help you make the right choice. "
  }, 
  {
    "id": "https://www.2ndswing.com/golf-gps-rangefinders/", 
    "contents": "Show new and used golf rangefinders and GPS from our incredible selection at 2nd Swing Golf. Save money by purchasing used or buy the latest model from Bushnell and others. "
  }, 
  {
    "id": "https://www.overstock.com/Sports-Toys/Golf-GPS-Rangefinders/3837/cat.html", 
    "contents": "Golf GPS & Rangefinders : Free Shipping on orders over $45 at Overstock - Your Online Golf Equipment Store! Get 5% in rewards with Club O! "
  }, 
  {
    "id": "http://www.golfgps.com/faq.asp", 
    "contents": "The GolfLogix Golf GPS device, powered by Garmin. "
  }, 
  {
    "id": "https://www.wareable.com/golf/best-golf-wearables-gps-watches-and-swing-analysers", 
    "contents": "We've tested the latest and best golf watches from Garmin, TomTom and more to help you choose your perfect wearable caddy "
  }, 
  {
    "id": "https://lasergolfrangefinder.com/10-best-golf-gps-reviews-2016-experts-top-rated/", 
    "contents": "You want to buy the best golf GPS 2018, arent you? Here are top rated, brands of golf GPS are compiled after reading top rated golf gps reviews by expert "
  }, 
  {
    "id": "https://www.golfdiscount.com/bushnell-phantom-golf-gps", 
    "contents": "Bushnell Phantom Golf GPS - Preloaded with 36,000+ courses in more than 30 countries the Bushnell Phantom Golf GPS features easy-to-read front/center/back distances and displays up to 4 hazard distances per hole. "
  }, 
  {
    "id": "http://www.izzo.com/", 
    "contents": "Please enter a valid email address, e.g. johndoe@domain.com. Email address is required. This email is already registered. "
  }, 
  {
    "id": "https://www.rockbottomgolf.com/electronics/rangefinders/", 
    "contents": "In need of a Golf Rangefinder? Discover the industry's top brand rangefinders for the best prices guaranteed anywhere. "
  }, 
  {
    "id": "https://www.lifewire.com/best-iphone-golf-apps-1683662", 
    "contents": "There are many iPhone golf GPS rangefinder apps. Our review narrows the field down to the best: Golfshot, ViewTI, GolfLink, AirVue, and GolfLogix. "
  }, 
  {
    "id": "https://best.offers.com/best-golf-course-gps-units", 
    "contents": "Review the top rated Golf Course GPS Units for Jun 2018 based on 5213 consumer reviews. Shop today and save on the best Golf Course GPS Units. "
  }, 
  {
    "id": "https://wiki.ezvid.com/best-golf-gps-watches", 
    "contents": "Currently, the best golf gps watch is the Garmin Approach S20. Wiki researchers have been writing reviews of the latest golf gps watches since 2016. "
  }, 
  {
    "id": "http://www.golf.com/instruction/6-golf-gps-apps-will-help-you-find-your-bearings-and-your-game", 
    "contents": "Golf GPS apps are so numerous these days, you almost need a GPS to track them all. We conducted a high-tech investigation, surveying the crowded app market to direct you toward six winners for six budgets. What you get: Most GPS apps offer aerial imagery of the hole you’re playing. Sonocaddie ... "
  }, 
  {
    "id": "https://golfpadgps.com/", 
    "contents": "See actual aerial maps. Measure distance to front, middle and back of the green or any point on course. Golf Pad GPS™ provides layups, elevation and more. "
  }, 
  {
    "id": "https://www.overstock.com/Sports-Toys/Golf-Course-GPS/22654/subcat.html", 
    "contents": "Golf Course GPS : Free Shipping on orders over $45 at Overstock - Your Online Golf GPS & Rangefinders Store! Get 5% in rewards with Club O! "
  }, 
  {
    "id": "https://www.globalgolf.com/golf-accessories/garmin/gps-range-finders/", 
    "contents": "Garmin GPS/Range Finders golf accessories. GlobalGolf.com golf store offers superior selection, service, and quality for your new closeout and discount golf accessories. "
  }, 
  {
    "id": "https://www.globalgolf.com/golf-accessories/izzo/gps-range-finders/", 
    "contents": "Shop for Izzo golf GPS units at great prices on GlobalGolf.com. $6.99 flat rate shipping every day & FREE SHIPPING on orders over $199 w/ on-site coupon code "
  }, 
  {
    "id": "https://www.golflandwarehouse.com/gps/", 
    "contents": "Shop Golf GPS units at Golfland Warehouse. Browse by Brand, Size & more Hide Filters Show Filters "
  }, 
  {
    "id": "http://rangefinderadvice.com/best-golf-gps-reviews/", 
    "contents": "Want to buy a Best Golf Gps Watches or Handheld Gps, but confused where to start? Check out our Golf Gps Reviews, Ratings, Comparisons and Buyers Guide. "
  }, 
  {
    "id": "https://www.usgolfpro.com/best-golf-gps-watch-reviews/", 
    "contents": "In search for The Best Golf GPS Watch Reviews for 2018? Yes, we tested and compared most Golf GPS devices and now we are making it easy for you to decide. "
  }, 
  {
    "id": "http://golf-info-guide.com/golf-gps-reviews/", 
    "contents": "Best Page for: GOLF GPS REVIEWS >> A golf GPS (Global Positioning System) is an electronic device to aid golfers in club selection.It can provide the precise shot length needed to reach the golfers target and help avoid miss clubbing. "
  }, 
  {
    "id": "https://www.golfclearanceoutlet.com.au/gps-rangefinders/gps-units.html", 
    "contents": "Buy discount golf course GPS units from leading brands such as Sureshot, Bushnell and more. Cheap golf course gps with lots of capabilities. "
  }, 
  {
    "id": "http://sonocaddie.com/", 
    "contents": "Sonocaddie Golf GPS unit provides accurate information and simple graphic overview of a hole, as found in old-fashioned yardage books. "
  }, 
  {
    "id": "http://www.swamigps.com/", 
    "contents": "The Swami GPS Band delivers exact distances to the front, middle, and back of the green on over 38,000 courses worldwide!The Swami Band can even keep your score and track the distance of your shot to know exactly how far you outdrove your golf buddies! "
  }, 
  {
    "id": "https://best.offers.com/best-golf-course-gps-units", 
    "contents": "Review the top rated Golf Course GPS Units for Jun 2018 based on 5213 consumer reviews. Shop today and save on the best Golf Course GPS Units. "
  }, 
  {
    "id": "https://itunes.apple.com/us/app/golfshot-plus-golf-gps/id319897973", 
    "contents": "Golfshot Plus is the first golf gps app to bring you on-course augmented reality with Golfscape AR. Pinpoint pin locations and view the course and GPS distances in AR. "
  }, 
  {
    "id": "https://www.golfdiscount.com/rangefinders", 
    "contents": "Shop our large selection of golf rangefinders and gps units. Save on point and shoot rangefinders and convenient gps watches and clip-ons at Golf Discount. "
  }, 
  {
    "id": "https://www.globalgolf.com/golf-accessories/1036715-tlink-gps-golf-watch-gps-range-finders/", 
    "contents": "TLink GPS/Range Finders golf accessories. GlobalGolf.com golf store offers superior selection, service, and quality for your new closeout and discount golf accessories. "
  }, 
  {
    "id": "https://www.ebay.ca/b/Golf-GPS/111289/bn_7213119", 
    "contents": "Shop from the world's largest selection and best deals for Golf GPS. Shop with confidence on eBay! "
  }, 
  {
    "id": "https://www.golfio.com/smart-golf-dot-gps-2016/", 
    "contents": "FREE shipping on Smart Golf Dot GPS 2016 at Golfio.com. You won't find a better deal on Smart Golf Dot GPS 2016. "
  }, 
  {
    "id": "http://www.golfrangefindershop.com/gps/best-golf-gps-2/", 
    "contents": "Our picks for the Best Golf GPS devices are separated into six categories. There is some overlap between the categories, but hopefully, this will help you "
  }, 
  {
    "id": "https://www.golfclubsdirect.com/electronics/gps-watches", 
    "contents": "$179.99 msrp $199.99 Save 10% plus FREE shipping The 2017 GOLF BUDDY WTX GPS delivers all the functionality associated with a handheld unit in a stylish, compact watch. "
  }, 
  {
    "id": "https://golfpadgps.com/", 
    "contents": "See actual aerial maps. Measure distance to front, middle and back of the green or any point on course. Golf Pad GPS™ provides layups, elevation and more. "
  }, 
  {
    "id": "https://www.tomtom.com/en_au/sports/golf/", 
    "contents": "Know every inch of the course and improve your game, round after round with the TomTom Golfer GPS watches. Discover more. "
  }, 
  {
    "id": "http://www.golfgps.com/faq.asp", 
    "contents": "The GolfLogix Golf GPS device, powered by Garmin. "
  }, 
  {
    "id": "https://thebullgolf.com/best-golf-gps/", 
    "contents": "Are you in a confusion which best golf GPS watch to choose? Here we are to help you out! With the HONEST and PROFESSIONAL reviews. "
  }, 
  {
    "id": "http://www.intheholegolf.com/golf-gps/Golf-GPS-Systems.html", 
    "contents": "Are you looking for Golf GPS Systems? InTheHoleGolf.com has a huge selection of golf clubs, golf training aids, and golf equipment. "
  }, 
  {
    "id": "https://www.ubergolf.net/golf-gps-reviews/", 
    "contents": "Are you looking for the best golf GPS watches and handhelds 2018 to give you instant distances? Apart from having insightful golf GPS reviews, this is a comprehensive buying guide that explains how golf GPS reduces your handicap and brings a new lease of life to your game. "
  }, 
  {
    "id": "https://lasergolfrangefinder.com/10-best-golf-gps-reviews-2016-experts-top-rated/", 
    "contents": "You want to buy the best golf GPS 2018, arent you? Here are top rated, brands of golf GPS are compiled after reading top rated golf gps reviews by expert "
  }, 
  {
    "id": "https://twitter.com/golfpadgps", 
    "contents": "The latest Tweets from Golf Pad GPS (@golfpadgps). Golf Pad GPS: an easy-to-use, free GPS rangefinder & scoring app to help golfers play better. Try Golf Pad LINK to track & play without carrying a phone!. "
  }, 
  {
    "id": "https://www.golflandwarehouse.com/gps/", 
    "contents": "Shop Golf GPS units at Golfland Warehouse. Browse by Brand, Size & more Hide Filters Show Filters "
  }, 
  {
    "id": "https://www.hurricanegolf.com/golf-accessories/golf-gps-and-rangefinders", 
    "contents": "Buy Golf GPS and Rangefinders at discount prices from Hurricane Golf. Purchase online for the best wholesale prices around. "
  }, 
  {
    "id": "https://www.thegpsstore.com/Garmin-Approach-G30-Golf-GPS-P5171.aspx", 
    "contents": "Garmin Approach G30 Golf GPS is a top choice for golfers worldwide. Detailed information on a compact display. Small enough to fit in your pocket, the G30 offers detailed course info, precise yardages, layup distances and more. "
  }, 
  {
    "id": "https://www.iphonelife.com/content/15-best-golf-apps-every-golfer-needs", 
    "contents": "Best Golf Apps for iPhone & Apple Watch: Best Scorecard & Rangefinder Apps 1. Golf GPS (Free, in-app purchases) 2. Hole19 Golf GPS & Scoring App (Free) 3. Golfshot: Golf GPS + Scorecard (Free, in-app purchases) Best Golf Swing Tracking Apps 4. "
  }, 
  {
    "id": "https://www.crutchfield.com/ISEO-rmsbcspd/g_380450/Golf-GPS-Rangefinders.html", 
    "contents": "Shopping for Golf GPS, Rangefinders? Since 1974, our Virginia-based experts have loved talking A/V. We are here to help you choose the best option for your needs! "
  }, 
  {
    "id": "http://www.golfgps.com/product-info.asp", 
    "contents": "The GolfLogix Golf GPS device, powered by Garmin. "
  }, 
  {
    "id": "https://www.opticsplanet.com/golf-gps.html", 
    "contents": "We have a wide collection of golf gps units and growing every day! If you don't have a caddy following you, figuring out how far the next hole is or maybe what iron you should use, you can be left without the proper advantage that golf equipment can bring. "
  }, 
  {
    "id": "https://www.facebook.com/fungolfgps", 
    "contents": "FunGolf GPS. 10K likes. FunGolf is the only golf GPS application that features 3D maps with close to 35,000 golf courses in the world. "
  }, 
  {
    "id": "http://www.needaplan.com/golf-gps-watch/", 
    "contents": "What's the Best Golf GPS Watch? Here's our thoughts based on the Top Garmin, Bushnell GPS Golf Watch unit based on customer Reviews and Ratings. "
  }, 
  {
    "id": "https://www.scheels.com/c/golf-gps-rangefinders", 
    "contents": "For the ultimate golf match, plan your way around the course with SCHEELS' selection of golf GPS and rangefinders by Garmin, Leupold and Vista/Bushnell. SCHEELS "
  }, 
  {
    "id": "http://www.discountgolfworld.com/golf-gps-units-rangefinders-c423", 
    "contents": "Golf GPS handheld units function as a rangefinder and display satellite aerial imagery of courses and tracks score and current position. "
  }, 
  {
    "id": "http://www.leaderboard.com/ABOUTGPS.htm", 
    "contents": "Some golf carts are equipped with GPS displays (such as this one from ParView, click photo to enlarge), which present a graphic image of the course, offering you the ability to zoom in on your present position and distance from the green. "
  }, 
  {
    "id": "http://www.golftown.com/GPS-Rangefinders", 
    "contents": "Golf Town carries a wide variety of GPS units, GPS watches and rangefinders from top brands including Garmin, Bushnell, Golf Buddy, SkyGolf, LaserLink and more! "
  }
]