[
  {
    "id": "https://en.wikipedia.org/wiki/Roosevelt_Island", 
    "contents": "Roosevelt Island is a narrow island in New York City's East River.It lies between Manhattan Island to its west and the borough of Queens on Long Island to its east, and is part of the borough of Manhattan. "
  }, 
  {
    "id": "https://www.nps.gov/this/index.htm", 
    "contents": "In the 1930s, landscape architects transformed Mason’s Island from neglected, overgrown farmland into Theodore Roosevelt Island, a memorial to America’s 26th president. "
  }, 
  {
    "id": "https://rioc.ny.gov/302/Tram", 
    "contents": "The Roosevelt Island Tramway provides amazing scenic views of Manhattan, running every 7-15 minutes from 59th street and Second Avenue in Manhattan to Tramway Plaza on Roosevelt Island. "
  }, 
  {
    "id": "https://images.search.yahoo.com/search/images?p=roosevelt+island", 
    "contents": "More Roosevelt Island images "
  }, 
  {
    "id": "https://rioc.ny.gov/", 
    "contents": "Roosevelt Island Operating Corporation. Come check us out. "
  }, 
  {
    "id": "https://www.tripadvisor.com/Attraction_Review-g60763-d565031-Reviews-Roosevelt_Island-New_York_City_New_York.html", 
    "contents": "You have to remember that the Tram is not a tourist attraction. It is a way that people who live on Roosevelt Island get back and forth from work (that and the subway). "
  }, 
  {
    "id": "https://video.search.yahoo.com/search/video?p=roosevelt+island", 
    "contents": "More Roosevelt Island videos "
  }, 
  {
    "id": "https://www.yelp.com/biz/roosevelt-island-new-york", 
    "contents": "120 reviews of Roosevelt Island \"I really like this island! It's like an escape from the city scene. The tram is a great way to get on. Fun little ride over Manhattan and the river onto the island. "
  }, 
  {
    "id": "https://www.lonelyplanet.com/usa/new-york-city/travel-tips-and-articles/best-things-to-do-on-roosevelt-island-in-new-york-city/40625c8c-8a11-5710-a052-1479d277c9c3", 
    "contents": "Though technically part of Manhattan, Roosevelt Island is low on the traveler's radar. But this peaceful spot in the East River has a lot to offer. "
  }, 
  {
    "id": "https://www.apartments.com/roosevelt-island-new-york-ny/", 
    "contents": "See all 156 apartments in Roosevelt Island, New York, NY currently available for rent. Check rates, compare amenities and find your next rental on Apartments.com. "
  }, 
  {
    "id": "https://www.nycgo.com/boroughs-neighborhoods/manhattan/roosevelt-island", 
    "contents": "Take the Roosevelt Island Tramway over the East River for a unique perspective on the City. Once closed to the public, today Roosevelt Island is home to a residential community and a number of parks and landmarks. At the island’s southern end, the Louis Kahn–designed Franklin D. Roosevelt Four ... "
  }, 
  {
    "id": "https://news.search.yahoo.com/search?p=roosevelt+island&fr2=cosmos", 
    "contents": "More news for Roosevelt Island "
  }, 
  {
    "id": "https://www.nps.gov/this/planyourvisit/index.htm", 
    "contents": "We hope you enjoy your visit to Theodore Roosevelt's presidential memorial. Theodore Roosevelt was active and enthusiastic about the \"hardy life of the open.\" When you break a sweat on the island's trails, loose track of time while watching a bird, or wrestle with the philosophical underpinnings of ... "
  }, 
  {
    "id": "https://www.nps.gov/this/planyourvisit/index.htm", 
    "contents": "We hope you enjoy your visit to Theodore Roosevelt's presidential memorial. Theodore Roosevelt was active and enthusiastic about the \"hardy life of the open.\" When you break a sweat on the island's trails, loose track of time while watching a bird, or wrestle with the philosophical underpinnings of ... "
  }, 
  {
    "id": "https://www.nytimes.com/2017/10/04/realestate/living-on-roosevelt-island.html", 
    "contents": "Out of the ruins of prisons and hospitals, Roosevelt Island has seen an increase in development — and prices, which have spiked 59 percent since 2012. "
  }, 
  {
    "id": "https://www.tripadvisor.com/Attraction_Review-g60763-d548557-Reviews-The_Roosevelt_Island_Tramway-New_York_City_New_York.html", 
    "contents": "The Roosevelt Island Tramway, New York City: Address, Phone Number, The Roosevelt Island Tramway Reviews: 4.5/5 "
  }, 
  {
    "id": "https://www.atlasobscura.com/articles/islands-of-the-undesirables-roosevelt-island-blackwell-s-island", 
    "contents": "Prison and garden on Blackwell’s Island (today Roosevelt Island), 1853 (Photo: Public Domain/WikiCommons) According to most sources, the original inhabitants of what is now Roosevelt Island, the Canarsie tribe, called the place Minnahannock, which translates to “it’s nice to be here.” (As with many things reported about Native Americans ... "
  }, 
  {
    "id": "https://twitter.com/Rooseveltisland", 
    "contents": "The latest Tweets from Roosevelt Islander (@Rooseveltisland). Roosevelt Island News, Info, Events and Comments. Roosevelt Island, Manhattan "
  }, 
  {
    "id": "https://www.octagonnyc.com/roosevelt-island", 
    "contents": "The Octagon, Roosevelt Island's spectacular new residence in New York City. Easy to reach rental, possessing a secluded character all its own. "
  }, 
  {
    "id": "https://freetoursbyfoot.com/roosevelt-island-tour/", 
    "contents": "This post is a self-guided tour of NYC's Roosevelt Island, one of the city's best skyline views. Visit on the Roosevelt Island Tram from Midtown. "
  }, 
  {
    "id": "https://www.apartments.com/roosevelt-island-ny/", 
    "contents": "See all 146 apartments in Roosevelt Island, NY currently available for rent. Each Apartments.com listing has verified availability, rental rates, photos, floor plans and more. "
  }, 
  {
    "id": "https://www.hotels.com/de1710694/hotels-near-roosevelt-island-new-york-united-states-of-america/", 
    "contents": "Compare 296 hotels near Roosevelt Island in New York using 210859 real guest reviews. Earn free nights, get our Price Guarantee & make booking easier with Hotels.com! "
  }, 
  {
    "id": "http://rooseveltislander.blogspot.com/", 
    "contents": "RIOC adds: Due to Roosevelt Island Day activities this Saturday, June 16, there will be no street parking all day from 523 - 543 Main Street, 465 – 475 Main Street, and on the roadway adjacent to the Rivercross Lawn area near 501 Main Street. "
  }, 
  {
    "id": "https://freetoursbyfoot.com/roosevelt-island-tramway/", 
    "contents": "The Roosevelt Island Tram provides a skyline view of the city like no other. In this section, we will provide details on the best times to go, where you can find the tram station, how to get tickets and other tips. Your experience on the Roosevelt Island Tram is going to vary depending on when you ... "
  }, 
  {
    "id": "https://www.trulia.com/NY/New_York,5224,Roosevelt_Island/", 
    "contents": "22 Homes For Sale in Roosevelt Island, New York, NY. Browse photos, see new properties, get open house info, and research neighborhoods on Trulia. "
  }, 
  {
    "id": "https://www.yelp.com/biz/roosevelt-island-tramway-new-york-3", 
    "contents": "220 reviews of Roosevelt Island Tramway \"Hey, for 6 bucks round-trip, this has got to be one of the bargain rides in NYC! Get eye-level with the Queensboro Bridge - and see awesome views both upriver and downriver of the East River - and stunning… "
  }, 
  {
    "id": "http://www.culturalxplorer.com/roosevelt-island-nyc/", 
    "contents": "Headed to New York City? Do not pass up a chance to visit the beautiful Roosevelt Island and see stunning views of Manhattan and Queens! "
  }, 
  {
    "id": "https://ny.curbed.com/2018/5/15/17353502/roosevelt-island-new-york-history-stacy-horn", 
    "contents": "Author Stacy Horn’s new book examines Roosevelt Island’s past as a home for prisons, a smallpox hospital, and other institutions. "
  }, 
  {
    "id": "https://www.inspirock.com/united-states/new-york-city/roosevelt-island-a821472547", 
    "contents": "Plan to visit Roosevelt Island, United States. Get details of Location, timings and contact. Find the reviews and ratings to know better. "
  }, 
  {
    "id": "https://www.timeout.com/newyork/manhattan/roosevelt-island-nyc", 
    "contents": "The attractions at Roosevelt Island, NYC, are so underrated. From a historic lighthouse to an iconic park and stunning tram rides, this spot is worth a trip. "
  }, 
  {
    "id": "https://streeteasy.com/for-rent/roosevelt-island", 
    "contents": "Browse photos of 54 apartments for rent in Roosevelt Island by using detailed search filters to find your future home | StreetEasy "
  }, 
  {
    "id": "https://manhattanpark.com/", 
    "contents": "Set in the tranquility of Roosevelt Island, yet with all the energy of the city one subway stop away. Discover Manhattan Park apartments for rent. "
  }, 
  {
    "id": "http://www.fdrfourfreedomspark.org/", 
    "contents": "Franklin D. Roosevelt Four Freedoms Park is the first memorial dedicated to the former President in his home state of New York. Located on the southern tip of Roosevelt Island in New York City, it is the last work of the late Louis I. Kahn, an iconic architect of the 20th century. "
  }, 
  {
    "id": "https://streeteasy.com/for-sale/roosevelt-island", 
    "contents": "Browse photos of 20 for sale listings in Roosevelt Island by using detailed search filters to find your future home | StreetEasy "
  }, 
  {
    "id": "http://rooseveltislanddaily.prosepoint.net/", 
    "contents": "Daily update of news and views relevant to the Roosevelt Island community in New York City. "
  }, 
  {
    "id": "https://www.realtor.com/apartments/Roosevelt-Island_NY", 
    "contents": "Get easy access to 65 apartments for rent in Roosevelt Island, NY on realtor.com®. Find the ideal Roosevelt Island apartments today. "
  }, 
  {
    "id": "https://www.wikihow.com/Get-to-Roosevelt-Island", 
    "contents": "How to Get to Roosevelt Island. Roosevelt Island is located in the center of the East River between Queens and Manhattan. The island allows visitors and locals to leave the hustle and bustle of the city without actually travelling outside... "
  }, 
  {
    "id": "https://www.timeout.com/newyork/attractions/roosevelt-island", 
    "contents": "RECOMMENDED: 50 best New York attractions Thanks to the boxy red tram that glides above the East River, Roosevelt Island may be one of the only spots in New Yo "
  }, 
  {
    "id": "https://www.trulia.com/NY/Roosevelt_Island/", 
    "contents": "21 Homes For Sale in Roosevelt Island, NY. Browse photos, see new properties, get open house info, and research neighborhoods on Trulia. "
  }, 
  {
    "id": "https://www.nytimes.com/2014/11/09/realestate/the-quiet-manhattan-roosevelt-island.html", 
    "contents": "Change is coming to Roosevelt Island, which is part of Manhattan, with several new developments and residential subsidy programs about to end. "
  }, 
  {
    "id": "https://www.facebook.com/pages/Roosevelt-Island/112926018721652", 
    "contents": "Roosevelt Island, New York, New York. 4,469 likes · 95,730 were here. Roosevelt Island is a narrow island in New York City's East River. It lies between... "
  }, 
  {
    "id": "https://www.tripsavvy.com/exploring-theodore-roosevelt-island-1039279", 
    "contents": "Learn about visiting Theodore Roosevelt Island, a memorial and wilderness preserve with walking trails along the Potomac River near Washington, DC. "
  }, 
  {
    "id": "http://www.parkrun.us/rooseveltislanddc/", 
    "contents": "What is Roosevelt Island DC parkrun? It is a 5km run - it's you against the clock. When is it? Every Saturday at 9:00am. Where is it? The event takes place at Roosevelt Island, George Washington Memorial Parkway, Arlington, VA 22211. "
  }, 
  {
    "id": "https://www.facebook.com/pages/Roosevelt-Island/112926018721652", 
    "contents": "Roosevelt Island, New York, New York. 4,469 likes · 95,730 were here. Roosevelt Island is a narrow island in New York City's East River. It lies between... "
  }, 
  {
    "id": "https://www.npr.org/2017/07/26/539304811/how-new-york-s-roosevelt-island-sucks-away-summer-trash-stink", 
    "contents": "Underneath high-rise apartment buildings along the 2-mile island, an automated trash disposal system whisks away nearly 6 tons of trash per day through pipes and tubes. "
  }, 
  {
    "id": "https://www.realtor.com/apartments/Roosevelt-Island_New-York_NY", 
    "contents": "'Realtor.com® has 58 apartments for rent in Roosevelt Island, New York, NY. Search by what matters to you: pet-friendly listings, garage or swimming pool.' "
  }, 
  {
    "id": "https://ny.curbed.com/neighborhood/1382/roosevelt-island", 
    "contents": "Every aspect of living in New York, for people who care about their city, their streets, and their homes. "
  }, 
  {
    "id": "https://maloney.house.gov/issues/local-issues/roosevelt-island", 
    "contents": "New York, NY- Congresswoman Carolyn B. Maloney (D-Roosevelt Island, Manhattan, Queens) yesterday joined with elected officials representing Roosevelt Island to urge the Metropolitan Transportation Authority (MTA) to confront the Island’s growing mass transit crisis. "
  }, 
  {
    "id": "http://www.relatedrentals.com/apartment-rentals/new-york-city/roosevelt-island", 
    "contents": "Our Roosevelt Island luxury apartment rentals offer the best in small-town charm and big-city convenience. View our properties which are minutes away from Manhattan. "
  }, 
  {
    "id": "https://www.zillow.com/roosevelt-island-manhattan-new-york-ny/apartments/", 
    "contents": "Find your next apartment in Roosevelt Island New York on Zillow. Use our detailed filters to find the perfect place, then get in touch with the property manager. "
  }, 
  {
    "id": "http://construction.tech.cornell.edu/", 
    "contents": "Welcome to Cornell Tech’s Roosevelt Island Construction Project site. This website is designed to provide updates to the community about construction progress and provide a forum for important construction announcements for the project. Cornell Tech brings together faculty, business leaders, tech ... "
  }, 
  {
    "id": "https://www.nypl.org/locations/roosevelt-island#!", 
    "contents": "Meet Jinglu, a super user of the NYPL who funnels many of her selections through a tiny branch library on Roosevelt Island. "
  }, 
  {
    "id": "https://www.wunderground.com/weather/us/ny/roosevelt-island", 
    "contents": "Weather Underground provides local & long range weather forecasts, weather reports, maps & tropical weather conditions for locations worldwide. "
  }, 
  {
    "id": "https://www.hotels.com/de1710694/hotels-near-roosevelt-island-new-york-united-states-of-america/", 
    "contents": "Compare 296 hotels near Roosevelt Island in New York using 210859 real guest reviews. Earn free nights, get our Price Guarantee & make booking easier with Hotels.com! "
  }, 
  {
    "id": "https://www.facebook.com/pages/Roosevelt-Island/112926018721652", 
    "contents": "Roosevelt Island, New York, New York. 4,469 likes · 95,730 were here. Roosevelt Island is a narrow island in New York City's East River. It lies between... "
  }, 
  {
    "id": "http://rooseveltislanddaily.prosepoint.net/", 
    "contents": "Daily update of news and views relevant to the Roosevelt Island community in New York City. "
  }, 
  {
    "id": "https://ny.curbed.com/2018/5/15/17353502/roosevelt-island-new-york-history-stacy-horn", 
    "contents": "Author Stacy Horn’s new book examines Roosevelt Island’s past as a home for prisons, a smallpox hospital, and other institutions. "
  }, 
  {
    "id": "https://boroughsofthedead.com/roosevelt-island/", 
    "contents": "Meeting Point: Meet guide in front of the Smallpox Hospital ruins inside Southpoint Park. If you are walking from the F train or the tramway stop, continue south along West Road until you reach the entrance. "
  }, 
  {
    "id": "https://www.npr.org/2017/07/26/539304811/how-new-york-s-roosevelt-island-sucks-away-summer-trash-stink", 
    "contents": "Underneath high-rise apartment buildings along the 2-mile island, an automated trash disposal system whisks away nearly 6 tons of trash per day through pipes and tubes. "
  }, 
  {
    "id": "https://www.new-york-city-travel-tips.com/roosevelt-island-tramway/", 
    "contents": "The Roosevelt Island Tramway, another great plan to visit New York. It's a unique and very different way to see the big apple. "
  }, 
  {
    "id": "https://www.tripadvisor.co.uk/Attraction_Review-g60763-d565031-Reviews-Roosevelt_Island-New_York_City_New_York.html", 
    "contents": "You have to remember that the Tram is not a tourist attraction. It is a way that people who live on Roosevelt Island get back and forth from work (that and the subway). "
  }, 
  {
    "id": "https://www.nakedapartments.com/nyc/roosevelt-island-apartments-for-rent", 
    "contents": "Roosevelt Island Apartments are some of the best rentals in New York City. Read more about the neighborhood and the apartments here. "
  }, 
  {
    "id": "https://manhattanpark.com/", 
    "contents": "Set in the tranquility of Roosevelt Island, yet with all the energy of the city one subway stop away. Discover Manhattan Park apartments for rent. "
  }, 
  {
    "id": "https://www.alltrails.com/trail/us/washington-dc/theodore-roosevelt-island-outer-loop", 
    "contents": "Wooded trail and boardwalk over swamp, tribute to our 26th President. The Theodore Roosevelt Memorial Association purchased this 88.5-acre island... "
  }, 
  {
    "id": "https://www.ebay.com/sch/i.html?_nkw=roosevelt+island", 
    "contents": "Find great deals on eBay for roosevelt island. Shop with confidence. "
  }, 
  {
    "id": "https://www.zomato.com/new-york-city/roosevelt-island-restaurants", 
    "contents": "Restaurants in Roosevelt Island; Roosevelt Island, Manhattan, New York City Restaurants - Menus, Reviews, Photos for Restaurants, Pubs, Lounges, and Bars in Roosevelt Island, Manhattan, New York City "
  }, 
  {
    "id": "https://www.weichert.com/NY/Newyork/Manhattan/Roosevelt_Island/", 
    "contents": "Search Roosevelt Island, New York Real Estate Listings & New Homes for Sale in Roosevelt Island, NY. Find Roosevelt Island Houses, Townhouses, Condos, & Properties for Sale at Weichert.com "
  }, 
  {
    "id": "http://newyorkcliche.com/2016/05/17/roosevelt-island-tramway/", 
    "contents": "The Roosevelt Island Tramway runs next to the Ed Koch Queensboro Bridge from Manhattan to a little island in the East River. The ride is super fun! "
  }, 
  {
    "id": "https://www.expedia.com/Roosevelt-Island-Hotels.d6156947.Travel-Guide-Hotels", 
    "contents": "Top 10 Roosevelt Island hotels from $52 and save with Expedia Guaranteed Best Price. Book Now, Pay later on most selected hotels and choose from over 1628 Roosevelt Island hotels. "
  }, 
  {
    "id": "https://www.facebook.com/RooseveltIslandNYC", 
    "contents": "Roosevelt Island. 973 likes · 10 talking about this. Roosevelt Island Online "
  }, 
  {
    "id": "http://www1.nyc.gov/nyc-resources/service/2378/roosevelt-island-tramway", 
    "contents": "Get information or make a complaint about the Roosevelt Island Tramway. "
  }, 
  {
    "id": "https://www.zillow.com/roosevelt-island-manhattan-new-york-ny/", 
    "contents": "Zillow has 21 homes for sale in Roosevelt Island New York. View listing photos, review sales history, and use our detailed real estate filters to find the perfect place. "
  }, 
  {
    "id": "http://construction.tech.cornell.edu/", 
    "contents": "Welcome to Cornell Tech’s Roosevelt Island Construction Project site. This website is designed to provide updates to the community about construction progress and provide a forum for important construction announcements for the project. Cornell Tech brings together faculty, business leaders, tech ... "
  }, 
  {
    "id": "https://www.zillow.com/roosevelt-island-manhattan-new-york-ny/", 
    "contents": "Zillow has 21 homes for sale in Roosevelt Island New York. View listing photos, review sales history, and use our detailed real estate filters to find the perfect place. "
  }, 
  {
    "id": "https://www.flickr.com/photos/wotba/albums/72157605484066604/", 
    "contents": "images from two visits to Roosevelt Island, June 5 and June 7, 2008. More to be added. "
  }, 
  {
    "id": "https://www.mapquest.com/us/ny/new-york/roosevelt-island-282012060", 
    "contents": "Get directions, reviews and information for Roosevelt Island, NY in New York, NY. "
  }, 
  {
    "id": "http://www.rigarden.org/", 
    "contents": "The Roosevelt Island Garden Club, Ltd (RIGC) community garden is located on Roosevelt Island in New York City between the Octagon soccer field and the Pony baseball field. "
  }, 
  {
    "id": "https://www.corcoran.com/nyc-real-estate/neighborhoods/manhattan/roosevelt-island/73", 
    "contents": "While technically part of Manhattan, Roosevelt Island offers a true escape from bustling city life. The mostly car-free island thrives on green spa... "
  }, 
  {
    "id": "https://www.renthop.com/nyc/roosevelt-island-apartments", 
    "contents": "Newly listed Roosevelt Island apartments in NYC. Smooth work commute, popular bars and nightlife, nearby restaurants and grocery stores, and safety. Find your perfect home in New York, NY. "
  }, 
  {
    "id": "https://untappedcities.com/2015/12/15/the-top-12-secrets-of-nycs-roosevelt-island/", 
    "contents": "NYC's Roosevelt Island has a fascinating history and many secrets, from former lunatic asylum, abandoned hospital, underground tunnels and quirky statues. "
  }, 
  {
    "id": "https://www.bike.nyc/education/roosevelt-island/", 
    "contents": "Bike New York’s innovative pilot programs and free bike education classes on Roosevelt Island are funded by a generous grant from a private family foundation that shares our dream of... "
  }, 
  {
    "id": "http://islandhousenyc.com/", 
    "contents": "Island House Think You Know Roosevelt Island? Think Again. What if we told you that in as little as 90 seconds, you could be transported to a place where the noise and crush of Midtown Manhattan seem a world away? "
  }, 
  {
    "id": "https://www.point2homes.com/US/Neighborhood/NY/Manhattan/Roosevelt-Island-Demographics.html", 
    "contents": "Roosevelt Island is an area in Roosevelt Island, Manhattan, New York City, New York with a population of 11,551. There are 5,644 male residents living in Roosevelt Island and 5,907 female residents. "
  }, 
  {
    "id": "https://www.point2homes.com/US/Neighborhood/NY/Manhattan/Roosevelt-Island-Demographics.html", 
    "contents": "Roosevelt Island is an area in Roosevelt Island, Manhattan, New York City, New York with a population of 11,551. There are 5,644 male residents living in Roosevelt Island and 5,907 female residents. "
  }, 
  {
    "id": "https://www.zomato.com/new-york-city/roosevelt-island-restaurants/pizza", 
    "contents": "Pizza Restaurants in Roosevelt Island, Manhattan, New York City. Restaurants serving Pizza cuisine in Roosevelt Island, Manhattan, New York City. Menus, Photos, Ratings and Reviews for Pizza Restaurants in Roosevelt Island - Pizza Restaurants "
  }, 
  {
    "id": "https://www.potomacriverrunning.com/event/roosevelt-island-dc-parkrun/2020-06-20/", 
    "contents": "Find “delight in the hardy life of the open” by breaking a sweat along the trails around Theodore Roosevelt Island every Saturday morning at 9am. The Roosevelt Island DC parkrun is not a race against other runners, but rather a FREE 5k timed run against yourself. "
  }, 
  {
    "id": "https://www.schooldigger.com/go/NY/schools/0007704406/school.aspx", 
    "contents": "Ps/Is 217 Roosevelt Island school profile, performance trends and NY state ranking. See how Ps/Is 217 Roosevelt Island ranks with other Roosevelt Island schools. "
  }, 
  {
    "id": "https://www.tripadvisor.ca/Attraction_Review-g60763-d548557-Reviews-The_Roosevelt_Island_Tramway-New_York_City_New_York.html", 
    "contents": "The Roosevelt Island Tramway, New York City: See 3,274 reviews, articles, and 2,142 photos of The Roosevelt Island Tramway, ranked No.87 on TripAdvisor among 1,180 attractions in New York City. "
  }, 
  {
    "id": "https://www.nakedapartments.com/nyc/roosevelt-island-apartments-for-rent", 
    "contents": "Roosevelt Island Apartments are some of the best rentals in New York City. Read more about the neighborhood and the apartments here. "
  }, 
  {
    "id": "http://www.crainsnewyork.com/topics/2258/Roosevelt-Island", 
    "contents": "New York City business news coverage of Roosevelt Island. Get the latest breaking news, slide shows and videos on Roosevelt Island. "
  }, 
  {
    "id": "https://mommypoppins.com/newyorkcitykids/roosevelt-island-things-to-do-for-kids-and-families", 
    "contents": "New York is a city of islands. Many of them, like Governors Island, City Island, Randall's Island, and even the infamous Rikers Island, get lots of attention; however, low-key Roosevelt Island manages to slip under the radar. "
  }, 
  {
    "id": "https://www.britannica.com/place/Roosevelt-Island-New-York", 
    "contents": "Roosevelt Island: Roosevelt Island,, island in the East River, between the boroughs of Manhattan and Queens, New York City. Administratively part of Manhattan, it is 1.5 miles (about 2.5 km) long and 18 mile wide, with an area of 139 acres (56 hectares). "
  }, 
  {
    "id": "http://tatainnovationcenter.com/roosevelt-island/", 
    "contents": "WELCOME TO ROOSEVELT ISLAND Roosevelt Island is home to Cornell Tech’s 12-acre campus the tech community can call home. It’s the place where digital technology is being created, talked about, celebrated and used to transform the world... "
  }, 
  {
    "id": "https://www.britannica.com/place/Roosevelt-Island-New-York", 
    "contents": "Roosevelt Island: Roosevelt Island,, island in the East River, between the boroughs of Manhattan and Queens, New York City. Administratively part of Manhattan, it is 1.5 miles (about 2.5 km) long and 18 mile wide, with an area of 139 acres (56 hectares). "
  }, 
  {
    "id": "http://tatainnovationcenter.com/roosevelt-island/", 
    "contents": "WELCOME TO ROOSEVELT ISLAND Roosevelt Island is home to Cornell Tech’s 12-acre campus the tech community can call home. It’s the place where digital technology is being created, talked about, celebrated and used to transform the world... "
  }, 
  {
    "id": "https://nypost.com/tag/roosevelt-island/", 
    "contents": "Get the latest roosevelt island news, articles, videos and photos on the New York Post. "
  }, 
  {
    "id": "https://www.amny.com/transit/roosevelt-island-tram-facts-and-figures-1.11764786", 
    "contents": "The tramway serves both residents of Roosevelt Island and tourists. "
  }, 
  {
    "id": "https://thehouseatcornelltech.com/location/", 
    "contents": "About Roosevelt Island. Two miles long and just 800 feet wide, Roosevelt Island runs parallel to Manhattan from East 46th Street to East 86th Street, offering a stunning urban backdrop and unbeatable city access along with a quiet, commotion-free feel. "
  }, 
  {
    "id": "https://www.streetadvisor.com/roosevelt-island-manhattan-new-york-city-new-york", 
    "contents": "Roosevelt Island reviews and ratings written by locals. The best place to live in NYC You actually know your neighbors - tons of associations and int... "
  }, 
  {
    "id": "https://tech.cornell.edu/news/cornell-tech-campus-opens-on-roosevelt-island-marking-transformational-mile", 
    "contents": "Cornell Tech is reinventing graduate research and education focused on digital technologies and their impact on individuals, society and the economy "
  }
]