[
  {
    "id": "https://en.wikipedia.org/wiki/Wiki", 
    "contents": "A wiki (/ ˈ w ɪ k i / ( listen) WIK-ee) is a website on which users collaboratively modify content and structure directly from the web browser.In a typical wiki, text is written using a simplified markup language and often edited with the help of a rich-text editor. "
  }, 
  {
    "id": "https://www.lifewire.com/what-is-a-wiki-3486702", 
    "contents": "A beginner's guide to understanding what a wiki is and why wikis have become such a popular source of information gathering and knowledge sharing. "
  }, 
  {
    "id": "https://business.tutsplus.com/tutorials/what-are-wikis-and-why-should-you-use-them--cms-19540", 
    "contents": "'Wiki' is one of the most prevalent buzzwords on the Internet, right up there with 'cloud computing' and 'responsive design'.When you hear the word 'wiki', you most likely think immediately of... "
  }, 
  {
    "id": "https://answers.search.yahoo.com/search?p=what+is+a+wiki", 
    "contents": "347573 related questions "
  }, 
  {
    "id": "http://www.dictionary.com/browse/wiki", 
    "contents": "Wiki definition, a website that allows anyone to add, delete, or revise content by using a web browser. See more. "
  }, 
  {
    "id": "http://wiki.org/wiki.cgi?WhatIsWiki", 
    "contents": "Wiki is a piece of server software that allows users to freely create and edit Web page content using any Web browser. Wiki supports hyperlinks and has a simple text ... "
  }, 
  {
    "id": "https://quizlet.com/17705762/what-is-a-wiki-flash-cards/", 
    "contents": "Start studying What is a Wiki?. Learn vocabulary, terms, and more with flashcards, games, and other study tools. "
  }, 
  {
    "id": "https://www.sitepoint.com/what-is-a-wiki/", 
    "contents": "Different people have different ideas about what a wiki really is, but whatever angle you look at it, a wiki is software that handles complex problems with simple solutions. Wikis Simplify Editing Your Website: Each page on a wiki has an Edit link. If you want to change something on the page, click ... "
  }, 
  {
    "id": "http://www.teachersfirst.com/content/wiki/", 
    "contents": "TeachersFirst's Wiki Walk-Through explains in teacher-friendly terms what wikis are and how they can be used effectively in the classroom. Find out why teachers use wikis. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=-dnL00TdmLY", 
    "contents": "A short explanation of wikis and how they can be used to coordinate a group. This video introduces a wiki website as a resource for helping a group of camper... "
  }, 
  {
    "id": "http://wiki.com/whatiswiki.htm", 
    "contents": "\"A wiki is a database of pages which visitors can edit live.\" The building blocks of wikis are the \"comments\" from visitors. "
  }, 
  {
    "id": "http://wiki.com/whatiswiki.htm", 
    "contents": "\"A wiki is a database of pages which visitors can edit live.\" The building blocks of wikis are the \"comments\" from visitors. "
  }, 
  {
    "id": "https://www.webopedia.com/TERM/W/wiki.html", 
    "contents": "A collaborative Web site comprises the perpetual collective work of many authors. "
  }, 
  {
    "id": "http://www.teachersfirst.com/content/wiki/wikiideas1.cfm", 
    "contents": "TeachersFirst's Wiki Walk-Through explains in teacher-friendly terms what wikis are and how they can be used effectively in the classroom. Find out why teachers use wikis. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=o5HijgcZ0bc", 
    "contents": "http://zerotoprotraining.com This video explains, what is Wiki? Category: Web 2 Tags: Wiki Overview "
  }, 
  {
    "id": "http://wikieducator.org/images/3/34/Newbie_Tut1.pdf", 
    "contents": "wikieducator.org book - Generated using the open source mwlib toolkit - see http://code.pediapress.com for more information What is a Wiki? Tutorial 1 for new WikiEducators "
  }, 
  {
    "id": "https://www.wooster.edu/offices/web/how/scotblogs/wiki-blog/", 
    "contents": "Wiki vs. Blog What is a Wiki? A wiki is a website that allows multiple users to create, modify and organize web page content in a collaborative manner. "
  }, 
  {
    "id": "https://www.wikihow.com/Start-a-Wiki", 
    "contents": "How to Start a Wiki. This wikiHow teaches you how to create a wiki-style website. You can do this by using a free wiki creator such as Wikia or Wikidot, or you can host your own wiki site if you have website hosting experience. "
  }, 
  {
    "id": "https://www.merriam-webster.com/dictionary/wiki", 
    "contents": "Wiki definition is - a website that allows visitors to make changes, contributions, or corrections. Did You Know? a website that allows visitors to make changes, ... "
  }, 
  {
    "id": "https://cft.vanderbilt.edu/guides-sub-pages/wikis/", 
    "contents": "Wikis. Print Version Wikis A wiki is a collaborative tool that allows students to contribute and modify one or more pages of course related materials. Wikis are collaborative in nature and facilitate community-building within a course. "
  }, 
  {
    "id": "http://www.wikia.com/fandom", 
    "contents": "The entertainment site where fans come first. Your daily source for all things TV, movies, and games, including Star Wars, Fallout, Marvel, DC and more. "
  }, 
  {
    "id": "https://encyclopedia2.thefreedictionary.com/Wikipedia", 
    "contents": "Wikipedia The world's largest encyclopedia available on the Web at www.wikipedia.com. Wikipedia is user generated, and anyone can create or edit an article (see wiki). Founded in "
  }, 
  {
    "id": "https://whatis.techtarget.com/definition/Wikipedia", 
    "contents": "Meta-Wiki, which coordinates all the other projects. Wikipedia was one of the first social media websites. This was last updated in January 2016. "
  }, 
  {
    "id": "https://cft.vanderbilt.edu/guides-sub-pages/wikis/", 
    "contents": "Wikis. Print Version Wikis A wiki is a collaborative tool that allows students to contribute and modify one or more pages of course related materials. Wikis are collaborative in nature and facilitate community-building within a course. "
  }, 
  {
    "id": "https://computer.howstuffworks.com/internet/basics/wiki.htm", 
    "contents": "A wiki is a collection of articles that multiple users can add to and edit freely online. Learn all about wikis and how they are published. "
  }, 
  {
    "id": "https://elearningindustry.com/how-to-use-wiki-in-the-classroom", 
    "contents": "Why Teachers Should Use Wiki in the Classroom? Wiki is an online application that allows users to contribute to or edit its content. "
  }, 
  {
    "id": "https://www.wikispaces.com/", 
    "contents": "Further information. Users: If you are a member of a Classroom, Plus or Super Wiki, please contact your Wikispaces organiser directly. The organiser can be found in the \"members\" section. "
  }, 
  {
    "id": "https://techterms.com/definition/wiki", 
    "contents": "The definition of Wiki defined and explained in simple language. "
  }, 
  {
    "id": "http://theelearningcoach.com/elearning2-0/using-wikis-for-elearning/", 
    "contents": "Now that social is more accepted, this might be the time to build a wiki. "
  }, 
  {
    "id": "https://help.blackboard.com/Learn/Instructor/Interact/Wikis", 
    "contents": "Benefits of using wikis. Wikis can help course members build a shared repository of knowledge. As the knowledge base grows over time, you can expect the wiki to have some degree of seriousness and permanence. "
  }, 
  {
    "id": "http://answers.wikia.com/wiki/Wikianswers", 
    "contents": "Wikianswers is a community run question and answer site. Whether you have a question or love sharing your knowledge, Wikianswers is the place for you! "
  }, 
  {
    "id": "https://techterms.com/definition/wiki", 
    "contents": "The definition of Wiki defined and explained in simple language. "
  }, 
  {
    "id": "https://help.blackboard.com/Learn/Instructor/Interact/Wikis", 
    "contents": "Benefits of using wikis. Wikis can help course members build a shared repository of knowledge. As the knowledge base grows over time, you can expect the wiki to have some degree of seriousness and permanence. "
  }, 
  {
    "id": "http://www.ceebl.manchester.ac.uk/events/archive/aligningcollaborativelearning/Wiki.pdf", 
    "contents": "What is a wiki? A wiki is a collection of webpages that can be modified by anyone who has been given access to it. Some wikis are open to anyone with a web connection - others are tightly controlled by small project "
  }, 
  {
    "id": "https://techcommunity.microsoft.com/t5/Microsoft-Teams/New-Teams-get-a-Wiki-in-place-of-a-Notebook/td-p/53730", 
    "contents": "Have you noticed since GA, new Microsoft Teams get a Wiki rather than a OneNote notebook? Why is that? Is it a promotional move to remove - 53730 "
  }, 
  {
    "id": "https://computer.howstuffworks.com/internet/basics/wiki1.htm", 
    "contents": "Because Wikipedia is the largest and most popular wiki on the planet, we will use it as an example to understand how wikis work in practice. If you go to Wikipedia.org and look at the home page, you'll see a welcome screen that shows you how to access different versions of Wikipedia, along with a ... "
  }, 
  {
    "id": "https://sharepointmaven.com/build-knowledge-base-wiki-sharepoint/", 
    "contents": "Ever wanted to build a Knowledge Base or Wiki in SharePoint? This post explains the available options and step by step instructions for each "
  }, 
  {
    "id": "http://www.niu.edu/blackboard/_pdf/guides/wikis.pdf", 
    "contents": "Creating a Wiki 1. From the Control Panel, click Course Tools 2. lick Wikis 3. lick Create Wiki 4. On the Create Wiki page, provide the wiki Name and "
  }, 
  {
    "id": "https://en.share-gate.com/blog/sharepoint-wiki-publishing-web-part-pages-overview", 
    "contents": "Wiki, publishing, and web part pages are various SharePoint pages you can create in your site. But how do you choose which one to use? Learn more here! "
  }, 
  {
    "id": "https://www.atlassian.com/software/confluence/why-wiki-collaboration-software", 
    "contents": "Confluence wiki software connects people and ideas all in one place so you can spend less time hunting things down, and more time making things happen. "
  }, 
  {
    "id": "http://westworld.wikia.com/wiki/Host", 
    "contents": "In the HBO series Westworld, a Host is an artificially created being — an android or artificially created animal — or a human \"developed mind\" (an existing sentience) replicated within an artificial body. "
  }, 
  {
    "id": "https://computers.tutsplus.com/tutorials/how-to-build-your-own-wiki--cms-19772", 
    "contents": "Now that you understand what wikis are all about, and how they can be used in your business, all that's left is to start your own wiki and get your team using it to organize your info. "
  }, 
  {
    "id": "https://simple.wikipedia.org/wiki/Wiki", 
    "contents": "A wiki is a type of website that lets anyone who can access the wiki create and change its pages.The word is Internet slang.The word Wiki is short for WikiWikiWeb.Wikiwiki is a word from the Hawaiian language, meaning \"fast\" or \"speed\". "
  }, 
  {
    "id": "https://www.wikispaces.com/content/classroom/about", 
    "contents": "Wikispaces Classroom is free for teachers and students. ... If you'd like to create a new wiki with Projects, you'll need to create it using Wikispaces Classroom. "
  }, 
  {
    "id": "http://support.etouch.net/cm/wiki/?id=65089", 
    "contents": "New users of SamePage often get confused by all the new terminology like Wikis, Blogs etc. Here is a quick primer on what they mean in general and specifically in the SamePage context. "
  }, 
  {
    "id": "http://pretty-little-liars.wikia.com/wiki/A", 
    "contents": "\"A\" is the main antagonist of the series. \"A\" is an anonymous character who sends threatening messages to Alison DiLaurentis, Aria Montgomery, Spencer Hastings, Hanna Marin, Emily Fields and, in some cases, Mona Vanderwaal. "
  }, 
  {
    "id": "http://www.techforteachers.net/wikis-in-the-classroom.html", 
    "contents": "What's a Wiki? Wikis in the Classroom. Definition: A wiki, according to the definition at Wikipedia, (the most well known wiki) is a collaborative website where the users can contribute. "
  }, 
  {
    "id": "http://www.classroom20.com/forum/topics/difference-between-a-wiki-and", 
    "contents": "I am new to all of this and would like to know the difference between a wiki and a blog. Which do you think is more useful in a school/classroom settting? Whic… "
  }, 
  {
    "id": "https://www.lifewire.com/wiki-list-by-category-3486723", 
    "contents": "A list of wiki sites broken down by category, including wikis about travel, entertainment, games and more. "
  }, 
  {
    "id": "https://technet.microsoft.com/en-us/library/2007.01.wiki.aspx", 
    "contents": "Wikis offer a new, more flexible way to collaborate, promoting an unstructured approach to thinking and exchanging ideas. And MOSS 2007 makes it incredibly easy to implement wikis in your organization. "
  }, 
  {
    "id": "https://www.mediawiki.org/wiki/MediaWiki", 
    "contents": "MediaWiki is a free and open source software wiki package written in PHP, originally for use on Wikipedia. "
  }, 
  {
    "id": "http://www.techforteachers.net/wikis-in-the-classroom.html", 
    "contents": "What's a Wiki? Wikis in the Classroom. Definition: A wiki, according to the definition at Wikipedia, (the most well known wiki) is a collaborative website where the users can contribute. "
  }, 
  {
    "id": "https://www.mindtools.com/pages/article/how-to-create-a-wiki.htm", 
    "contents": "Learn how to set up a wiki to encourage collaboration and knowledge-building in your team. "
  }, 
  {
    "id": "http://www.bbc.co.uk/newsround/16612794", 
    "contents": "But what is Wikipedia and how does it work? Here's Newsround's guide to the world of Wiki ... "
  }, 
  {
    "id": "http://ualr.edu/blackboard/welcome/how-to/blogs/wikis/", 
    "contents": "A wiki is a web site that allows collaborative editing of its content and structure by a community of users. Wikis can be used… Continue reading→ "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Retinol", 
    "contents": "Retinol, also known as Vitamin A 1, is a vitamin found in food and used as a dietary supplement. As a supplement it is used to treat and prevent vitamin A ... "
  }, 
  {
    "id": "https://wiki.nci.nih.gov/display/WikiTrainFAQsTips/Definition+of+child+page%2C+wiki+space%2C+page+family", 
    "contents": "What is a \"child page\"? A child page is a page that is subordinate to another. When you are viewing any page, you can see if it has one or more child pages. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/YouTube", 
    "contents": "YouTube is an American video-sharing website headquartered in San Bruno, California. The service was created by three former PayPal employees ... "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/MSc", 
    "contents": "In Argentina, Brazil, Ecuador, Mexico, Colombia, Panamá, Perú and Uruguay, the Master of Science or Magister is a postgraduate degree of two to four years of duration. ... "
  }, 
  {
    "id": "http://www.wikia.com/Special:CreateNewWiki", 
    "contents": "Create New Wiki. Start a wiki. Whether it's a community focused on world-wide entertainment sensation or a very personal project, it needs a good and unique name: "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Individual_retirement_account", 
    "contents": "An individual retirement account (IRA) is a form of \"individual retirement plan\", provided by many financial institutions, that provides tax advantages for ... "
  }, 
  {
    "id": "http://www.educationworld.com/a_tech/techtorial/techtorial098.shtml", 
    "contents": "100 Report Card Comments It's report card time and you face the prospect of writing constructive, insightful, and original comments on a couple dozen report cards or more. "
  }, 
  {
    "id": "http://cryptidz.wikia.com/wiki/Ropen", 
    "contents": "The Ropen, meaning \"demon flyer\",is a cryptid thought to be either a big bat, or more commonly, a pterosaur on New Guinea Island. It is said to produce a light, possibly to attract fish. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=ZmByB0sIPog", 
    "contents": "What Is A Wiki? Want music and videos with zero ads? Get YouTube Red. "
  }, 
  {
    "id": "http://www.techforteachers.net/wikis-in-the-classroom.html", 
    "contents": "What's a Wiki? Wikis in the Classroom. Definition: A wiki, according to the definition at Wikipedia, (the most well known wiki) is a collaborative website where the users can contribute. "
  }, 
  {
    "id": "https://www.mediawiki.org/wiki/MediaWiki", 
    "contents": "MediaWiki is a free and open source software wiki package written in PHP, originally for use on Wikipedia. "
  }, 
  {
    "id": "https://en.share-gate.com/blog/sharepoint-wiki-publishing-web-part-pages-overview", 
    "contents": "Wiki, publishing, and web part pages are various SharePoint pages you can create in your site. But how do you choose which one to use? Learn more here! "
  }, 
  {
    "id": "http://mianite.wikia.com/wiki/Mianite", 
    "contents": "Mianite is the God of the Overworld. He seems to be the god of order and creation, and is also often as the God of fair, good, and just doings, however, his intentions between Season 1 and Season 2 seem to be vastly different despite being described the same in both seasons. "
  }, 
  {
    "id": "http://creepypasta.wikia.com/wiki/Creepypasta_Wiki", 
    "contents": "Creepypasta Wiki Welcome to the Creepypasta Wiki! Proudly hosting 11,219 of your worst nightmares since 2010. Please be sure to thoroughly read the wiki rules and our ... "
  }, 
  {
    "id": "https://www.wikimedia.org/", 
    "contents": "Wikimedia is a global movement whose mission is to bring free educational content to the world. "
  }, 
  {
    "id": "http://onepiece.wikia.com/wiki/Haki", 
    "contents": "Haki is a mysterious power that is found in every living being in the world. It is not that different from the typical senses. However, most people do not notice it or fail to awaken it. "
  }, 
  {
    "id": "http://www.teachinghistory.org/digital-classroom/tech-for-teachers/14592", 
    "contents": "You need a computer, an internet connection, and a provider to host your wiki. Wikispaces, one of the most popular in the K-12 world, offers free wikis for educators as well as fee-based services for entire school systems. "
  }, 
  {
    "id": "http://community.wikia.com/wiki/Help:User_rights", 
    "contents": "A user right is a special type of permission a user has to make some change or perform some task for a community. A \"user rights group\" is a set of permissions or abilities. "
  }, 
  {
    "id": "https://opensource.com/business/15/6/wikis-for-documentation", 
    "contents": "The best documentation is what actually gets written, so always favor a wiki over no documentation at all. "
  }, 
  {
    "id": "http://walkingdead.wikia.com/wiki/A", 
    "contents": "\"A\" is the sixteenth and final episode of the fourth season of AMC's The Walking Dead. It is the fifty-first episode of the series overall. It premiered on March 30, 2014 at 9/8c on AMC, and on March 31, 2014 at 9pm on Fox. "
  }, 
  {
    "id": "https://help.blackboard.com/Learn/Student/Interact/Wikis", 
    "contents": "A wiki is a collaborative tool that allows you to contribute and modify one or more pages of course-related materials. A wiki provides an area where users can collaborate on content. "
  }, 
  {
    "id": "https://www.cio.com/article/2438542/web-services/blogs-and-wikis-in-the-business-world-definition-and-solutions.html", 
    "contents": "Blogs and Wikis in the Business World Definition and Solutions Blogs and Wikis in the Business World topics covering definition, objectives, systems and solutions. "
  }, 
  {
    "id": "https://social.technet.microsoft.com/wiki/", 
    "contents": "Technical articles, content and resources for IT Professionals working in Microsoft technologies "
  }, 
  {
    "id": "https://quizlet.com/20508226/wiki-quizlet-flash-cards/", 
    "contents": "Great Depression Learn with flashcards, games, and more — for free. "
  }, 
  {
    "id": "http://oneproblemless.com/2010/12/11/what-does-wiki-stand-for/", 
    "contents": "Yesterday we were discussing the latest bit of news on WikiLeaks over lunch, when somebody asked “Where does the word “Wiki” come from? What does it mean?” Good question! "
  }, 
  {
    "id": "http://www.wikimatrix.org/", 
    "contents": "Random Wiki. Wagn RailsInside says Wagn is \"revolutionary\" and \"advancing the state of the art\" Wagn is a wiki approach to building great web tools. Using building blocks called \"cards\", each of which has a unique name and revision history, you can build up powerful, efficient structures that save you a ton of work and cultivate healthy ... "
  }, 
  {
    "id": "https://help.github.com/articles/about-github-wikis/", 
    "contents": "Every GitHub repository comes equipped with a section for hosting documentation, called a wiki.. GitHub Wikis are a place in your repository where you can share long-form content about your project, such as how to use it, how it's been designed, manifestos on its core principles, and so on. "
  }, 
  {
    "id": "https://www.pcmag.com/article2/0,2817,2399582,00.asp", 
    "contents": "Need a mini-version of Wikipedia for your own notes, your workgroup, or just for fun? Here's what you need to know. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Influenza_A_virus", 
    "contents": "Influenza A virus causes influenza in birds and some mammals, and is the only species of influenza virus A genus of the Orthomyxoviridae family of viruses. "
  }, 
  {
    "id": "https://www.informationweek.com/how-to-use-wikis-for-business/d/d-id/1034971", 
    "contents": "Content management systems will always have their place in the publishing world, but they've never been the best tools for business collaboration. A simple open-source app called the wiki may soon rule the knowledge management roost. Anyone who's worked on even one team project in an enterprise can ... "
  }, 
  {
    "id": "https://technet.microsoft.com/en-us/library/ee721051(v=office.14).aspx", 
    "contents": "An Enterprise Wiki is a publishing site for sharing and updating large volumes of information across an enterprise. If an organization needs a large, centralized knowledge repository that is designed to both store and share information on an enterprise-wide scale, consider using an Enterprise Wiki. "
  }, 
  {
    "id": "http://www.clickonf5.org/internet/10-free-opensource-wiki-software-engine/7599", 
    "contents": "There are many good Wiki Software platforms or Wiki engines available, which are open source and free. I am listing below 10 most popular and widely used Wiki engines "
  }, 
  {
    "id": "https://support.office.com/en-gb/article/create-and-edit-a-wiki-dc64f9c2-d1a2-44b5-ac59-b9d535551a32", 
    "contents": "See how to create and edit a wiki, and learn about different types of wikis you can create. "
  }, 
  {
    "id": "http://www.wikia.com/Special:CreateNewWiki", 
    "contents": "Create New Wiki. Start a wiki. Whether it's a community focused on world-wide entertainment sensation or a very personal project, it needs a good and unique name: "
  }, 
  {
    "id": "http://oneproblemless.com/2010/12/11/what-does-wiki-stand-for/", 
    "contents": "Yesterday we were discussing the latest bit of news on WikiLeaks over lunch, when somebody asked “Where does the word “Wiki” come from? What does it mean?” Good question! "
  }, 
  {
    "id": "http://educationalwikis.wikispaces.com/Examples+of+educational+wikis", 
    "contents": "The educational wikis on this page are listed in alphabetical order. They are awesome and we invite you to add your educational wiki to our list! You may also add the name of your country and a mini flag. "
  }, 
  {
    "id": "https://www.pcmag.com/article2/0,2817,2399582,00.asp", 
    "contents": "Need a mini-version of Wikipedia for your own notes, your workgroup, or just for fun? Here's what you need to know. "
  }, 
  {
    "id": "https://meredith.wolfwater.com/wordpress/2006/08/20/what-are-wikis-good-for/", 
    "contents": "Thank you. I am a teacher trying to learn about Wikis. What kind of software does one need to participate in a Wiki? Thanks, again. "
  }, 
  {
    "id": "https://meta.stackexchange.com/questions/11740/what-are-community-wiki-posts", 
    "contents": "Some questions and answers are marked Community Wiki and are owned by a community wiki user: (in fact, this very question is one of them) Why have Community Wiki posts? "
  }, 
  {
    "id": "https://simple.wikipedia.org/wiki/Car", 
    "contents": "A car is a road vehicle used to carry passengers. It is also called an automobile, which comes from the Greek word \"auto\" and the French word \"mobile\". "
  }, 
  {
    "id": "http://www.eagles-lair.org/local_content/meth/wikipedia_Methamphetamine.html", 
    "contents": "Methamphetamine (methylamphetamine or desoxyephedrine), popularly shortened to meth and also nicknamed \"ice\" and Tina, is a psychostimulant and sympathomimetic drug.The dextrorotatory isomer dextromethamphetamine can be prescribed to treat attention-deficit hyperactivity disorder, though unmethylated amphetamine is more commonly prescribed. "
  }, 
  {
    "id": "https://www.socialmediatoday.com/content/how-write-wikipedia-entry", 
    "contents": "How To Write A Wikipedia Entry Author By. Sarah Hartshorn ... A large network of Wiki editors review all articles that are submitted and use a group approval ... "
  }, 
  {
    "id": "https://blackboard.ku.edu/wikis", 
    "contents": "Wikis Wikis provide a collaborative space where students can view, contribute and edit shared content. Much like building a Web page with a content management system, students can add images, videos, web links and other content to wiki pages. "
  }, 
  {
    "id": "https://support.office.com/en-gb/article/create-and-edit-a-wiki-dc64f9c2-d1a2-44b5-ac59-b9d535551a32", 
    "contents": "See how to create and edit a wiki, and learn about different types of wikis you can create. "
  }, 
  {
    "id": "http://hero.wikia.com/wiki/Kangaroo_Jack", 
    "contents": "Kangaroo Jack, also known as Jackie Legs, is the titular tetartagonist of Kangaroo Jack and Kangaroo Jack: G'Day, U.S.A.!. His friends are Charlie Carbone and Louis Booker He is voiced by an uncredited Adam Garcia in the first film and by Jeff Bennett in the second film. "
  }
]