[
  {
    "id": "http://oldtownscottsdale.com/", 
    "contents": "Old Town Scottsdale and Scottsdale, AZ your local directory to plan for dining, things to do, hotels and restaurants in Scottsdale to events. You can also find downtown Scottsdale AZ shopping and services. "
  }, 
  {
    "id": "http://www.downtownscottsdale.com/", 
    "contents": "Old Town Scottsdale "
  }, 
  {
    "id": "https://www.visitphoenix.com/things-to-do/old-town-scottsdale/", 
    "contents": "Old Town—also known as Downtown—Scottsdale offers boutique shopping with a Southwestern flair, a density of bars, lounges, restaurants and clubs, plus art galleries and museums. "
  }, 
  {
    "id": "https://images.search.yahoo.com/search/images?p=old+town+scottsdale", 
    "contents": "More Old Town Scottsdale images "
  }, 
  {
    "id": "https://www.experiencescottsdale.com/old-town/", 
    "contents": "Discover the best restaurants, bars and things to do in the downtown & Old Town Scottsdale areas. "
  }, 
  {
    "id": "https://www.opentable.com/n/phoenix/scottsdale/old-town-scottsdale-restaurants", 
    "contents": "Find Old Town Scottsdale restaurants in the Scottsdale area and other neighborhoods such as North Scottsdale, Central Scottsdale, Cave Creek, and more. Make restaurant reservations and read reviews. "
  }, 
  {
    "id": "https://www.tripadvisor.com/Attraction_Review-g31350-d505365-Reviews-Old_Town_Scottsdale-Scottsdale_Arizona.html", 
    "contents": "Book your tickets online for Old Town Scottsdale, Scottsdale: See 4,589 reviews, articles, and 1,041 photos of Old Town Scottsdale, ranked No.27 on TripAdvisor among 173 attractions in Scottsdale. "
  }, 
  {
    "id": "http://www.scottsdaleaz.gov/old-town", 
    "contents": "Old Town Scottsdale is among the most vibrant and unique urban centers in the American Southwest. "
  }, 
  {
    "id": "https://www.yelp.com/biz/old-town-scottsdale-scottsdale", 
    "contents": "115 reviews of Old Town Scottsdale \"This is a great place for lots to do for everyone. Families can come for a nice afternoon meal, a nice stroll around the park or in the souvenir shops, or if you're lucky you'll run into some event they're… "
  }, 
  {
    "id": "https://www.10best.com/destinations/arizona/scottsdale/shopping/best-of-scottsdales-old-town/", 
    "contents": "Old Town Scottsdale is known for historic Western buildings, acclaimed art galleries, nightlife, fine dining, and of course, shopping. This is where you go to pick up that special Scottsdale souvenir. "
  }, 
  {
    "id": "https://www.yelp.com/search?find_desc=Old+Town+Restaurants&find_loc=Scottsdale%2C+AZ", 
    "contents": "Reviews on Old town restaurants in Scottsdale, AZ - Citizen Public House, Bandera, The Mission Old Town, Vines & Hops, Olive & Ivy, Cafe Monarch, Scapegoat Beer and Wine, FnB, Rehab Burger Therapy, Sel, Tommy V's Urban Kitchen & Bar, Second Story… "
  }, 
  {
    "id": "https://www.10best.com/destinations/arizona/scottsdale/old-town/", 
    "contents": "Travel guide for Old Town, Scottsdale, on the best things to do in Old Town. 10Best reviews restaurants, attractions, nightlife, clubs, bars, hotels, events, and shopping inOld Town. "
  }, 
  {
    "id": "http://oldtownscottsdale.com/business-categories/things-to-do/", 
    "contents": "Second Nature Clinic located in the heart of Old Town Scottsdale is your health stop for Naturopathic & Ayurvedic Medicine ... Read More » "
  }, 
  {
    "id": "https://www.yelp.com/search?find_desc=Old+Town+Restaurants&find_loc=Scottsdale%2C+AZ", 
    "contents": "Reviews on Old town restaurants in Scottsdale, AZ - Citizen Public House, Bandera, The Mission Old Town, Vines & Hops, Olive & Ivy, Cafe Monarch, Scapegoat Beer and Wine, FnB, Rehab Burger Therapy, Sel, Tommy V's Urban Kitchen & Bar, Second Story… "
  }, 
  {
    "id": "https://www.tripadvisor.com/RestaurantsNear-g31350-d505365-Old_Town_Scottsdale-Scottsdale_Arizona.html", 
    "contents": "Restaurants near Old Town Scottsdale, Scottsdale on TripAdvisor: Find traveler reviews and candid photos of dining near Old Town Scottsdale in Scottsdale, Arizona. "
  }, 
  {
    "id": "http://www.thescottresort.com/things-to-do-in-scottsdale/old-town-scottsdale/", 
    "contents": "Discover all of the amazing things to do in Old Town Scottsdale. Enjoy all of the attractions during your next getaway with The Scott Resort & Spa. "
  }, 
  {
    "id": "https://www.oldtowntavernaz.com/", 
    "contents": "The biggest little stage in Old Town. A great bar in Scottsdale AZ with Ice cold beer, the best cocktails, live music and good times. "
  }, 
  {
    "id": "https://www.facebook.com/Old.Town.Scottsdale", 
    "contents": "Old Town Scottsdale, Scottsdale, AZ. 33,921 likes · 604 talking about this · 188,255 were here. @oldtownsctsdale #oldtownscottsdale For Guest list and... "
  }, 
  {
    "id": "https://www.redfin.com/neighborhood/106650/AZ/Scottsdale/Old-Town-Scottsdale", 
    "contents": "Find Homes For Sale for sale in Old Town Scottsdale, Scottsdale, AZ. Tour Homes For Sale & make offers with the help of local Redfin real estate agents. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Scottsdale,_Arizona", 
    "contents": "Old Town Scottsdale is an area with many streets, old fashion stores, restaurants, bars, nightclubs, and art galleries. It contains the major nightlife for the area ... "
  }, 
  {
    "id": "https://www.marriott.com/hotels/maps/travel/phxsc-courtyard-scottsdale-old-town/", 
    "contents": "Map your way to adventure from Courtyard Scottsdale Old Town, offering easy access to Phoenix Sky Harbor International Airport for all of your travel needs. "
  }, 
  {
    "id": "https://www.facebook.com/Old.Town.Scottsdale", 
    "contents": "Old Town Scottsdale, Scottsdale, AZ. 33,921 likes · 604 talking about this · 188,255 were here. @oldtownsctsdale #oldtownscottsdale For Guest list and... "
  }, 
  {
    "id": "https://www.marriott.com/hotels/travel/phxst-scottsdale-marriott-suites-old-town/", 
    "contents": "Discover a home away from home at the Scottsdale Marriott Suites Old Town. Our hotel boasts spacious, modern guest suites and a stellar downtown location. "
  }, 
  {
    "id": "https://www.inspirock.com/united-states/scottsdale/old-town-scottsdale-a419205239", 
    "contents": "Plan to visit Old Town Scottsdale, United States. Get details of Location, timings and contact. Find the reviews and ratings to know better. "
  }, 
  {
    "id": "https://www.hoteladeline.com/", 
    "contents": "Meet Hotel Adeline, a new boutique hotel in Downtown Scottsdale, Arizona. The property infuses an eclectic style and energy all within Old Town Scottsdale, AZ. "
  }, 
  {
    "id": "http://www.oldtowngringos.com/", 
    "contents": "Bar and restaurant in Scottsdale AZ with a dog friendly patio and a both inside and outside bar areas serving food until late night. "
  }, 
  {
    "id": "https://www.hotels.com/ho116542/scottsdale-marriott-suites-old-town-scottsdale-united-states-of-america/", 
    "contents": "Scottsdale Marriott Suites Old Town in Phoenix on Hotels.com and earn Rewards nights. Collect 10 nights get 1 free*. Read 90 genuine guest reviews for Scottsdale Marriott Suites Old Town "
  }, 
  {
    "id": "https://www.booking.com/landmark/us/old-town-scottsdale.html", 
    "contents": "Find hotels near Old Town Scottsdale, USA online. Good availability and great rates. Book online, pay at the hotel. No reservation costs. "
  }, 
  {
    "id": "https://www.apartments.com/downtown-scottsdale-scottsdale-az/", 
    "contents": "See all 157 apartments in Downtown Scottsdale, Scottsdale, AZ currently available for rent. ... At a bar like the Brat Haus or the Old Town Tavern, ... "
  }, 
  {
    "id": "https://thesaguaro.com/scottsdale/", 
    "contents": "Newly renovated guest rooms and event complex. Old Town Scottsdale's largest hotel event venue. Pool days & margaritas are at your fingertips at Saguaro. "
  }, 
  {
    "id": "https://www.experiencescottsdale.com/", 
    "contents": "Welcome to Scottsdale! At the heart of every great vacation is passion – for a new place, a new adventure, even a new way of expressing yourself. "
  }, 
  {
    "id": "https://www.hotels.com/ho164910/extended-stay-america-phoenix-scottsdale-old-town-scottsdale-united-states-of-america/", 
    "contents": "Extended Stay America - Phoenix - Scottsdale - Old Town in Scottsdale on Hotels.com and earn Rewards nights. Collect 10 nights get 1 free*. Read 255 genuine guest reviews for Extended Stay America - Phoenix - Scottsdale - Old Town "
  }, 
  {
    "id": "https://www.facebook.com/OldTownScottsdaleFarmersMarket", 
    "contents": "Old Town Scottsdale Farmers Market, Scottsdale, Arizona. 2.7K likes. Located in Old Town Scottsdale, the farmers market connects the community and local... "
  }, 
  {
    "id": "http://www.oldtownscottsdalehotels.com/", 
    "contents": "Search for hotels in Old Town Scottsdale. You can book your hotel with confidence, see what there is to do, and what is going on in Old Scottsdale. "
  }, 
  {
    "id": "https://scottsdalecondolofts.com/old-town-scottsdale-condo-rentals/", 
    "contents": "View Old Town Scottsdale Condo Rentals. See upper floor units with grand views of Scottsdale, and penthouse units with sweeping panoramic views of the skyline. "
  }, 
  {
    "id": "https://www.zomato.com/scottsdale-az/old-town-scottsdale-restaurants?happyhour=1", 
    "contents": "Happy Hours in Old Town Scottsdale. Menu, Photos, Ratings and Reviews of Restaurants and Bars with Happy Hours in Old Town Scottsdale "
  }, 
  {
    "id": "https://www.apartments.com/colonial-grand-at-old-town-scottsdale-scottsdale-az/d5rjphj/", 
    "contents": "See all available apartments for rent at Colonial Grand at Old Town Scottsdale in Scottsdale, AZ. Colonial Grand at Old Town Scottsdale has rental units ranging from 814-1263 sq ft starting at $998. "
  }, 
  {
    "id": "https://www.expedia.com/Old-Town-Hotels.d6160565.Travel-Guide-Hotels", 
    "contents": "If you're thinking of visiting Old Town, you could also check out hotels in Scottsdale. Scottsdale is a suburb situated 0.2 miles northwest of central Old Town. Alternatively, you could take a look at Expedia's Tempe Town Lake hotels guide for accommodation options in Tempe Town Lake, another ... "
  }, 
  {
    "id": "https://www.tripadvisor.co.nz/Attraction_Review-g31350-d505365-Reviews-Old_Town_Scottsdale-Scottsdale_Arizona.html", 
    "contents": "Book your tickets online for Old Town Scottsdale, Scottsdale: See 4,601 reviews, articles, and 1,044 photos of Old Town Scottsdale, ranked No.27 on TripAdvisor among 172 attractions in Scottsdale. "
  }, 
  {
    "id": "https://rnrscottsdale.com/", 
    "contents": "WELCOME TO RNR. Located in the heart of Old Town Scottsdale, RnR Gastropub provide the only two-story dining patio overlooking the vibrancy of Scottsdale Road. "
  }, 
  {
    "id": "http://www.scottsdaleaz.gov/events", 
    "contents": "Main Event Calendar for the City of Scottsdale "
  }, 
  {
    "id": "https://res.cloudinary.com/simpleview/image/upload/v1/clients/scottsdale/Scottsdale_historic_walking_tour_2017_a53368fd-658b-4aa1-9a0b-e27d35ee341c.pdf", 
    "contents": "HISTORIC OLD TOWN SCOTTSDALE A 60-MINUTE SELF-GUIDED WALKING TOUR P PARKING LOT/GARAGE WALKING PATH LEGEND bears the name of the family patriarch, J. Chew. The family lived THE “LITTLE RED SCHOOLHOUSE” "
  }, 
  {
    "id": "https://scottsdaleoldtown.place.hyatt.com/en/hotel/home.html", 
    "contents": "Located in the heart of Old Town Scottsdale, Hyatt Place Scottsdale/Old Town offers pet-friendly guest rooms with free Wi-Fi, parking, and breakfast. "
  }, 
  {
    "id": "https://oldtownos.com/", 
    "contents": "3501 North Scottsdale Road, Suite 226 Scottsdale, Arizona 85251 ... All of our team members at Old Town Oral Surgery are CPR certified and have additional training in ... "
  }, 
  {
    "id": "http://artoficecreamexperience.com/", 
    "contents": "An Instagrammable Experience Celebrating America's Love of Ice Cream through color and taste. Limited 3-month engagement opening: 11/22/2017. Scottsdale, AZ "
  }, 
  {
    "id": "https://www.zomato.com/scottsdale-az/old-town-scottsdale-restaurants?sports_bar=1", 
    "contents": "Old Town Scottsdale Sports bars; View Menus, Photos, Ratings and Reviews for all Sports Bars in Old Town Scottsdale on Zomato - Sports Bars in Old Town Scottsdale "
  }, 
  {
    "id": "http://www.kay-grant.com/old-town-scottsdale-condos/", 
    "contents": "If you are looking to be walking distance to old town Scottsdale, then this 2 bedroom, 1.5 bath two story townhome is for you. Remodeled in 2018 with new interior paint t... "
  }, 
  {
    "id": "https://www.viator.com/Phoenix-attractions/Old-Town-Scottsdale/d639-a3897", 
    "contents": "Old Town Scottsdale - Phoenix Attractions from Viator.com "
  }, 
  {
    "id": "http://majerles.com/old-town-scottsdale/", 
    "contents": "This Month at Majerle's Old Town Scottsdale: Majerle's Sports Grill in Old Town Scottsdale 4425 N. Saddlebag Trail Scottsdale, Arizona 85251 Phone: (480) 889 ... "
  }, 
  {
    "id": "http://www.thescottresort.com/", 
    "contents": "Located in Old Town Scottsdale, The Scott Resort sets the stage for your perfect private dining event. Meetings & Events Scottsdale Meetings and Events at The Scott ... "
  }, 
  {
    "id": "https://www.themissionaz.com/", 
    "contents": "The Mission Old Town 3815 N Brown Ave Scottsdale, AZ 85251 (480) 636-5005. Events Manager. Sonia Sorensen 480-584-8222 "
  }, 
  {
    "id": "https://travel.hilton.com/en_us/guides/phoenix/neighborhoods/scottsdale-old-town/", 
    "contents": "Get advice from local experts on the best attractions, restaurants and things to do in Scottsdale / Old Town Scottsdale. Read our guide to Scottsdale / Old Town Scottsdale and plan your perfect trip now. "
  }, 
  {
    "id": "https://www.apartmentguide.com/apartments/Arizona/Scottsdale/Colonial-Grand-at-Old-Town-Scottsdale/9814/", 
    "contents": "Find your new home at Colonial Grand at Old Town Scottsdale located at 2929 N. 70th Street, Scottsdale, AZ 85251. Check availability now! "
  }, 
  {
    "id": "http://oreganos.com/locations/old-town-scottsdale/", 
    "contents": "Visit Oregano's in Old Town Scottsdale - your neighborhood Italian restaurant. "
  }, 
  {
    "id": "https://www.booking.com/hotel/us/courtyard-scottsdale-old-town.html", 
    "contents": "This hotel features an outdoor pool and fitness center, just a 10-minute walk from many of Scottsdale’s restaurants and art galleries. "
  }, 
  {
    "id": "https://www.oldtowntavernaz.com/#!", 
    "contents": "The biggest little stage in Old Town. A great bar in Scottsdale AZ with Ice cold beer, the best cocktails, live music and good times. "
  }, 
  {
    "id": "http://www.kay-grant.com/oldtown-scottsdale-forsale-search/", 
    "contents": "View all Old Town Scottsdale homes for sale including all Old Town Scottsdale condos for sale. Search by Old Town Scottsdale neighborhood or subdivision "
  }, 
  {
    "id": "http://arizonacommunityfarmersmarkets.com/FM_OldTownScottsdale.html", 
    "contents": "Scottsdale Old Town Farmers Market in Arizona providing locally grown, farm fresh, vegetables, fruits, meats, and food products. "
  }, 
  {
    "id": "https://www.ihg.com/holidayinnexpress/hotels/us/en/scottsdale/phxsr/hoteldetail", 
    "contents": "Holiday Inn Express & Suites Scottsdale - Old Town gives you easy access to Scottsdale, AZ attractions like Fashion Square Mall, Old Town, and Phoenix Zoo. "
  }, 
  {
    "id": "https://www.vrbo.com/973651", 
    "contents": "Old Town Scottsdale Condo. This is a modern & clean 2 bedroom condo in the heart of Downtown (Old Town) Scottsdale. This is a first floor unit, no stairs, wa... "
  }, 
  {
    "id": "http://banderarestaurants.com/locations/scottsdale/", 
    "contents": "In charming Old Town Scottsdale, Bandera features comforting American cuisine with a Southwestern flair and rotisserie chickens cooking over an open fire. "
  }, 
  {
    "id": "http://oreganos.com/locations/old-town-scottsdale/", 
    "contents": "Visit Oregano's in Old Town Scottsdale - your neighborhood Italian restaurant. "
  }, 
  {
    "id": "http://www.phoenixnewtimes.com/restaurants/5-best-restaurants-in-scottsdale-right-now-6540774", 
    "contents": "Drive down Scottsdale Road and you'll come within reach of many of the restaurants that have helped put the Valley's dining scene on the map. Old Town Scottsdale is, of course, a destination for both tourists and local food lovers, but look just beyond the confines of that crowded dining scene and ... "
  }, 
  {
    "id": "https://www.oldtowntavernaz.com/#!", 
    "contents": "The biggest little stage in Old Town. A great bar in Scottsdale AZ with Ice cold beer, the best cocktails, live music and good times. "
  }, 
  {
    "id": "https://www.vrbo.com/973651", 
    "contents": "Old Town Scottsdale Condo. This is a modern & clean 2 bedroom condo in the heart of Downtown (Old Town) Scottsdale. This is a first floor unit, no stairs, wa... "
  }, 
  {
    "id": "https://travel.hilton.com/en_us/guides/phoenix/neighborhoods/scottsdale-old-town/", 
    "contents": "Get advice from local experts on the best attractions, restaurants and things to do in Scottsdale / Old Town Scottsdale. Read our guide to Scottsdale / Old Town Scottsdale and plan your perfect trip now. "
  }, 
  {
    "id": "https://www.realscottsdalehomes.com/old-town-scottsdale/", 
    "contents": "Looking for homes for sale in Old Town Scottsdale? Professional real estate agent Ryan Ney specializes in luxury homes & condo sales in Old Town & Downtown Scottsdale AZ "
  }, 
  {
    "id": "http://rehabburgertherapy.com/", 
    "contents": "The best burger is Old Town, Scottsdale. Rehab Burger Therapy was founded on the idea that everyone deserves a break from the daily grind. "
  }, 
  {
    "id": "https://dentistryofoldtownscottsdale.com/", 
    "contents": "Scottsdale Dentist, Dr. Bradley Brittain, provides general family dentistry services in the heart of Old Town Scottsdale. "
  }, 
  {
    "id": "https://www.liveatthestetson.com/", 
    "contents": "High-end urban living Inspired by Old town's vibrant energy, The Stetson is the ultimate living destination for those who want a home that radiates style, while still being walking distance from top shopping, restaurants, and nightlife. "
  }, 
  {
    "id": "https://scottsdale.house.hyatt.com/en/hotel/home.html", 
    "contents": "Get away to the Hyatt House Scottsdale / Old Town with spacious one- and two-bedroom suites in the heart of the action. Book your rooms at our hotel in Scottsdale, AZ. "
  }, 
  {
    "id": "http://arizonafarmersmarkets.com/ScottsdaleOTsat.htm", 
    "contents": "Located in Old Town Scottsdale on Brown Rd. and 1st. St. in the City parking lot this farmers market features farm fresh local produce and food products. "
  }, 
  {
    "id": "https://dentistryofoldtownscottsdale.com/", 
    "contents": "Scottsdale Dentist, Dr. Bradley Brittain, provides general family dentistry services in the heart of Old Town Scottsdale. "
  }, 
  {
    "id": "https://oldtownshuttle.com/", 
    "contents": "Old Town Shuttle is pleased to provide an array of services that include our golf cart taxi service, unique tours of Old Town Scottsdale, and special event services. "
  }, 
  {
    "id": "http://www.berdenas.com/", 
    "contents": "Berdena's is a specialty coffee shop in the heart of Old Town Scottsdale serving only the finest coffee and food. "
  }, 
  {
    "id": "https://www.zillow.com/phoenix-az/old-town-scottsdale-_att/", 
    "contents": "Zillow has 37 homes for sale in Phoenix AZ matching Old Town Scottsdale. View listing photos, review sales history, and use our detailed real estate filters to find the perfect place. "
  }, 
  {
    "id": "https://www.tripadvisor.ca/HotelsNear-g31350-d505365-Old_Town_Scottsdale-Scottsdale_Arizona.html", 
    "contents": "Hotels near Old Town Scottsdale, Scottsdale on TripAdvisor: Find 18,924 traveller reviews, 16,030 candid photos, and prices for 30 hotels near Old Town Scottsdale in Scottsdale, AZ. "
  }, 
  {
    "id": "http://hiltongardeninn3.hilton.com/en/hotels/arizona/hilton-garden-inn-scottsdale-old-town-SCTGIGI/about/amenities.html", 
    "contents": "Our Old Town Scottsdale hotel features an onsite restaurant, fitness center, pool & great in-room amenities. Learn more about our Scottsdale, AZ hotel amenities. "
  }, 
  {
    "id": "https://wastedgrain.com/", 
    "contents": "Wasted Grain & 100 Proof Lounge Nightclub in Old Town Scottsdale, Live Music, Great Food, Happy Hour Specials. Come enjoy the best of Scottsdale Nightlife! "
  }, 
  {
    "id": "http://www.aloftscottsdale.com/", 
    "contents": "Stay in style at Aloft Scottsdale. ... Explore the city's vibrant Entertainment District, dine in Old Town Scottsdale, or shop 'til you drop at Fashion Square Mall. "
  }, 
  {
    "id": "http://morningsqueeze.com/scottsdale/", 
    "contents": "Looking for one of the best breakfast restaurants in Scottsdale? Morning Squeeze combines traditional breakfast with organic, locally grown ingredients. We serve brunch & lunch too! "
  }, 
  {
    "id": "https://www.realtor.com/realestateandhomes-search/Downtown-Scottsdale_Scottsdale_AZ/type-condo-townhome-row-home-co-op", 
    "contents": "Find condos, townhomes and row homes for sale in Downtown Scottsdale, Scottsdale, ... Old Town, Chicago, IL: By Street or Address: 910 E Hamilton Ave, ... "
  }, 
  {
    "id": "https://www.fodors.com/world/north-america/usa/arizona/phoenix-scottsdale-and-tempe/things-to-do/sights/reviews/old-town-scottsdale-133304", 
    "contents": "Everything you need to know about Old Town Scottsdale, from our travel experts. "
  }, 
  {
    "id": "http://www.brathausaz.com/", 
    "contents": "Brat Haus, located in Old Town Scottsdale Arizona is the premier beer garden and best place for house made sausages and craft beer. "
  }, 
  {
    "id": "https://themintaz.com/", 
    "contents": "ABOUT THE MINT ULTRA LOUNGE ... The Mint boasts the largest patio in Old Town Scottsdale; 4,500 square feet dedicated to al fresco drinking and mingling, ... "
  }, 
  {
    "id": "https://www.cafemonarch.com/", 
    "contents": "Café Monarch, in Old Town Scottsdale, is a family-owned and operated restaurant offering an ultra-romantic setting for your birthday, anniversary, ... "
  }, 
  {
    "id": "https://www.grimaldispizzeria.com/locations/old-town/", 
    "contents": "Built in 2003, our Grimaldi’s in Old Town Scottsdale was the first Grimaldi’s Pizzeria in Arizona. Our restaurant offers you multiple ways to dine with us depending on your preference. "
  }, 
  {
    "id": "https://ilovefarmandcraft.com/", 
    "contents": "Old Town Scottsdale. About; Menus; ... Farm & Craft is focused on healthy and sustainable food in a community-style ... 4302 N. Scottsdale Rd. Scottsdale, AZ 85251 ... "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/List_of_historic_properties_in_Scottsdale,_Arizona", 
    "contents": "This is a list of historic properties in Scottsdale, ... Old Town Scottsdale houses many local businesses and is located on the original townsite of Scottsdale. "
  }, 
  {
    "id": "https://www.viator.com/tours/Phoenix/Segway-Tour-of-Old-Town-Scottsdale/d639-5559OLDTOWN", 
    "contents": "Discover the historic charm of Old Town Scottsdale by Segway on this 2-hour tour, the easiest and most fun way to see this vibrant part of town. Though its name harks back to the town’s early days, this is not a sleepy neighborhood. "
  }, 
  {
    "id": "http://mayaclubaz.com/events/", 
    "contents": "Live Music in Scottsdale and today's biggest EDM dj's. Maya is your home for Scottsdale's biggest dance party and best production quality rivaling shows and clubs on the Las Vegas strip. "
  }, 
  {
    "id": "https://ilovefarmandcraft.com/", 
    "contents": "Old Town Scottsdale. About; Menus; ... Farm & Craft is focused on healthy and sustainable food in a community-style ... 4302 N. Scottsdale Rd. Scottsdale, AZ 85251 ... "
  }, 
  {
    "id": "http://scapegoatbar.com/", 
    "contents": "Scapegoat Beer and Wine in Old Town Scottsdale, is a small craft beer and wine bar that prides itself on providing exceptional service, food and drink. "
  }, 
  {
    "id": "https://www.viator.com/tours/Phoenix/Segway-Tour-of-Old-Town-Scottsdale/d639-5559OLDTOWN", 
    "contents": "Discover the historic charm of Old Town Scottsdale by Segway on this 2-hour tour, the easiest and most fun way to see this vibrant part of town. Though its name harks back to the town’s early days, this is not a sleepy neighborhood. "
  }, 
  {
    "id": "https://www.themissionaz.com/the-mission-old-town-1/", 
    "contents": "Old Town Scottsdale’s heart is beating to a Latin drum, now that The Mission has arrived and brightened the restaurant scene. Renowned Zinc Bistro Chef Matt ... "
  }, 
  {
    "id": "https://www.wyndhamhotels.com/hojo/scottsdale-arizona/howard-johnson-scottsdale-az/overview?CID=LC:HJ::GGL:RIO:National:46020&iata=00065402", 
    "contents": "Our Howard Johnson Scottsdale Old Town hotel is just minutes from famed restaurants, vibrant nightlife, premier shopping outlets, ... "
  }, 
  {
    "id": "http://www.thecasablancalounge.com/", 
    "contents": "Enjoy barrel-aged beverages in our progressive lounge, an exotic cocktail on one of our panoramic balconies overlooking Old Town Scottsdale and Camelback Mountain, ... "
  }, 
  {
    "id": "http://garymaygroup.com/real-estate/scottsdale-old-town/", 
    "contents": "Old Town, Scottsdale, Arizona – Real Estate Profile. Old Town Scottsdale is one of the most picturesque and visited attractions in Arizona. Best known for its Native American Galleries and Southwest Shops, Old Town Scottsdale just renovated many of its historic shops and has added phenomenal new real estate like stores, restaurants, and ... "
  }, 
  {
    "id": "http://www.kactusjock.com/", 
    "contents": "KactusJock sells Arizona souvenirs and gifts from their store in Old Town Scottsdale and online - The best of the West. "
  }, 
  {
    "id": "https://old-town-scottsdale.orangetheoryfitness.com/", 
    "contents": "Orangetheory Fitness is the leading fitness studio in Scottsdale AZ. Visit our local health studio at the Old Town location. "
  }
]