[
  {
    "id": "https://www.thoughtco.com/hercules-worlds-biggest-dog-p2-3299156", 
    "contents": "Standing 7-feet, 6-inches, Freddy, a Great Dane, is the world's largest dog. He loves chicken and peanut butter — and has destroyed 23 sofas. "
  }, 
  {
    "id": "https://list25.com/25-of-the-worlds-largest-dog-breeds-youd-wish-you-own/", 
    "contents": "If you are thinking of owning a large dog breed, you might want to take a look at these 25 of the world's largest dog breeds. "
  }, 
  {
    "id": "https://images.search.yahoo.com/search/images?p=world%27s+biggest+dog", 
    "contents": "More World's Biggest Dog images "
  }, 
  {
    "id": "https://www.mnn.com/earth-matters/animals/stories/9-of-the-worlds-largest-dog-breeds", 
    "contents": "From tallest to heaviest, these are the biggest breeds of dog found around the globe. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=QTWVJQ2LJlk", 
    "contents": "Top 10 World's Biggest dog breeds in the world. These dogs are just massive! Subscribe to support more videos! Music used: Dustsucker by Jens Kiilstofte http... "
  }, 
  {
    "id": "https://www.snopes.com/fact-check/hercules/", 
    "contents": "A photograph of \"Hercules, the World's Biggest Dog\" is anything but that. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=swnf4Qqv5IA", 
    "contents": "PREVIOUS VIDEO: 10 Celebrities Before And After Drug Use - https://youtu.be/reLUx5auh_I In this video, we take a look at the 10 biggest dog breeds from all a... "
  }, 
  {
    "id": "https://video.search.yahoo.com/search/video?p=world%27s+biggest+dog", 
    "contents": "More World's Biggest Dog videos "
  }, 
  {
    "id": "http://www.dailymail.co.uk/news/article-4045146/Biggest-dog-world-7ft-6in-Great-Dane-loves-chicken-peanut-butter.html", 
    "contents": "Meet Freddy, the biggest dog in the world: 7ft 6in Great Dane loves chicken and peanut butter... but he's also munched his way through 23 sofas "
  }, 
  {
    "id": "https://www.thesun.co.uk/news/1506981/the-8ft-towering-great-dane-in-running-to-be-crowned-the-worlds-biggest-dog/", 
    "contents": "A TOWERING Great Dane has high hopes - he's in the running to be crowned the world's tallest dog standing at EIGHT FEET tall "
  }, 
  {
    "id": "http://www.guinnessworldrecords.com/world-records/tallest-dog-ever", 
    "contents": "The Guinness World Records Official site with ultimate record-breaking facts & achievements. Do you want to set a world record? Are you Officially Amazing? "
  }, 
  {
    "id": "https://www.care.com/c/stories/6073/the-top-10-biggest-dogs-in-the-world/", 
    "contents": "How big are the biggest dogs in the world? Really big. Here are the top 10 biggest dog breeds in the world. Passion for big stuff is evident everywhere you look (think Big Gulp beverages and the Sears Tower). "
  }, 
  {
    "id": "https://www.lifestyle9.org/top-10-biggest-dog-breeds-in-the-world/", 
    "contents": "If you have made up your mind to buy one you certainly might be curious to know the biggest dog breeds in the world. If yes, then look at this list. "
  }, 
  {
    "id": "https://www.care.com/c/stories/6073/the-top-10-biggest-dogs-in-the-world/", 
    "contents": "How big are the biggest dogs in the world? Really big. Here are the top 10 biggest dog breeds in the world. Passion for big stuff is evident everywhere you look (think Big Gulp beverages and the Sears Tower). "
  }, 
  {
    "id": "https://www.conservationinstitute.org/10-largest-dog-breeds-in-the-world/", 
    "contents": "Although imposing, the biggest dog breeds also tend to be mildly tempered and make excellent family pets. This list details some of the biggest of the big dogs, but “big” is relative; some breeds are stout and heavy while others are tall and lean. "
  }, 
  {
    "id": "https://curiosityaroused.com/nature/10-largest-dog-breeds/", 
    "contents": "There are so many different breeds, but here is a list of the 10 of the largest dog breeds in the world. ... They are some of world’s biggest dog breed. "
  }, 
  {
    "id": "https://www.truthorfiction.com/hercules/", 
    "contents": "World's Largest Dog?-Truth! & Fiction! Summary of eRumor: A story with a picture about a dog said to be named Hercules that has become the \"World's Largest Dog\" in the Guinness World Records. "
  }, 
  {
    "id": "https://themysteriousworld.com/10-largest-dog-breeds-in-the-world/", 
    "contents": "The mastiff, great dane and st.bernards weigh more than 80 kg, the great dane and mastiff breeds also hold Guinness record for their giant size body. "
  }, 
  {
    "id": "https://tailandfur.com/biggest-dogs-in-the-world/", 
    "contents": "We have heard of Best Big Dog Breeds over time but have you heard of the biggest dogs surviving around the world? Yes, this article will give you a description of biggest dogs still existing around the world. "
  }, 
  {
    "id": "https://www.aol.com/article/lifestyle/2017/04/07/freddy-great-dane-tallest-world-record/22030405/", 
    "contents": "He hovers at over 7-feet-tall when he stands on his hind legs. Despite his size, Freddy isn't so menacing at all -- he's actually a sweetheart. In December, the Great Dane from England was named the tallest dog in the world by the Guinness World Records. Previously, a Great Dane from Michigan held ... "
  }, 
  {
    "id": "https://www.giantgeorge.com/", 
    "contents": "Giant George, Guinness book of world records tallest dog. Worlds Biggest dog "
  }, 
  {
    "id": "http://www.vetstreet.com/13-largest-dog-breeds-towering-and-commanding", 
    "contents": "People have been intrigued by huge dogs for millennia, keeping them to guard family and property. Learn more about 13 big and sometimes furry large dog breeds. "
  }, 
  {
    "id": "https://www.telegraph.co.uk/news/2016/07/27/this-massive-great-dane-could-be-the-worlds-new-top-dog/", 
    "contents": "Meet the gigantic Great Dane who towers above its owners, standing at an impressive 7ft 1in. Three-year-old pet Major measures 85 inches when on standing its hind legs and could soon be crowned the world’s largest dog. \"He is the biggest-hearted dog in the world. He is such a fantastic animal ... "
  }, 
  {
    "id": "https://www.truthorfiction.com/hercules/", 
    "contents": "World's Largest Dog?-Truth! & Fiction! Summary of eRumor: A story with a picture about a dog said to be named Hercules that has become the \"World's Largest Dog\" in the Guinness World Records. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Giant_George", 
    "contents": "Giant George was a blue Great Dane previously recognised as the world's tallest living dog, and the tallest dog ever by Guinness World Records.There were originally conflicting media reports regarding his height, but the official measurement showed that he was three-quarters of an inch taller than the previous record holder, Titan (at 90 inches ... "
  }, 
  {
    "id": "http://worldmost.org/largest-dog-breed", 
    "contents": "Here's a list of largest dog breed in the world. Dog is one of the most favorite pet in the world. Almost each part of the world have various dog breeds. Some of those is largest dog breed and some of them is small dog breed. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Giant_dog_breed", 
    "contents": "A giant dog breed has no universal height or weight classification, ... Giant George was a blue Great Dane previously recognised as the world's tallest living dog, ... "
  }, 
  {
    "id": "http://www.mindblowing-facts.org/2013/10/10-worlds-largest-animals-ever-recorded/", 
    "contents": "He is regarded as the tallest living dog and the tallest dog in the world ever in 2010. He hails from Tuscan, Arizona and holds two world records to his name. "
  }, 
  {
    "id": "https://topdogtips.com/worlds-largest-dog-breeds/", 
    "contents": "However you feel when you see the muscles of one of the world's largest dog breeds, here are 35 pups over 70 pounds that will get your heart pumping. "
  }, 
  {
    "id": "http://www.themost10.com/10-most-largest-dog-breeds/", 
    "contents": "Huge dogs are generally loyal, good-natured animals. If you are considering a big dog, here are some.Check Most Largest Dog Breeds "
  }, 
  {
    "id": "http://www.worldslargestdog1.com/", 
    "contents": "Information about the biggest dog in the world, pictures, videos, and info about the largest dogs in the world, Zorba, and others. Contact Us; Large Breeds; Pictures; "
  }, 
  {
    "id": "https://www.boredpanda.com/hulk-pitbull-largest-puppies/", 
    "contents": "Eight beautiful puppies were recently fathered by the world’s largest pit bull, Hulk. Owned by Marlon and Lisa Grennan, founders of Dark Dynasty K9s in New Hampshire, USA, Hulk is being trained to be a protection dog. The puppies, if also trained to be elite protection dogs, could fetch up to $ ... "
  }, 
  {
    "id": "https://www.livescience.com/34239-worlds-largest-dog.html", 
    "contents": "The world’s largest dog is a Great Dane named Zeus, who stands 3 foot 8 inches tall and weighs 150 pounds. On his hind legs, Zeus is 7 feet 4 inches – by comparison, the NBA lists only 20 players ever to be 7 foot 3 or taller. "
  }, 
  {
    "id": "https://www.truthorfiction.com/hercules/", 
    "contents": "Now this is a dog!!!! Hercules was recently awarded the honorable distinction of Worlds Biggest Dog by Guinness World Records. Hercules is an English Mastiff And has a 38 inch neck and weighs 282 pounds. "
  }, 
  {
    "id": "https://www.mirror.co.uk/news/world-news/worlds-biggest-dog-footage-shows-5258011", 
    "contents": "Gigantic: Huge dog is the height of a human when it stands on its back legs 'Talking puppy' who makes sounds like a baby will leave you in hysterics. The 23-second footage was uploaded to viral video site LiveLeak.com two days ago by Donnergewalt and has already racked up over 92,000 views. "
  }, 
  {
    "id": "http://whotv.com/2017/01/02/freddy-the-great-dane-named-worlds-biggest-dog/", 
    "contents": "ESSEX, England -- The world's biggest dog has been crowned by the Guinness Book of World Records. Freddy, a Great Dane, is almost eight feet tall and weighs more than 196 pounds. Claire Stoneman, Freddy's owner, said she didn't realize the dog would be so big. \"Yeah, when he was a puppy he was the runt of the litter. "
  }, 
  {
    "id": "http://mostextreme.org/biggest_dog.php", 
    "contents": "This page contains information about the biggest dog in the world ever establishing a world record related to animals and big world, our most extreme on the list of all time. "
  }, 
  {
    "id": "http://www.worldbreakingrecord.com/2010/02/biggest-dog-in-world-hercules.html", 
    "contents": "Biggest Dog in the world. ** Hercules is the World's Biggest Dog Ever According to Guinness World Records. ** Hercules was recently awarded the honorable distinction of Worlds Biggest Dog by Guinness World Records. Hercules is an English Mastiff and has a 38 inch neck and weighs 282 pounds. "
  }, 
  {
    "id": "http://www.lifewithdogs.tv/2016/12/worlds-biggest-dog-freddy-is-taller-than-most-nba-players/", 
    "contents": "The newest Guinness record holder for world’s biggest dog is Freddy, a 7’-6” Great Dane who lives in the UK. The 4-year-old dog weighs over 200 pounds, and his favorite foods are peanut butter on toast and roasted chicken. Claire Stoneman is completely devoted to Freddy and his sister Fleur ... "
  }, 
  {
    "id": "http://we-earth.blogspot.com/2013/02/worlds-biggest-dog.html", 
    "contents": "WORLDS BIGGEST DOG!! the worlds biggest dog ever according to guinness world record. \"hercules\" was awarded the honorable distinction of worlds's biggest dog by guinness world records. hercules is an english mastiff and has a 38 inch neck and weighs 282 pounds. with 'paws the size of softballs'. "
  }, 
  {
    "id": "https://www.usatoday.com/story/news/nation/2014/09/11/zeus-worlds-tallest-dog-dies-at-age-5/15479023/", 
    "contents": "BATTLE CREEK, Mich. — Zeus, the Great Dane with a slobbery mouth who held the record for world's tallest dog, has died. The Kalamazoo Gazette reported Thursday that the 165-pound dog died of old age last week. Zeus, considered the world's largest dog by Guinness World Records, was 5 years old ... "
  }, 
  {
    "id": "https://www.mnn.com/family/pets/photos/15-pets-with-guinness-world-records/tallest-dog", 
    "contents": "This Great Dane is pretty darn great. Freddy stands almost 3.5 feet tall, and that makes him the tallest living male dog as of Sept. 2016. This impres "
  }, 
  {
    "id": "https://www.oddee.com/item_96634.aspx", 
    "contents": "From the world's biggest dog, to a cow as big as a small elephant: 6ft tall and weighs well over a ton. "
  }, 
  {
    "id": "http://www.itv.com/news/london/2016-12-29/worlds-biggest-dog-is-nearly-eight-foot-tall-and-costs-more-than-100-a-week-to-feed/", 
    "contents": "Read the latest London stories, World's biggest dog is nearly eight foot tall and costs more than £100 a week to feed on ITV News, videos, stories and all the latest London news "
  }, 
  {
    "id": "https://www.boredpanda.com/hulk-pitbull-largest-puppies/", 
    "contents": "Eight beautiful puppies were recently fathered by the world’s largest pit bull, Hulk. Owned by Marlon and Lisa Grennan, founders of Dark Dynasty K9s in New Hampshire, USA, Hulk is being trained to be a protection dog. The puppies, if also trained to be elite protection dogs, could fetch up to $ ... "
  }, 
  {
    "id": "https://www.bbc.co.uk/programmes/p04m149k", 
    "contents": "From the runt of the litter to a towering giant, Freddy the Great Dane has officially been declared the world’s largest dog by the Guinness book of records. "
  }, 
  {
    "id": "http://www.worldsmostunique.com/worldsbiggestdog.html", 
    "contents": "Worlds biggest dog is Hercules. Visit our page to learn more about this unique dog. "
  }, 
  {
    "id": "https://www.usatoday.com/story/news/nation/2014/09/11/zeus-worlds-tallest-dog-dies-at-age-5/15479023/", 
    "contents": "BATTLE CREEK, Mich. — Zeus, the Great Dane with a slobbery mouth who held the record for world's tallest dog, has died. The Kalamazoo Gazette reported Thursday that the 165-pound dog died of old age last week. Zeus, considered the world's largest dog by Guinness World Records, was 5 years old ... "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Giant_dog_breed", 
    "contents": "Giant George was a blue Great Dane previously recognised as the world's tallest living dog, and the tallest dog ever by Guinness World Records. "
  }, 
  {
    "id": "https://www.theguardian.com/lifeandstyle/gallery/2014/sep/12/worlds-tallest-dog-zeus-in-pictures", 
    "contents": "The Great Dane Zeus, who held the title of world’s tallest dog, has died of old age, two months short of his sixth birthday. He was 2.24m (7ft 4in) on his hind legs "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/List_of_oldest_dogs", 
    "contents": "List of oldest dogs ... This is a list of the oldest verified dogs in the world, ... Iowa, received the Guinness World Record for \"oldest dog living\" on July 21, ... "
  }, 
  {
    "id": "https://www.care.com/c/stories/6113/top-10-strongest-dog-breeds/", 
    "contents": "Top 10 Strongest Dog Breeds. Erica Loop. ... Choosing one the world's strongest dog breeds means working with ... Care.com is the world's largest online destination ... "
  }, 
  {
    "id": "https://www.dogmal.com/biggest-dogs-breed-world/", 
    "contents": "Dobermann is about nine positions in Top 10 Biggest Dog Breeds in the World 2017, is being used by police forces in security activities guard dogs, as rescue dogs and as guide dogs for blind people. The Doberman is compactly built, muscular, powerful and square-proportioned. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Giant_dog_breed", 
    "contents": "Titan was an American male white Great Dane who was a holder of the Guinness World Records as the world's tallest dog. Zeus was a Great Dane from Otsego, Michigan, United States, famous for being named the world's tallest dog for the 2012 and 2013 Guinness Book of World Records. "
  }, 
  {
    "id": "https://www.theguardian.com/lifeandstyle/gallery/2014/sep/12/worlds-tallest-dog-zeus-in-pictures", 
    "contents": "Guinness world record holders Kazuhiro Watanabe, the man with the tallest hair (3ft 8.6in) and Zeus, the tallest dog, appear on the Wendy Williams Show in New York City in 2012. "
  }, 
  {
    "id": "https://www.thesun.co.uk/news/1525431/worlds-biggest-dog-is-best-pals-with-a-tiny-chihuahua/", 
    "contents": "LET’S hope eight-foot Great Dane Major has had his dinner – for the sake of tiny Chihuahua Disney. This week we told how the massive mutt is in the running to be crowned the world’s tallest dog, and today we show you the encounter we arranged between him and one of Britain’s most petite ... "
  }, 
  {
    "id": "http://www.pressroomvip.com/g/16-biggest-dogs-in-the-world/2/", 
    "contents": "Feast your eyes on the biggest dog in the world. You won't believe these pictures. Dog breed #6 is so huge it's scary! "
  }, 
  {
    "id": "http://www.zimbio.com/Hercules%2C+the+World%27s+Biggest+Dog", 
    "contents": "Hercules was once the largest dog in the world. Now his name has become associated with a digital hoax, an Internet urban legend. A number of digitally editted photos have been ciculating on the net with pictures of \"Hercules, the World's Biggest Dog\". "
  }, 
  {
    "id": "https://www.oddee.com/item_96634.aspx", 
    "contents": "1 World’s Biggest Dog. Say hello to this gargantuan specimen named Hercules, purportedly the Guinness Record holder for World’s Biggest Dog. Hercules is an English Mastiff and has a 38 inch neck and weighs 282 pounds. "
  }, 
  {
    "id": "http://indianexpress.com/article/trending/trending-globally/massive-7ft-6in-great-dane-in-uk-declared-worlds-largest-dog-4435548/", 
    "contents": "Freddy, a towering 7ft 6in Great Dane in the UK has officially been crowned the world’s biggest dog, according to a media report. The massive pooch in Essesx was officially bestowed the title by the Guinness World Records, The Sun reported. Weighing 92kg, Freddy costs his owner Claire Stoneman ... "
  }, 
  {
    "id": "https://www.geo.tv/latest/125487-Meet-the-worlds-tallest-dog", 
    "contents": " Freddy, the world's biggest dog is nearly eight-foot tall and weighs more than 14 stones. The exact height of Freddy is 7 feet 6 inches, which makes him the world's tallest dog. Freddy has been crowned the tallest dog of the world by Guinness World Record. "
  }, 
  {
    "id": "http://www.wweek.com/restaurants/2016/03/15/oregon-to-become-home-to-worlds-largest-corndog/", 
    "contents": "Oregon to Become Home to World's Largest Corndog ... \"The couple ran a small hot dog stand on the beach… When the rain came and ruined the buns, ... "
  }, 
  {
    "id": "https://www.geo.tv/latest/125487-Meet-the-worlds-tallest-dog", 
    "contents": "Freddy, the world's biggest dog is nearly eight-foot tall and weighs more than 14 stones. The exact height of Freddy is 7 feet 6 inches, which makes him the world's tallest dog. "
  }, 
  {
    "id": "http://www.worldbreakingrecord.com/2012/04/worlds-biggest-dog-2012-tallest-dog-in.html", 
    "contents": "The book, entitled \"Giant George: Life with the World's Biggest Dog,\" hit bookstores on Tuesday after George was officially named the largest dog by Guinness World Records in 2010. "
  }, 
  {
    "id": "https://pethelpful.com/dogs/top-10-largest-dog-breeds-2", 
    "contents": "These breeds are, on average, the tallest, heaviest, brawniest dog breeds in the world. Most average well over 175 lbs of pure canine muscle (with a little fluff thrown in). "
  }, 
  {
    "id": "https://www.independent.ie/videos/have-you-seen/watch-freddy-is-officially-the-biggest-dog-in-the-world-35328780.html", 
    "contents": "Freddy the Great Dane has officially been declared the world's largest dog by the Guinness World Records. "
  }, 
  {
    "id": "http://www.worldsmostunique.com/worldsbiggestdog.html", 
    "contents": "Worlds biggest dog is Hercules. Visit our page to learn more about this unique dog. "
  }, 
  {
    "id": "https://dogs.lovetoknow.com/wiki/Worlds_Biggest_Dog", 
    "contents": "While various dogs have been proclaimed the world's biggest dog over the years, the Guinness Book of World Records does not maintain a category for this title. "
  }, 
  {
    "id": "https://abcnews.go.com/News/zeus-worlds-tallest-dog-dies-age/story?id=25446022", 
    "contents": "Zeus, the Great Dane who held the Guinness World Record for being the world’s tallest dog, has died. The dog, whom owner Kevin Doorlag of Otsego, Michigan, described as a “gentle giant,” stood 44 inches tall and was 7-foot-4 when he stood on his hind legs. Zeus died Sept. 3, just shy of his ... "
  }, 
  {
    "id": "http://www.gildasclubgr.org/event/worlds-largest-dog-wash/", 
    "contents": "The 2018 World’s Largest Dog Wash will be held Sunday, July 1 from 10AM-2PM at Fifth Third Ballpark, in partnership with the “Dog Day!” West Michigan Whitecaps Game! "
  }, 
  {
    "id": "https://nypost.com/2014/02/10/at-7-foot-4-freddy-the-great-dane-is-britains-tallest-dog/", 
    "contents": "He’s Britain’s biggest dog, and at 154 pounds, this Great Dane is still growing. Freddy, 18 months old, is 7-foot-4 standing on his hind legs and dwarfs... "
  }, 
  {
    "id": "http://thugbible.com/worlds-biggest-bulldog/", 
    "contents": "That’s a dog, folks. No, really! Admittedly, an abnormally massive one, but it is a dog. To be more exact, it’s a bulldog, a breed which is said to have originated from 5th century England, but which wasn’t officially recorded until the 1700s. This bulldog is supposedly the biggest in the ... "
  }, 
  {
    "id": "http://thugbible.com/worlds-biggest-bulldog/", 
    "contents": "That’s a dog, folks. No, really! Admittedly, an abnormally massive one, but it is a dog. To be more exact, it’s a bulldog, a breed which is said to have originated from 5th century England, but which wasn’t officially recorded until the 1700s. This bulldog is supposedly the biggest in the ... "
  }, 
  {
    "id": "https://nypost.com/2014/02/10/at-7-foot-4-freddy-the-great-dane-is-britains-tallest-dog/", 
    "contents": "He’s Britain’s biggest dog, and at 154 pounds, this Great Dane is still growing. Freddy, 18 months old, is 7-foot-4 standing on his hind legs and dwarfs... "
  }, 
  {
    "id": "https://pethelpful.com/dogs/10-Largest-Dog-Breeds", 
    "contents": "In 2001, the current (living) record holder for the world’s heaviest dog weighs a massive 282 lbs. His name is Hercules and he is an English Mastiff. "
  }, 
  {
    "id": "https://abcnews.go.com/News/zeus-worlds-tallest-dog-dies-age/story?id=25446022", 
    "contents": "Zeus, the Great Dane who held the Guinness World Record for being the world’s tallest dog, has died. The dog, whom owner Kevin Doorlag of Otsego, Michigan, described as a “gentle giant,” stood 44 inches tall and was 7-foot-4 when he stood on his hind legs. Zeus died Sept. 3, just shy of his ... "
  }, 
  {
    "id": "https://www.theguardian.com/lifeandstyle/gallery/2014/feb/10/freddy-britains-biggest-dog-in-pictures", 
    "contents": "Canine colossus Freddy is believed to be Britain’s biggest dog. The Great Dane has been measured at 7ft 4in on his hind legs by owner Claire Stoneman. Although no official measurement has yet been made, that would make Freddy as tall as world-record holder Zeus, and significantly larger than Britain’s current biggest dog Samson, measured at ... "
  }, 
  {
    "id": "https://www.aol.com/article/2015/02/09/hulk-the-dog-may-be-the-worlds-biggest-pit-bull/21140786/", 
    "contents": "This dog is a mere seventeen months old, but he already weighs in at over 173 lbs -- and appropriately, he's named Hulk. "
  }, 
  {
    "id": "https://www.therichest.com/rich-list/the-biggest/the-worlds-10-most-dangerous-dog-breeds/", 
    "contents": "The World's 10 Most Dangerous Dog Breeds. Is a vicious dog's behaviour down to nature, ... A fresh take on sports: the biggest news and most entertaining lists. "
  }, 
  {
    "id": "https://www.upi.com/Odd_News/2018/04/17/Documentary-sets-Guinness-record-for-largest-dog-photo-shoot/7441523978205/", 
    "contents": "The makers of upcoming documentary Superpower Dogs said the final day of filming brought a Guinness World Record for largest dog photo shoot. "
  }, 
  {
    "id": "https://www.petful.com/breeds/10-biggest-dog-breeds-world/", 
    "contents": "Mastiffs, Saint Bernards and Newfoundlands lead the way as the heaviest dog breeds in the world. Check out the full list of the 10 biggest. "
  }, 
  {
    "id": "https://www.express.co.uk/news/nature/708243/Guinness-World-Records-2017-World-s-tallest-dog-man-with-largest-mouth-a-jumping-llama", 
    "contents": "Guinness World Records 2017: World's tallest dog, man with largest mouth & a jumping llama A HUGE pooch standing over three foot high has been named the world’s tallest female dog. "
  }, 
  {
    "id": "http://www.zimbio.com/Hercules%2C+the+World%27s+Biggest+Dog", 
    "contents": "Hercules was once the largest dog in the world. Now his name has become associated with a digital hoax, an Internet urban legend. A number of digitally editted photos have been ciculating on the net with pictures of \"Hercules, the World's Biggest Dog\". "
  }, 
  {
    "id": "https://pethelpful.com/dogs/top-10-largest-dog-breeds-2", 
    "contents": "These breeds are, on average, the tallest, heaviest, brawniest dog breeds in the world. Most average well over 175 lbs of pure canine muscle (with a little fluff thrown in). "
  }, 
  {
    "id": "https://nypost.com/2014/02/10/at-7-foot-4-freddy-the-great-dane-is-britains-tallest-dog/", 
    "contents": "He’s Britain’s biggest dog, and at 154 pounds, this Great Dane is still growing. Freddy, 18 months old, is 7-foot-4 standing on his hind legs and dwarfs... "
  }, 
  {
    "id": "https://earthnworld.com/2016/01/top-10-biggest-dog-breeds-in-the-world/", 
    "contents": "Advertisement Dogs are said to be the human’s best friend because they only know the language of love. We have already written about the small dog breeds now let’s talk about the biggest dog breeds in the world. "
  }, 
  {
    "id": "https://www.geo.tv/latest/125487-Meet-the-worlds-tallest-dog", 
    "contents": "Freddy, the world's biggest dog is nearly eight-foot tall and weighs more than 14 stones. The exact height of Freddy is 7 feet 6 inches, which makes him the world's tallest dog. "
  }, 
  {
    "id": "https://vimeo.com/54191304", 
    "contents": "Boris is a giant Chow Chow, he is the biggest dog in the world, he lives in a small village in Oxfordshire in the UK, Boris and his owner Kevin would like to thank… "
  }, 
  {
    "id": "http://www.holidogtimes.com/meet-the-10-largest-dog-breeds-on-the-planet/", 
    "contents": "Have you ever wondered how big the largest dogs are in the world? Check out our list (in no particular order) of the world's 10 largest dog breeds. "
  }, 
  {
    "id": "http://www.infobarrel.com/Top_5_-_Worlds_Largest_Dog_Breeds", 
    "contents": "Any list of the worlds largest dog breeds can be disputed, especially if you look at individual specimens. Just like humans, a dog can be fed a large amount and get heavy. "
  }, 
  {
    "id": "http://www.vetlocator.com/newsarticles/worlds_largest_dog.php", 
    "contents": "As you might guess, our email is full of interesting animal pictures, videos and jokes. Last week I received an email with a picture of the World's largest dog, as validated by the Guinness Book of World Records. "
  }, 
  {
    "id": "http://worlds-biggests.blogspot.com/2010/02/worlds-largest-dog-zorba-engish-mastiff.html", 
    "contents": "If there are any large dogs that are well known in the world, Zorba is probably one of them. Zorba is an English Mastiff from the UK t... "
  }, 
  {
    "id": "http://ktla.com/2015/11/03/is-this-the-worlds-largest-dog/", 
    "contents": "What's 38 inches tall, 228 pounds, and eats 110 pounds of food a month? This is no riddle; this is a true story of a big dog in Pennsylvania whose owners are trying to get him into the record books. "
  }, 
  {
    "id": "http://www.metacafe.com/watch/1728342/the_worlds_biggest_dog_and_the_worlds_smallest_dog/", 
    "contents": "the biggest and smallest dog in the WORLD!!! "
  }, 
  {
    "id": "http://www.ibtimes.com/worlds-biggest-dog-dies-giant-george-tallest-canine-7ft-tall-dead-one-month-8th-birthday-photos", 
    "contents": "Giant George, the Great Dane named \"World’s Tallest Dog\" and \"World’s Biggest Dog\" by Guinness World Records in 2010, died last week, one month before his eighth birthday. "
  }, 
  {
    "id": "http://www.channel5.com/show/biggest-dog-in-the-world/", 
    "contents": "A close look at the pros and cons of living with a giant Great Dane. "
  }, 
  {
    "id": "https://www.mirror.co.uk/news/uk-news/brit-great-dane-whos-4ft-8495137", 
    "contents": "Brit Great Dane who's 4ft 1in tall is in the running to be named biggest dog in the world. Major's a large breed but even by those standards, the 12st Welsh pooch is a towering handful for his loving owners "
  }, 
  {
    "id": "https://www.bloomberg.com/news/features/2015-08-19/the-world-s-biggest-pet-store-has-250-000-animals", 
    "contents": "Germany’s dog and cat populations are growing, ... Banaszak doesn’t think the world’s biggest pet shop needs penguins, or any other new animals. "
  }, 
  {
    "id": "http://www.answers.com/Q/Can_you_ride_the_worlds_biggest_dog", 
    "contents": "I couldn't but occassionally certain large dogs (St. Bernard, Newfoundlanders, Dog of Berdoux, Bull Mastiffs) have been fitted with saddles for young. "
  }, 
  {
    "id": "https://themysteriousworld.com/10-most-beautiful-dog-breeds-in-the-world/", 
    "contents": "world's cutest dog breeds also known for their loyalty and care for their owners, most of them have thick coat that comes in a wide variety of colors. "
  }
]