[
  {
    "id": "https://www.calmclinic.com/anxiety/symptoms/lump-in-throat", 
    "contents": "Drink Water Drinking water can reduce this lump feeling in two ways. First, by drinking water, you're able to feel the water going down your throat which may calm down some of your worries. Second, there are some indications that hydration in general can reduce the lump sensation. "
  }, 
  {
    "id": "https://www.fauquierent.net/globus.htm", 
    "contents": "This lump in the throat sensation (also known as globus pharyngeus or hystericus), is a common complaint that many patients have when presenting to their physician (if you can actually see or feel a mass in the neck, click here for more information). "
  }, 
  {
    "id": "https://images.search.yahoo.com/search/images?p=lump+in+throat", 
    "contents": "More Lump In Throat images "
  }, 
  {
    "id": "https://www.healthline.com/health/lump-in-throat", 
    "contents": "Feeling a lump in your throat isn’t uncommon. Many people experience this painless sensation at least once in their lifetime. Feeling a lump, bump, or swelling in your throat without having an actual lump is known as globus sensation. "
  }, 
  {
    "id": "https://www.cancerresearchuk.org/about-cancer/cancer-chat/thread/lump-in-throat-with-discomfort-with-pics-of-lump", 
    "contents": "Lump in throat with discomfort (with pics of lump) ... Then in January I felt what I am sure is a lump on the right side of my throat, directly where this lump ... "
  }, 
  {
    "id": "https://www.merckmanuals.com/home/digestive-disorders/symptoms-of-digestive-disorders/lump-in-throat", 
    "contents": "Lump in Throat - Learn about the causes, symptoms, diagnosis & treatment from the Merck Manuals - Medical Consumer Version. "
  }, 
  {
    "id": "https://patient.info/health/difficulty-swallowing-dysphagia/globus-sensation", 
    "contents": "Globus sensation is the term used when a person has the feeling of a lump in their throat when actually there is no lump present when the throat is examined. "
  }, 
  {
    "id": "https://www.belmarrahealth.com/lump-in-throat-globus-sensation-warning-signs-causes-and-treatment/", 
    "contents": "Lump in throat (globus sensation) is the feeling of having a mass in one’s throat, even if there is nothing physically present. "
  }, 
  {
    "id": "https://www.msdmanuals.com/home/digestive-disorders/symptoms-of-digestive-disorders/lump-in-throat", 
    "contents": "Lump in Throat - Learn about the causes, symptoms, diagnosis & treatment from the MSD Manuals - Medical Consumer Version. "
  }, 
  {
    "id": "https://www.medicalnewstoday.com/articles/320245.php", 
    "contents": "Globus sensation is an overwhelming feeling of a lump lodged in a person's throat, even when nothing is there. It is not painful, but it is annoying. Causes include inflammation, stress, and tumors, among others. "
  }, 
  {
    "id": "https://symptomchecker.webmd.com/multiple-symptoms?symptoms=difficulty-swallowing%7Clump-or-bulge%7Cpain-or-discomfort%7Csore-throat&symptomids=227%7C148%7C1%7C219&locations=10%7C10%7C10%7C10", 
    "contents": "WebMD Symptom Checker helps you find the most common medical conditions indicated by the symptoms Difficulty swallowing, Lump or bulge, Pain or discomfort and Sore throat and including Viral pharyngitis, Tonsillitis and Thyroid cancer. "
  }, 
  {
    "id": "https://www.askdoctork.com/what-causes-the-feeling-of-a-lump-in-the-throat-20111006401", 
    "contents": "DEAR DOCTOR K: I often get the feeling that there’s a lump in my throat. Sometimes in the morning I’ll cough up mucus, but it doesn’t make the feeling go away. "
  }, 
  {
    "id": "https://www.msdmanuals.com/home/digestive-disorders/symptoms-of-digestive-disorders/lump-in-throat", 
    "contents": "Lump in Throat - Learn about the causes, symptoms, diagnosis & treatment from the MSD Manuals - Medical Consumer Version. "
  }, 
  {
    "id": "https://patient.info/health/difficulty-swallowing-dysphagia/globus-sensation", 
    "contents": "Globus sensation is the term used when a person has the feeling of a lump in their throat when actually there is no lump present when the throat is examined. "
  }, 
  {
    "id": "http://www.rightdiagnosis.com/sym/throat_lump.htm", 
    "contents": "List of 12 disease causes of Throat lump, patient stories, diagnostic guides. Diagnostic checklist, medical tests, doctor questions, and related signs or symptoms for Throat lump. "
  }, 
  {
    "id": "https://www.doctoroz.com/article/i-have-lump-my-throat", 
    "contents": "If you have a lump in your throat every time you swallow or even every time you talk, what is going on there? Could this be a sign of throat cancer? "
  }, 
  {
    "id": "https://www.steadyhealth.com/topics/feels-like-lump-in-throat-is-it-cancer", 
    "contents": "I have felt what feels like a lump in my throat for the past 2-3 months and I am really concerned. I have no trouble swallowing, no hoarseness in my voice, and no difficulty breathing. "
  }, 
  {
    "id": "https://symptomchecker.webmd.com/multiple-symptoms?symptoms=difficulty-swallowing%7Clump-or-bulge%7Cpain-or-discomfort%7Csore-throat&symptomids=227%7C148%7C1%7C219&locations=10%7C10%7C10%7C10", 
    "contents": "WebMD Symptom Checker helps you find the most common medical conditions indicated by the symptoms Difficulty swallowing, Lump or bulge, Pain or discomfort and Sore throat and including Viral pharyngitis, Tonsillitis and Thyroid cancer. "
  }, 
  {
    "id": "https://www.fauquierent.net/globus2.htm", 
    "contents": "Read about base of tongue problems that may lead to a lump sensation in the throat. "
  }, 
  {
    "id": "https://www.livestrong.com/article/9966-diagnose-lump-throat/", 
    "contents": "Lumps in the throat that you can feel with your fingers from the outside of your neck can mean anything from a swollen lymph node to a thyroid cyst or a... "
  }, 
  {
    "id": "https://www.entnet.org/content/head-and-neck-cancer", 
    "contents": "But a lump (or lumps) in the neck can be the first sign of cancer of the mouth, throat, voicebox (larynx), thyroid gland, ... "
  }, 
  {
    "id": "https://symptomchecker.webmd.com/multiple-symptoms?symptoms=lump-or-bulge%7Cthroat-tightness&symptomids=148%7C235&locations=10%7C10", 
    "contents": "WebMD Symptom Checker helps you find the most common medical conditions indicated by the symptoms Lump or bulge and Throat tightness and including Allergic reaction, Generalized anxiety disorder and Panic attack. "
  }, 
  {
    "id": "https://www.entnet.org/content/head-and-neck-cancer", 
    "contents": "But a lump (or lumps) in the neck can be the first sign of cancer of the mouth, throat, voicebox (larynx), thyroid gland, ... "
  }, 
  {
    "id": "https://www.livestrong.com/article/9966-diagnose-lump-throat/", 
    "contents": "Lumps in the throat that you can feel with your fingers from the outside of your neck can mean anything from a swollen lymph node to a thyroid cyst or a... "
  }, 
  {
    "id": "http://www.entsheffield.co.uk/help-lump-throat/", 
    "contents": "Synopsis. Being able to feel a lump in the throat is a common symptom that patients seek an opinion with ear, nose and throat specialists. In this article, Mr Wale Olarinde (consultant ear, nose, throat/head & neck surgeon) discusses the problem of lumps in the throat that cannot be physically felt with the fingers rather than a neck lump ... "
  }, 
  {
    "id": "https://www.painscience.com/articles/lump-in-the-throat.php", 
    "contents": "The story of a fierce little lump in my throat, with a side of science. "
  }, 
  {
    "id": "http://www.anxietyguru.net/whats-causes-the-lump-in-your-throat/", 
    "contents": "Having a lump in your throat or the sensation that it's hard to swallow is a very common sensation among anxiety sufferers. This lump causes us to think that we are headed for a medical disaster and may even cause us to swallow in quick succession so that we can make sure that we can still swallow -... "
  }, 
  {
    "id": "https://patient.info/forums/discuss/lump-in-my-throat-197087", 
    "contents": "Hi there, For the last 3 weeks I keep feeling like there is a lump in my throat when I swallow. I can eat my food and swallow well but it feels like something is still there after I have swallowed. "
  }, 
  {
    "id": "https://healthool.com/lump-in-throat-feeling/", 
    "contents": "The lump in the throat feeling is also known as the globus sensation, being described by patients in different ways. It is important to understand that this is literally just a feeling, as there is no actual mass or lump in the throat. "
  }, 
  {
    "id": "http://www.thyroid.com.au/tag/lump-in-throat/", 
    "contents": "These articles look at thyroid nodules, thyroid lumps, and the thyroid enlargement. Symptoms of a lump in the throat may include shortness of breath at night, or a feeling that food is getting stuck in your throat. "
  }, 
  {
    "id": "https://www.cancerresearchuk.org/about-cancer/cancer-chat/thread/lump-in-throat-0", 
    "contents": "Hi, Trying to put my mind at rest really as I think I'm over worrying!! So I saw my GP 3 weeks ago about a lump feeling in my throat when I swallowed which had already been going on for 3 weeks. "
  }, 
  {
    "id": "https://www.msdmanuals.com/en-au/home/digestive-disorders/symptoms-of-digestive-disorders/lump-in-throat", 
    "contents": "Lump in Throat - Learn about the causes, symptoms, diagnosis & treatment from the MSD Manuals - Medical Consumer Version. "
  }, 
  {
    "id": "http://www.rightdiagnosis.com/symptoms/throat_lump/causes.htm", 
    "contents": "Detailed analysis of 12 causes of Throat lump symptom, alternative diagnoses and related symptoms. "
  }, 
  {
    "id": "https://treato.com/Lump+in+throat/?a=s", 
    "contents": "Learn about Lump in throat from patients' first hand experiences and trusted online health resources, including common treatments and medications. 59,216 discussions on Treato "
  }, 
  {
    "id": "https://www.dailyhealthcures.com/ent/lump-in-throat-causes-treatment/", 
    "contents": "Feeling something stuck in throat? Read the possible causes and treatments to get rid of the lump in throat, also known as globus sensation. "
  }, 
  {
    "id": "https://treatpanel.com/lump-in-throat-after-eating-causes-treatment/", 
    "contents": "Globus sensation is an overwhelming feeling of a lump lodged in your throat. Here is what causes the feeling of having a lump in throat, how to treat and get rid of it. "
  }, 
  {
    "id": "http://www.steadyhealth.com/articles/having-lump-in-the-throat-sensation", 
    "contents": "The complaint of a lumpy sensation in the throat is very common. Most commonly, lump sensations are harmless while visible lumps in the throat should not be taken lightly. "
  }, 
  {
    "id": "https://throatdisorder.com/swallowing-disorders/lump-in-the-throat-sensation/", 
    "contents": "The lump in throat sensation also known as “globus pharyngeus” is quite common and can have many causes. Learn more about diagnosis, symptoms, & treatments on throatdisorder.com "
  }, 
  {
    "id": "http://scarysymptoms.com/2012/01/lump-in-throat-causes-and-solutions/", 
    "contents": "Does a lump in your throat, or feeling that something is stuck in your throat, have you frightened it could be ALS or laryngeal cancer? When a person develops an obsessive fear of ALS, sometimes they fixate […] "
  }, 
  {
    "id": "https://www.healthtap.com/topics/lump-in-throat", 
    "contents": "Lump in throat - My allergies causing lump in throat, what to do? Throat lump. This can be life threatening, please seek medical help immediately when it happens and carry an epinephrine auto injector, please consult an allergist asap "
  }, 
  {
    "id": "http://www.dictionary.com/browse/lump-in-one-s-throat", 
    "contents": "Lump in one's throat definition, the passage from the mouth to the stomach or to the lungs, including the pharynx, esophagus, larynx, and trachea. See more. "
  }, 
  {
    "id": "https://www.voicedoctor.net/therapy/lump", 
    "contents": "Lump in the throat sensation feels like a golf ball, tennis ball, fur ball... is stuck in my throat. feels like my tie is too tight. feel like I am being strangled. my throat feels swollen. The symptoms can be mimicked by pushing on the cartilage in the neck just below the Adam's apple. "
  }, 
  {
    "id": "http://horsesidevetguide.com/drv/Observation/475/lump-bump-growth-in-throat-area/", 
    "contents": "Lump, Bump, Growth in Throat Area, Behind Jaw or Under Ear Code Red - Call Your Vet Immediately, Even Outside Business Hours If this problem seems severe and has come on suddenly. "
  }, 
  {
    "id": "http://www.throatproblems.co.uk/lumps-throat.html", 
    "contents": "Lumps in the throat are generally harmless, but occasionally they can be a sign of something more serious. "
  }, 
  {
    "id": "https://www.entnet.org/content/sore-throats", 
    "contents": "Other important symptoms can include hoarseness, noisy breathing, a lump in the neck, unexplained weight loss, and/or spitting up blood in the saliva or phlegm. HIV infection can sometimes cause a chronic sore throat, due not to HIV itself but to a secondary infection that can be extremely serious. "
  }, 
  {
    "id": "http://www.anxietycentre.com/anxiety-symptoms/lump-in-the-throat.shtml", 
    "contents": "This lump in the throat feeling can precede, accompany, or follow an episode of nervousness, anxiety, fear, and elevated stress, panic attack or anxiety attack, or occur “out of the blue” and “for no apparent reason.” This lump in the throat feeling can range in intensity from slight, to moderate, to severe. "
  }, 
  {
    "id": "https://health.clevelandclinic.org/thyroid-nodule-4-reasons-lump-neck-require-treatment/", 
    "contents": "Don’t be too concerned if your doctor says you have thyroid nodules. This lump in the butterfly-shaped gland in your neck is common and usually not cancerous. Most contain a variable amount of fluid, and those with a significant amount of fluid are cysts. Most nodules can’t even be felt via ... "
  }, 
  {
    "id": "https://www.americancancerfund.org/cancer-types/throat-cancer/", 
    "contents": "Throat cancer refers to cancerous tumors that develop in your throat (pharynx), voice box (larynx) or tonsils. "
  }, 
  {
    "id": "http://www.thefreedictionary.com/lump+in+(one%27s)+throat", 
    "contents": "lump 1 (lŭmp) n. 1. An irregularly shaped mass or piece. 2. A small cube of sugar. 3. Medicine A swelling or small palpable mass. 4. A collection or totality; an aggregate. 5 ... "
  }, 
  {
    "id": "https://www.ent.com.hk/en/symptoms/throat_symptom.html", 
    "contents": "Lump in throat presents as a feeling of a mass in throat. These findings are of particular concern in making the diagnosis: Neck pain, Weight loss, pain in swallowing, muscle weakness. If any of these findings present, immediate medical advice is necessary. "
  }, 
  {
    "id": "https://www.webmd.com/a-to-z-guides/swollen-glands", 
    "contents": "Your glands could be swollen for a number of reasons. Find out what the cause might be, and what to do. "
  }, 
  {
    "id": "https://www.livestrong.com/article/238365-a-sore-throat-with-a-lump/", 
    "contents": "A sore throat with the feeling of a lump is associated with post nasal drip, according to the American Academy of Otolaryngology. Post nasal drip is a... "
  }, 
  {
    "id": "https://www.healthtap.com/topics/lump-in-throat-after-coughing", 
    "contents": "Lump in throat after coughing - Can being sick with a cough cause a lump in throat? Yes. A cough is likely a part of an upper respiratory tract infection, probably viral in nature. "
  }, 
  {
    "id": "https://dogshealthproblems.com/lump-on-a-dogs-throat/", 
    "contents": "Finding a lump on a dog's throat can be a scary experience, mostly because the first thought comes to cancer; following are several potential causes. "
  }, 
  {
    "id": "https://healthunlocked.com/thyroiduk/posts/131201191/lump-in-my-throat", 
    "contents": "Hi everyone, I have something in my throat which is blocking it. I feel like swallowing it but it never goes. It is not giving any pain in any way but it is giving me a discomfort. "
  }, 
  {
    "id": "http://acupuncturetwincities.com/2009/07/feeling-a-lump-in-your-throat/", 
    "contents": "I have seen people in my clinic before complaining of a lump in their throat, but Alan’s symptoms were the most severe I had every encountered. Alan was a "
  }, 
  {
    "id": "https://healthhearty.com/lump-in-throat-feeling", 
    "contents": "If you have consistently been bugged by the lump in throat feeling while swallowing, this article will throw some light on the problem, its possible causes and cures. "
  }, 
  {
    "id": "https://www.ent.com.hk/en/symptoms/throat_symptom.html", 
    "contents": "Lump in throat presents as a feeling of a mass in throat. These findings are of particular concern in making the diagnosis: Neck pain, Weight loss, ... "
  }, 
  {
    "id": "http://horsesidevetguide.com/drv/Observation/475/lump-bump-growth-in-throat-area/", 
    "contents": "Healthy horses have a variety of normal anatomic lumps and bumps that can be felt in and around the throat-latch area, behind the jaw. In the normal horse, the larynx, thyroid gland, salivary glands and lymph nodes all feel like firm bumps in this area. "
  }, 
  {
    "id": "https://wagwalking.com/condition/throat-tumor", 
    "contents": "Recovery of Tumor of the Throat in Dogs. ... The origin of a lump in the throat could be due to enlarged salivary glands, enlarged lymph nodes, ... "
  }, 
  {
    "id": "https://www.cancer.gov/types/head-and-neck/head-neck-fact-sheet", 
    "contents": "The symptoms of head and neck cancers may include a lump or a sore that does not heal, a sore throat that does not go away, difficulty in swallowing, and a change or hoarseness in the voice. "
  }, 
  {
    "id": "https://dictionary.cambridge.org/dictionary/english/a-lump-in-your-throat", 
    "contents": "a lump in your throat › a tight feeling in your throat because of a strong emotion, esp. sadness: I had a huge lump in my throat as I watched my brother get on the plane. "
  }, 
  {
    "id": "https://diseasespictures.com/lump-in-throat/", 
    "contents": "In case lump in throat is due to stress or anxiety then the patient will be put to comfort by giving a shot of valium for relaxing the muscle. After he feels better, he would be given warm fluids. Your doctor will constantly monitor the symptoms and give medications depending on the factor that causes the ill-feeling of lump in throat. "
  }, 
  {
    "id": "https://www.voicedoctor.net/therapy/lump", 
    "contents": "Lump in the throat sensation feels like a golf ball, tennis ball, fur ball... is stuck in my throat. feels like my tie is too tight. feel like I am being strangled. my throat feels swollen. The symptoms can be mimicked by pushing on the cartilage in the neck just below the Adam's apple. "
  }, 
  {
    "id": "https://www.cancer.gov/types/head-and-neck/head-neck-fact-sheet", 
    "contents": "The symptoms of head and neck cancers may include a lump or a sore that does not heal, a sore throat that does not go away, difficulty in swallowing, and a change or hoarseness in the voice. "
  }, 
  {
    "id": "http://www.chronicillnesscures.com/lump-throat-cure-treatment-suggestions-alternatives/", 
    "contents": "The following are certain common symptoms of the lump in throat sensation: * Feels like a ball is stuck in the throat. * The symptoms are similar to the feeling of getting suffocated at a funeral or sad situation. * Feels like you are being strangled. "
  }, 
  {
    "id": "https://ehealthforum.com/health/topic49106.html", 
    "contents": "Lump in Throat & Pregnant I am 10 weeks pregnant and have been experiencing this same feeling of a lump in my throat for about 3-4 weeks now. It's right around my adams apple, in the 'divit' of my neck. "
  }, 
  {
    "id": "https://www.medindia.net/patients/patientinfo/lump-in-the-throat.htm", 
    "contents": "What are types of lumps in throat and what causes them? Can they be a sign or symptom of something more sinister? Understand these lumps better. "
  }, 
  {
    "id": "https://www.healthcentral.com/article/acid-reflux-cause-lump-throat-feeling-ear-pain", 
    "contents": "Can Acid Reflux Cause Lump In Throat Feeling And Ear Pain? I have had a feeling of lump in my throat for about three weeks now. I saw my GP, who said that I probably have acid reflux. Well, I wasn’t satisfied, so I saw an ENT who put a scope down my nose and throat and said yes, it is acid reflux ... "
  }, 
  {
    "id": "http://losp.org/lump-in-throat-hurts-when-i-swallow-what-causes-it-part-1", 
    "contents": "Are you having a sensation of throat fullness, lump in throat hurts, tightness or throat pain when swallowing? Here are tips to help you find relief. "
  }, 
  {
    "id": "https://healdove.com/oral-health/Pictures-of-White-Bumps-in-Throat", 
    "contents": "Find out what the white bumps in your throat are, how to get rid of them, and see some pictures of what they look like and how they compare to tonsillitis. "
  }, 
  {
    "id": "https://www.healingwell.com/community/default.aspx?f=45&m=357493", 
    "contents": "I began to have a strong feeling of a lump caught in my throat and having to clear my throat a lot, etc. I was really scared it was cancer, so i made an appt with my M.D. "
  }, 
  {
    "id": "http://www.symcat.com/symptoms/lump-in-throat", 
    "contents": "The most common causes of lump in throat are common cold, gastroesophageal reflux disease (gerd), and anxiety. "
  }, 
  {
    "id": "https://anxietyexit.com/lump-in-the-throat-a-symptom-of-anxiety-or-not/", 
    "contents": "Having the feeling of a lump in the throat can be quite worrisome. Here's some advice for any anxiety sufferer looking for ways to deal with this naturally. "
  }, 
  {
    "id": "https://www.healthcentral.com/article/acid-reflux-cause-lump-throat-feeling-ear-pain", 
    "contents": "Can Acid Reflux Cause Lump In Throat Feeling And Ear Pain? I have had a feeling of lump in my throat for about three weeks now. I saw my GP, who said that I probably have acid reflux. Well, I wasn’t satisfied, so I saw an ENT who put a scope down my nose and throat and said yes, it is acid reflux ... "
  }, 
  {
    "id": "http://www.grossaninstitute.com/lump-in-the-throat-is-this-globus-hystericus/", 
    "contents": "Swallowing disorders, speech disorders, and chronic cough fit a diagnosis of Laryngopharyngeal Reflux or LPR. LPPR symptoms: I have a lump in my throat. "
  }, 
  {
    "id": "https://www.medhelp.org/posts/Thyroid-Disorders/For-those-with-lump-in-throat-feeling-/show/652994", 
    "contents": "For those of you who have that lump in the throat feeling or swallowing difficulties, could you describe what it feels like? Does it feel like there is phlem in your throat or just a lump/swelling feeling? I have a .08 nodule and a slightly enlarged thyroid. I feel like I have a swollen throat/neck ... "
  }, 
  {
    "id": "https://www.endocrineweb.com/conditions/thyroid/thyroid-nodules", 
    "contents": "Learn about the symptoms of thyroid nodules and what to do if you ... can sometimes be felt as a lump in the throat or even seen as a lump in the neck when they ... "
  }, 
  {
    "id": "https://www.mayoclinic.org/diseases-conditions/sore-throat/symptoms-causes/syc-20351635", 
    "contents": "Other signs or symptoms may include heartburn, hoarseness, regurgitation of stomach contents and the sensation of a lump in your throat. HIV infection. "
  }, 
  {
    "id": "https://www.healthboards.com/boards/acid-reflux-gerd/315114-lump-throat.html", 
    "contents": "HI i was wondering for those of you who have had that feeling of lump in throat, did you feel congested too, like you have to constantly cough because "
  }, 
  {
    "id": "https://www.sciencealert.com/why-do-we-get-a-lump-in-our-throats-when-we-re-sad", 
    "contents": "But it's not just tears that accompany great sadness or joy - we get that strange lump in our throat too. So w hat causes a physical reaction in one part of the body, when we're crying with another part? "
  }, 
  {
    "id": "http://www.symcat.com/symptoms/lump-in-throat", 
    "contents": "The most common causes of lump in throat are common cold, gastroesophageal reflux disease (gerd), and anxiety. "
  }, 
  {
    "id": "https://www.verywellhealth.com/is-it-a-lump-or-a-lymph-node-1191840", 
    "contents": "Lumps are common with many ENT disorders and can be terrifying. Often these lumps are actually swollen lymph nodes. Find out more about lymph disorders. "
  }, 
  {
    "id": "http://www.grossaninstitute.com/lump-in-the-throat-is-this-globus-hystericus/", 
    "contents": "Swallowing disorders, speech disorders, and chronic cough fit a diagnosis of Laryngopharyngeal Reflux or LPR. LPPR symptoms: I have a lump in my throat. "
  }, 
  {
    "id": "http://scarysymptoms.com/2014/12/why-does-acid-reflux-lpr-cause-throa/", 
    "contents": "You already know that the “lump in the throat” can be caused by LPR or acid reflux, but here’s WHY this occurs. For this article I consulted with Dr. Stacey Silvers, MD, of Madison ENT & […] "
  }, 
  {
    "id": "https://healthunlocked.com/thyroiduk/posts/131254260/lump-in-throat", 
    "contents": "hi has anyone had this? every now and then i get a lump in my throat which is tender to the touch it last's anywhere between 3 days and a week blood results suggest borderline hashimotos just... "
  }, 
  {
    "id": "http://symptoms.rightdiagnosis.com/cosymptoms/throat-lump.htm", 
    "contents": "Causes of Throat lump, alternative diagnoses, rare causes, misdiagnoses, patient stories, and much more. "
  }, 
  {
    "id": "https://www.healthcentral.com/article/globus-hystericus-anxiety-induced-lump-in-the-throat-sensation", 
    "contents": "Globus Hystericus is also called by other names including Globus Sensation or Globus Pharyngis. It literally means a feeling of having a lump in your throat or some type of obstruction which may feel like you are choking. Other people may feel pain in their throat and chest. When no underlying ... "
  }, 
  {
    "id": "https://treato.com/Dry+Mouth,Lump+in+throat/?a=s", 
    "contents": "Here you can read posts from all over the web from people who wrote about Dry Mouth and Lump in throat, and check the relations between Dry Mouth and Lump in throat "
  }, 
  {
    "id": "http://youaskmdanswers.com/feeling-of-lump-in-throat-when-swallowing-globus-sensation/", 
    "contents": "A feeling of lump in throat when swallowing, when no such lump exists, is termed as globus sensation.It is different from dysphagia which is a feeling of difficulty in swallowing food or drinks. "
  }, 
  {
    "id": "http://livingwithanxiety.com/articles/anxiety/symptoms-of-anxiety-in-the-throat", 
    "contents": "A lump in the throat can be caused by anxiety A feeling of tightness or what is described as a lump in the throat can be one of the anxiety symptoms that cause discomfort for those suffering from anxiety. "
  }, 
  {
    "id": "http://livingwithanxiety.com/articles/anxiety/symptoms-of-anxiety-in-the-throat", 
    "contents": "A lump in the throat can be caused by anxiety. A feeling of tightness or what is described as a lump in the throat can be one of the anxiety symptoms that cause discomfort for those suffering from anxiety. This disorder is called globus hystericus, and it may also be called globus sensation or globus pharyngis. "
  }, 
  {
    "id": "https://byebyedoctor.com/lump-in-throat-causes-treatment/", 
    "contents": "The lump in the throat sensation is also known as globus pharyngeus or hystericus and is a fairly common symptom that individuals tell their physicians about. If present for more than a couple of weeks or if this occurs from time to time over a period of 2 or 3 months then a complete exam of the oral cavity as well as the throat is needed – particularly in those individuals who are smokers. "
  }, 
  {
    "id": "https://www.spine-health.com/forum/discussion/46759/pain/neck-pain-cervical/lump-throat", 
    "contents": "Lump in throat? Another Question ... I am feeling this catch in my throat most of the time now. ... And about 5 days of the lump in the throat and need to keep ... "
  }, 
  {
    "id": "http://www.peanutallergy.com/boards/lump-in-throat", 
    "contents": "Does anyone else here experience a lump in the throat when they eat foods which are suspected mild allergens? (i.e. a lump that 'feels' allergic, but with no other symptoms) "
  }, 
  {
    "id": "https://health.clevelandclinic.org/thyroid-nodule-4-reasons-lump-neck-require-treatment/", 
    "contents": "Thyroid Nodule: 4 Reasons a Lump in Your Neck Could Require Treatment. Thyroid nodules generally don’t lead to any serious problems. In certain cases, however, a nodule can prompt your doctor to take a closer look. Here are four cases where thyroid nodules may require further attention. "
  }, 
  {
    "id": "https://www.medindia.net/patients/patientinfo/lump-in-the-throat.htm", 
    "contents": "Lump-like sensations in the throat occurring due to physical abnormalities can also be due to: Infections of the upper respiratory tract (laryngitis, pharyngitis, tonsillitis) – Infection can be bacterial, viral or fungal. "
  }, 
  {
    "id": "https://www.cancerforums.net/threads/3228-Lump-in-throat", 
    "contents": "I'm wondering if anyone else has had this feeling: its like there is something stuck in my throat. It feels like I swallowed a pill and it got stuck somewhere along the way. "
  }, 
  {
    "id": "https://www.drugs.com/health-guide/throat-cancer-larynx-and-pharynx.html", 
    "contents": "Throat Cancer (Larynx and Pharynx) - an easy to understand guide covering causes, diagnosis, symptoms, treatment and prevention plus additional in depth medical information. Throat Cancer (Larynx and Pharynx) - an easy to understand guide covering causes, diagnosis, symptoms, treatment and prevention plus additional in depth medical information. "
  }, 
  {
    "id": "http://www.newhealthadvisor.com/Bumps-in-Back-of-Throat.html", 
    "contents": "Bumps in back of throat can be irritating and can cause a lot of pain too. The causes behind it differ and it remains easily treatable once the cause is found. "
  }
]