[
  {
    "id": "https://www.imdb.com/title/tt0059113/", 
    "contents": "During the Russian Revolution, Yuri Zhivago, is a young doctor who has been raised by his aunt and uncle following his father's suicide. Yuri falls in love with beautiful Lara Guishar, who has been having an affair with her mother's lover, Victor Komarovsky, an unscrupulous businessman. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Doctor_Zhivago_(film)", 
    "contents": "Doctor Zhivago is a 1965 British-Italian epic romantic drama film directed by David Lean.It is set in Russia between the years prior to World War I and the Russian Civil War of 1917–1922, and is based on the 1957 Boris Pasternak novel of the same name. "
  }, 
  {
    "id": "https://video.search.yahoo.com/search/video?p=doctor+zhivago", 
    "contents": "More Doctor Zhivago videos "
  }, 
  {
    "id": "https://www.amazon.com/Doctor-Zhivago-Two-Disc-Special-Sharif/dp/B00003CX9M", 
    "contents": "Product description. Doctor Zhivago (Two-Disc Specia Additional Features. A stunning anamorphic widescreen print is the ideal way to appreciate David Lean's craftsmanship and Dr. Zhivago's glorious, wintry cinematography. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Doctor_Zhivago_(novel)", 
    "contents": "Doctor Zhivago (Russian: До́ктор Жива́го, IPA: [ˈdoktər ʐɨˈvaɡə]) is a novel by Boris Pasternak, first published in 1957 in Italy.The novel is named after its protagonist, Yuri Zhivago, a physician and poet, and takes place between the Russian Revolution of 1905 and World War II. "
  }, 
  {
    "id": "https://images.search.yahoo.com/search/images?p=doctor+zhivago", 
    "contents": "More Doctor Zhivago images "
  }, 
  {
    "id": "https://www.rottentomatoes.com/m/1006037_doctor_zhivago", 
    "contents": "Based on the Nobel Prize-winning novel by Boris Pasternak, Doctor Zhivago covers the years prior to, during, and after the Russian Revolution, as seen through the eyes of poet/physician Yuri Zhivago (Omar Sharif). "
  }, 
  {
    "id": "https://www.barnesandnoble.com/w/doctor-zhivago-boris-pasternak/1100267709", 
    "contents": "First published in Italy in 1957 amid international controversy, Doctor Zhivago is the story of the life and loves of a poet/physician during the turmoil of the Russian Revolution. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=wAWrXTn5Www", 
    "contents": "The Trailer Of This Great and Beatiful Movie of David Lean Julie Christie as Lara Omar Sharif as Yuri Zhivago and Geraldine Chaplin as Tonia "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=vXtFRl1nSs4", 
    "contents": "\"Somewhere My Love (Lara's Theme)\" from the movie Doctor Zhivago ~ Omar Sharif, Julie Christie ( Classic Movie) 1965 Greatest movie ever made in my opinion. ... "
  }, 
  {
    "id": "https://www.barnesandnoble.com/w/dvd-doctor-zhivago-omar-sharif/3619944", 
    "contents": "Based on the Nobel Prize-winning novel by Boris Pasternak, Doctor Zhivago covers the years prior to, during, and after the Russian Revolution, as seen through the eyes of poet/physician Yuri Zhivago (Omar Sharif). "
  }, 
  {
    "id": "https://www.goodreads.com/book/show/130440.Doctor_Zhivago", 
    "contents": "Doctor Zhivago has 69,399 ratings and 2,410 reviews. Violet said: When I read this in my early twenties it went straight into my top ten favourite novels... "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=vXtFRl1nSs4", 
    "contents": "\"Somewhere My Love (Lara's Theme)\" from the movie Doctor Zhivago ~ Omar Sharif, Julie Christie ( Classic Movie) 1965 Greatest movie ever made in my opinion. ... "
  }, 
  {
    "id": "https://www.rogerebert.com/reviews/doctor-zhivago-1995", 
    "contents": "When David Lean's \"Doctor Zhivago\" was released in 1965, it was pounced upon by the critics, who found it a picture-postcard view of revolution, a love story balanced uneasily atop a painstaking reconstruction of Russia. "
  }, 
  {
    "id": "http://www.sparknotes.com/lit/zhivago/summary/", 
    "contents": "A short summary of Boris Pasternak's Dr. Zhivago. This free synopsis covers all the crucial plot points of Dr. Zhivago. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Doctor_Zhivago_(film)", 
    "contents": "Doctor Zhivago is a 1965 British-Italian epic romantic drama film directed by David Lean.It is set in Russia between the years prior to World War I and the Russian Civil War of 1917–1922, and is based on the 1957 Boris Pasternak novel of the same name. "
  }, 
  {
    "id": "https://www.barnesandnoble.com/w/dvd-doctor-zhivago-omar-sharif/3619944", 
    "contents": "Based on the Nobel Prize-winning novel by Boris Pasternak, Doctor Zhivago covers the years prior to, during, and after the Russian Revolution, as seen through the eyes of poet/physician Yuri Zhivago (Omar Sharif). "
  }, 
  {
    "id": "http://www.tcm.com/tcmdb/title/129/Doctor-Zhivago/", 
    "contents": "Overview of Doctor Zhivago, 1965, directed by David Lean, with Geraldine Chaplin, Julie Christie, Tom Courtenay, at Turner Classic Movies "
  }, 
  {
    "id": "https://www.britannica.com/topic/Doctor-Zhivago-novel", 
    "contents": "Doctor Zhivago: Doctor Zhivago, novel by Boris Pasternak, published in Italy in 1957. This epic tale about the effects of the Russian Revolution of 1917 and its aftermath on a bourgeois family was not published in the Soviet Union until 1987. "
  }, 
  {
    "id": "https://www.ebay.com/sch/i.html?_nkw=dr+zhivago", 
    "contents": "Find great deals on eBay for dr zhivago. Shop with confidence. "
  }, 
  {
    "id": "https://www.biography.com/news/doctor-zhivago-facts-50-anniversary", 
    "contents": "Recently restored and re-released in celebration of its 50th anniversary, 'Doctor Zhivago' has come to be regarded as one of cinema’s greatest love stories. "
  }, 
  {
    "id": "https://www.cia.gov/library/readingroom/collection/doctor-zhivago", 
    "contents": "Library. Our open-source library houses the thousands of documents, periodicals, maps and reports released to the public. "
  }, 
  {
    "id": "https://www.biography.com/news/doctor-zhivago-facts-50-anniversary", 
    "contents": "Recently restored and re-released in celebration of its 50th anniversary, 'Doctor Zhivago' has come to be regarded as one of cinema’s greatest love stories. "
  }, 
  {
    "id": "https://www.theguardian.com/books/2010/nov/06/doctor-zhivago-boris-pasternak-translation", 
    "contents": "Boris Pasternak knew that Doctor Zhivago was explosive. But a new translation to mark the 50th anniversary of the author's death loses much of its force, argues Ann Pasternak Slater "
  }, 
  {
    "id": "https://www.ebay.com/sch/i.html?_nkw=doctor+zhivago", 
    "contents": "Find great deals on eBay for doctor zhivago. Shop with confidence. "
  }, 
  {
    "id": "http://www.playbill.com/production/doctor-zhivago-broadway-theatre-vault-0000014085", 
    "contents": "Doctor Zhivago is an epic romance set during the final days of Czarist Russia, the First World War, and the chaos of the Russian revolution. Raised as an aristocrat, Zhivago is a political idealist, physician, and poet who is torn between a life with his devoted wife, Tonia Gromeko, and the passionate and mysterious Lara Guishar. "
  }, 
  {
    "id": "https://ffilms.org/doctor-zhivago-1965/", 
    "contents": "Watch full movie: Doctor Zhivago (1965), online free. Life of a Russian doctor/poet who, although married, falls for a political activist's wife and experiences hardships during the Bolshevik Revolution "
  }, 
  {
    "id": "https://www.goodreads.com/book/show/7831611-doctor-zhivago", 
    "contents": "Doctor Zhivago has 68,622 ratings and 2,348 reviews. Violet said: When I read this in my early twenties it went straight into my top ten favourite novels... "
  }, 
  {
    "id": "https://www.rottentomatoes.com/m/doctor_zhivago_2002", 
    "contents": "Young and beautiful Lara is loved by three men: a revolutionary, a mogul, and a doctor. Their lives become intertwined with the drama of Russian revolution. Doctor Zhivago is still married when he meets Lara. "
  }, 
  {
    "id": "https://m.youtube.com/channel/UCJjUTU5B3o1iqsPQb_lYXhw", 
    "contents": "Doctor Zhivago is a 1965 British-Italian epic romantic drama film directed by David Lean. It is set in Russia between the years prior to World War I and the ... "
  }, 
  {
    "id": "https://www.musicnotes.com/sheet-music/show/doctor-zhivago", 
    "contents": "Download sheet music for Doctor Zhivago. Choose from Doctor Zhivago sheet music for such popular songs as Somewhere, My Love, Somewhere, My Love (Lara's Theme from Doctor Zhivago), and Lara's Theme From \"Doctor Zhivago\". "
  }, 
  {
    "id": "http://pmagastrolimerick.com/show/doctor-zhivago", 
    "contents": "Doctor Zhivago Full Episodes Online. Instantly find any Doctor Zhivago full episode available from all 1 seasons with videos, reviews, news and more! "
  }, 
  {
    "id": "http://pmagastrolimerick.com/show/doctor-zhivago", 
    "contents": "Doctor Zhivago Full Episodes Online. Instantly find any Doctor Zhivago full episode available from all 1 seasons with videos, reviews, news and more! "
  }, 
  {
    "id": "https://itunes.apple.com/us/movie/doctor-zhivago/id272602984", 
    "contents": "Watch trailers, read customer and critic reviews, and buy Doctor Zhivago directed by David Lean for $12.99. "
  }, 
  {
    "id": "https://m.imdb.com/title/tt0059113/", 
    "contents": "Goofs. The frame story (where Zhivago's half-brother finds his and Lara's daughter and tells the story) is set in the 1960s, but the daughter, who was born around 1920-1921, is only in her early 20s. "
  }, 
  {
    "id": "https://www.etsy.com/market/dr_zhivago", 
    "contents": "You searched for: dr zhivago! Etsy is the home to thousands of handmade, vintage, and one-of-a-kind products related to your search. No matter what you’re looking for or where you are in the world, our global marketplace of sellers can help you find unique and affordable options. "
  }, 
  {
    "id": "http://medhum.med.nyu.edu/view/291", 
    "contents": "For Dr. Zhivago, philosophy, poetry, and medicine are all part of a unified whole. They are related spheres in which to express his love and respect for the beauty of life. "
  }, 
  {
    "id": "https://www.audible.com/pd/Classics/Doctor-Zhivago-Audiobook/B005580R1E", 
    "contents": "Written by Boris Pasternak, Richard Pevear (translator), Larissa Volokhonsky (translator), Narrated by John Lee. Download the app and start listening to Doctor Zhivago today - Free with a 30 day Trial! "
  }, 
  {
    "id": "https://www.directv.com/movies/Doctor-Zhivago-MFVDM2NhTzNIVllzS29RbFEwczlqdz09", 
    "contents": "Watch Doctor Zhivago starring Omar Sharif in this Drama on DIRECTV. It's available to watch. "
  }, 
  {
    "id": "https://www.microsoft.com/en-us/store/p/doctor-zhivago/8d6kgwzl5v17", 
    "contents": "Omar Sharif stars in the title role as an orphaned youth who grows up to marry the daughter of his adoptive parents, but falls in love with a beautiful dressmaker. "
  }, 
  {
    "id": "http://www.metacritic.com/movie/doctor-zhivago", 
    "contents": "Doctor Zhivago movie reviews & Metacritic score: The life of a Russian physician and poet who, although married to another, falls in love with a political ac... "
  }, 
  {
    "id": "https://www.commonsensemedia.org/movie-reviews/doctor-zhivago", 
    "contents": "Epic drama combines romance, politics, mature themes. Read Common Sense Media's Doctor Zhivago review, age rating, and parents guide. "
  }, 
  {
    "id": "http://www.metacritic.com/movie/doctor-zhivago", 
    "contents": "Doctor Zhivago movie reviews & Metacritic score: The life of a Russian physician and poet who, although married to another, falls in love with a political ac... "
  }, 
  {
    "id": "https://www.penguinrandomhouse.com/books/127969/doctor-zhivago-by-boris-pasternak/9780307390950/", 
    "contents": "First published in Italy in 1957 amid international controversy, Doctor Zhivago is the story of the life and loves of a poetphysician during the turmoil... "
  }, 
  {
    "id": "https://www.biblio.com/doctor-zhivago-by-pasternak-boris/work/57438", 
    "contents": "Doctor Zhivago is a 20th century novel by Boris Pasternak, first published in 1957. The novel is named after its protagonist, Yuri Zhivago, a medical doctor and... "
  }, 
  {
    "id": "https://www.warnerbros.com/doctor-zhivago", 
    "contents": "OSCAR WINNER: Best Screenplay Adaptation Best Cinematography Best Art Direction Best Costume Design Best Score Winner of five Academy Awards (and nominated for ten, including \"Best Picture\") David Lean's Doctor Zhivago is an exploration of the Russian Revolution as seen from the point of view of the intellectual, introspective title character ... "
  }, 
  {
    "id": "https://en.wikiquote.org/wiki/Doctor_Zhivago_(film)", 
    "contents": "Doctor Zhivago is a 1965 film about the life of a Russian physician and poet who, although married to another, falls in love with a political activist's wife and experiences hardship during the First World War and then the October Revolution. "
  }, 
  {
    "id": "http://variety.com/1965/film/reviews/doctor-zhivago-2-1200420915/", 
    "contents": "The sweep and scope of the Russian revolution, as reflected in the personalities of those who either adapted or were crushed, has been captured by David Lean in \"Doctor Zhivago,\" frequently with soaring dramatic intensity. "
  }, 
  {
    "id": "http://www.tcm.com/this-month/article/72502%7C0/Doctor-Zhivago.html", 
    "contents": "Illicit lovers fight to stay together during the turbulent years of the Russian Revolution. "
  }, 
  {
    "id": "https://www.baumanrarebooks.com/rare-books/pasternak-boris/doctor-zhivago/81874.aspx", 
    "contents": "Doctor Zhivago rare book for sale. This First Edition by Boris PASTERNAK is available at Bauman Rare Books. "
  }, 
  {
    "id": "https://www.etsy.com/search?q=dr+zhivago", 
    "contents": "You searched for: dr zhivago. Good news! Etsy has thousands of handcrafted and vintage products that perfectly fit what you’re searching for. Discover all the extraordinary items our community of craftspeople have to offer and find the perfect gift for your loved one (or yourself!) today. "
  }, 
  {
    "id": "https://www.allmusic.com/album/doctor-zhivago-original-soundtrack-mw0000879660", 
    "contents": "Find album reviews, stream songs, credits and award information for Doctor Zhivago [Original Soundtrack] - Maurice Jarre on AllMusic - 1965 - Doctor Zhivago is a lively and vibrant work from&hellip; "
  }, 
  {
    "id": "https://www.abebooks.com/book-search/title/doctor-zhivago/", 
    "contents": "The Poems of Dr. Zhivago by Boris Pasternak and a great selection of similar Used, New and Collectible Books available now at AbeBooks.com. "
  }, 
  {
    "id": "https://www.allmusic.com/album/doctor-zhivago-mw0002858340", 
    "contents": "Find album reviews, stream songs, credits and award information for Doctor Zhivago - Original Broadway Recording on AllMusic - 2015 - With a sweeping, large-scale orchestral demeanor,&hellip; "
  }, 
  {
    "id": "http://www.boxofficemojo.com/movies/?id=doctorzhivago.htm", 
    "contents": "Doctor Zhivago summary of box office results, charts and release information and related links. "
  }, 
  {
    "id": "https://play.google.com/store/movies/details/Doctor_Zhivago?id=wVDjVDZjFws&hl=en_US", 
    "contents": "Lara inspires lechery in Komarovsky (her mother's lover who is a master at surviving whoever runs Russia) and can't compete with passion for the revolution of the man she marries, Pasha. "
  }, 
  {
    "id": "http://www.tv.com/shows/doctor-zhivago/", 
    "contents": "Doctor Zhivago is the second film re-imagining of the famous 1957 novel by Boris Pasternak, with the first being the 1967 Hollywood adaptation. Set in Tsarist Russia at the dawn of the twentieth century, the story follows a young woman named Larissa Guishar Antipova (Keira Knightly) as she and those close to her live through "
  }, 
  {
    "id": "https://dvd.netflix.com/Movie/Doctor-Zhivago/70207211", 
    "contents": "Rent Doctor Zhivago (2002) and other Movies & TV Shows on Blu-ray & DVD. 1-month free trial! Fast, free delivery. No late fees. "
  }, 
  {
    "id": "https://www.pbs.org/newshour/show/doctor-zhivago-dangerous", 
    "contents": "When Boris Pasternak finished his novel “Dr. Zhivago” in 1956, Soviet authorities refused to publish the tale of an individual’s struggle amid the Russian Revolution. "
  }, 
  {
    "id": "http://www.tvguide.com/movies/doctor-zhivago/137450", 
    "contents": "Watch Doctor Zhivago movie trailer and get the latest cast info, photos, movie review and more on TVGuide.com. "
  }, 
  {
    "id": "https://www.thriftbooks.com/w/doctor-zhivago_boris-pasternak/257448/", 
    "contents": "Buy a cheap copy of Doctor Zhivago book by Boris Pasternak. Free shipping over $10. "
  }, 
  {
    "id": "https://www.tripadvisor.com/Restaurant_Review-g298484-d7122712-Reviews-Grand_Cafe_Dr_Zhivago-Moscow_Central_Russia.html", 
    "contents": "Reserve a table at Grand Cafe Dr. Zhivago, Moscow on TripAdvisor: See 1,907 unbiased reviews of Grand Cafe Dr. Zhivago, rated 4.5 of 5 on TripAdvisor and ranked #148 of 15,151 restaurants in Moscow. "
  }, 
  {
    "id": "https://books.google.com/books/about/Doctor_Zhivago.html?id=a517KSzY0EwC", 
    "contents": "'Doctor Zhivago' is the story of the life and loves of a poet/physician during the turmoil of the Russian Revolution. Here is a masterful chronicle of its outbreak and the consequences; army revolts, irrational killings, starvation, epidemics, Communist Party inquisitions. "
  }, 
  {
    "id": "https://www.shmoop.com/doctor-zhivago/", 
    "contents": "Struggling with Boris Pasternak's Doctor Zhivago? Check out our thorough summary and analysis of this literary masterpiece. "
  }, 
  {
    "id": "http://www.theatermania.com/broadway/doctor-zhivago_306089/", 
    "contents": "The top source for Doctor Zhivago news and tickets. We do not charge price markups on exclusive offers. "
  }, 
  {
    "id": "https://www.themoviedb.org/movie/907-doctor-zhivago", 
    "contents": "Doctor Zhivago is the filmed adapation of the Russian novel by Boris Pasternak from director David Lean that was an international success and today deemed a classic. "
  }, 
  {
    "id": "https://www.christianbook.com/dr-zhivago-boris-pasternak/9780679407591/pd/407596", 
    "contents": "In the great tradition of the epic novel, Pasternak's masterpiece brings to life the drama and immensity of the Russian Revolution through the story of the gifted physicain, Zhivago, and revolutionary, Strlnikov, and Lara, the passionate woman they both love. "
  }, 
  {
    "id": "http://www.tvguide.com/movies/doctor-zhivago/113168", 
    "contents": "Watch Doctor Zhivago movie trailer and get the latest cast info, photos, movie review and more on TVGuide.com. "
  }, 
  {
    "id": "https://www.britannica.com/topic/Doctor-Zhivago-film", 
    "contents": "Doctor Zhivago: Doctor Zhivago, American dramatic film, released in 1965, that was a sprawling adaptation of Boris Pasternak’s acclaimed novel. Although the movie earned mixed reviews, it became one of the top box-office attractions of all time. "
  }, 
  {
    "id": "https://mubi.com/films/doctor-zhivago", 
    "contents": "While studying to be a doctor in Moscow, Yuri Zhivago meets the beautiful Lara, setting in train a fateful romance that spans the early years of the Russian Revolution, during which Zhivago and Lara's lives are turned upside down. "
  }, 
  {
    "id": "https://www.hulu.com/dr-zhivago", 
    "contents": "Dr. Zhivago is currently unavailable to stream on-demand, but may be available on Hulu with Live TV depending on regional availability. Try Live TV for free. "
  }, 
  {
    "id": "http://www.revolve.com/zhivago/br/016309/", 
    "contents": "Shop the latest collection of Zhivago clothing and accessories at REVOLVE with free 2-3 day shipping and returns, 30 day price match guarantee. "
  }, 
  {
    "id": "https://shop.tcm.com/doctor-zhivago-1965/883929086979", 
    "contents": "David Lean's epic screen adaptation of the Boris Pasternak novel stars Omar Sharif as the Russian doctor and writer branded an enemy of the state after the "
  }, 
  {
    "id": "http://www.nndb.com/films/250/000033151/", 
    "contents": "Poet and physician Yuri Zhivago takes a lover, Lara, during the Bolshevik Revolution. Story told in flashback to Tanya, who is likely their daughter. "
  }, 
  {
    "id": "https://www.facebook.com/zhivagomusical", 
    "contents": "Doctor Zhivago on Broadway, New York, New York. 15,494 likes · 2 talking about this · 1,667 were here. The new Broadway musical DOCTOR ZHIVAGO, based on... "
  }, 
  {
    "id": "http://www.swarthmore.edu/Humanities/sforres1/alum-readings/2003/past.html", 
    "contents": "Boris Pasternak DOCTOR ZHIVAGO Background information, Questions for Reading, and further resources Boris Leonidovich Pasternak was born in Moscow in February of 1890, one of four children. "
  }, 
  {
    "id": "http://tvtropes.org/pmwiki/pmwiki.php/Literature/DoctorZhivago", 
    "contents": "Doctor Zhivago is a 1957 novel which got its author (Boris Pasternak) a Nobel Prize. That he was forced to reject by the Soviet government. It is one of the … "
  }, 
  {
    "id": "http://variety.com/1965/film/reviews/doctor-zhivago-2-1200420915/#!", 
    "contents": "The sweep and scope of the Russian revolution, as reflected in the personalities of those who either adapted or were crushed, has been captured by David Lean in \"Doctor Zhivago,\" frequently with soaring dramatic intensity. "
  }, 
  {
    "id": "http://www.librarything.com/work/5263", 
    "contents": "Click to read more about Doctor Zhivago by Boris Pasternak. LibraryThing is a cataloging and social networking site for booklovers "
  }, 
  {
    "id": "https://www.moviefone.com/movie/doctor-zhivago/3401/main/", 
    "contents": "Doctor Zhivago - During the Russian Revolution, Yuri Zhivago (Omar Sharif), is a young doctor who has been raised by his aunt and uncle following his... "
  }, 
  {
    "id": "https://www.walmart.com/ip/Doctor-Zhivago/15261822", 
    "contents": "Free 2-day shipping on qualified orders over $35. Buy Doctor Zhivago at Walmart.com "
  }, 
  {
    "id": "https://www.shmoop.com/doctor-zhivago/literary-devices.html", 
    "contents": "Doctor Zhivago follows several different characters and gives us a lot of insight into each of their lives. But at its heart, the novel is about… well… "
  }, 
  {
    "id": "https://www.moviefone.com/movie/doctor-zhivago/3401/main/", 
    "contents": "Doctor Zhivago - During the Russian Revolution, Yuri Zhivago (Omar Sharif), is a young doctor who has been raised by his aunt and uncle following his... "
  }, 
  {
    "id": "https://www.walmart.com/ip/Doctor-Zhivago/15261822", 
    "contents": "Free 2-day shipping on qualified orders over $35. Buy Doctor Zhivago at Walmart.com "
  }, 
  {
    "id": "https://www.the-numbers.com/movie/Doctor-Zhivago", 
    "contents": "Financial analysis of Doctor Zhivago (1965) including budget, domestic and international box office gross, DVD and Blu-ray sales reports, total earnings and profitability. "
  }, 
  {
    "id": "https://www.yidio.com/show/doctor-zhivago", 
    "contents": "Watch Doctor Zhivago Full Episodes Online. Instantly find any Doctor Zhivago full episode available from all 1 seasons with videos, reviews, news and more! "
  }, 
  {
    "id": "http://www.blu-ray.com/movies/Doctor-Zhivago-Blu-ray/59715/", 
    "contents": "Doctor Zhivago Blu-ray (1965): Starring Omar Sharif, Julie Christie and Geraldine Chaplin. A tumultuous tale of Russia divided by war and hearts torn by love. Epic images abound: revolution in the streets, an infantry charge into No Man's Land,... "
  }, 
  {
    "id": "https://itunes.apple.com/us/book/doctor-zhivago/id420458936", 
    "contents": "Read a free sample or buy Doctor Zhivago by Boris Pasternak, Richard Pevear & Larissa Volokhonsky. You can read this book with iBooks on your iPhone, iPad, iPod touch, or Mac. "
  }, 
  {
    "id": "http://www.movies.com/doctor-zhivago/m1103", 
    "contents": "Read the Doctor Zhivago movie synopsis, view the movie trailer, get cast and crew information, see movie photos, and more on Movies.com. "
  }, 
  {
    "id": "http://www.dictionary.com/browse/dr--zhivago", 
    "contents": "Dr. zhivago definition, a novel (1958) by Boris Pasternak. See more. "
  }, 
  {
    "id": "https://www.pdfdrive.net/doctor-zhivago-e19234890.html", 
    "contents": "The “Secret” of Success in Life and Business 1 The Secret Code of Success, income bracket in the world—while mos ... "
  }, 
  {
    "id": "http://www.imfdb.org/wiki/Doctor_Zhivago", 
    "contents": "Doctor Zhivago is the 1965 adaptation of Boris Pasternak's Nobel Prize-winning novel of the same name directed by David Lean and starring Omar Sharif, Julie Christie, Geraldine Chapman, Rod Steiger, Tom Courtenay, and Alec Guinness. "
  }, 
  {
    "id": "http://www.imfdb.org/wiki/Doctor_Zhivago", 
    "contents": "Doctor Zhivago is the 1965 adaptation of Boris Pasternak's Nobel Prize-winning novel of the same name directed by David Lean and starring Omar Sharif, Julie Christie, Geraldine Chapman, Rod Steiger, Tom Courtenay, and Alec Guinness. "
  }, 
  {
    "id": "https://www.pdfdrive.net/doctor-zhivago-e19234890.html", 
    "contents": "The “Secret” of Success in Life and Business 1 The Secret Code of Success, income bracket in the world—while mos ... "
  }, 
  {
    "id": "https://www.fandango.com/doctor-zhivago-420/movie-overview", 
    "contents": "A poet's (Omar Sharif), lover (Julie Christie) and wife (Geraldine Chaplin) see Russians revolt. "
  }, 
  {
    "id": "https://www.researchgate.net/publication/232268371_Doctor_Zhivago", 
    "contents": "Full-Text Paper (PDF): Doctor Zhivago | ResearchGate, the professional network for scientists. "
  }, 
  {
    "id": "https://www.importcds.com/doctor-zhivago-1965/883929086979", 
    "contents": "David Lean's Doctor Zhivago is an exploration of the Russian Revolution as seen from the point of view of the intellectual, introspective title character (Omar Sharif). "
  }, 
  {
    "id": "http://www.broadwaymusicalhome.com/shows/doctor-zhivago.htm", 
    "contents": "Information about Lucy Simon's Broadway musical, Doctor Zhivago, including news and gossip, production information, synopsis, musical numbers, sheetmusic, cds, videos, books, sound and video clips, tickets, lyrics, rights holders, the offical website and more. "
  }, 
  {
    "id": "https://www.abebooks.com/books/features/giangiacomo-feltrinelli-and-doctor-zhivago.shtml", 
    "contents": "Boris Pasternak's classic novel Doctor Zhivago might never have seen the light of day if it weren't for Giangiacomo Feltrinelli, the Italian publisher who risked it all by smuggling the manuscript out of Russia and publishing it. "
  }, 
  {
    "id": "https://www.yidio.com/movie/doctor-zhivago/1642", 
    "contents": "Watch Doctor Zhivago Online. Doctor Zhivago the 1965 Movie Reviews, Trailers, Videos and more at Yidio. "
  }
]