[
  {
    "id": "https://en.wikipedia.org/wiki/Seven_deadly_sins", 
    "contents": "The seven deadly sins, also known as the capital vices or cardinal sins, is a grouping and classification of vices within Christian teachings. Behaviours or habits are classified under this category if they directly give birth to other immoralities. "
  }, 
  {
    "id": "https://www.netflix.com/title/80050063", 
    "contents": "Elizabeth, Hawk and the Seven Deadly Sins want a break after defeating the Holy Knights, but their adventures continue. "
  }, 
  {
    "id": "https://images.search.yahoo.com/search/images?p=what+are+the+seven+deadly+sins", 
    "contents": "More What Are The Seven Deadly Sins images "
  }, 
  {
    "id": "https://www.deadlysins.com/", 
    "contents": "Information on the history of the Seven Deadly Sins, as well as cultural commentary, reading and resources on Sin and Virtue. Additional info on the Heavenly, Cardinal, and Theological Virtues. "
  }, 
  {
    "id": "http://www.bibleinfo.com/en/questions/what-are-seven-deadly-sins", 
    "contents": "What are the seven deadly sins? Answer: Many people ask, \"What are the seven deadly sins?\"According to Christian tradition the seven deadly sins are: envy, gluttony, greed or avarice, lust, pride, sloth, and wrath. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/The_Seven_Deadly_Sins_%28manga%29", 
    "contents": "The Seven Deadly Sins (Japanese: 七つの大罪, Hepburn: Nanatsu no Taizai) is a Japanese fantasy manga series written and illustrated by Nakaba Suzuki.It has been serialized in Kodansha's Weekly Shōnen Magazine since October 2012, with the chapters collected into thirty-one tankōbon volumes as of April 17, 2018. "
  }, 
  {
    "id": "https://www.allaboutgod.com/what-are-the-seven-deadly-sins-faq.htm", 
    "contents": "What Are The Seven Deadly Sins - Read a description for each of these sins and what the Bible says about each. What are the seven detestable sins according to Proverbs? "
  }, 
  {
    "id": "https://www.imdb.com/title/tt3909224/", 
    "contents": "With Yûki Kaji, Rintarou Nishi, Sora Amamiya, Misaki Kuno. The Seven Deadly Sins were once an active group of knights in the region of Britannia, who disbanded after they supposedly plotted to overthrow the Liones Kingdom. "
  }, 
  {
    "id": "http://nanatsu-no-taizai.wikia.com/wiki/Seven_Deadly_Sins", 
    "contents": "The Seven Deadly Sins「七つの大罪 Nanatsu no Taizai」 were the strongest and cruelest order of Holy Knights in the Kingdom of Liones. They were formed by seven brutal criminals, who had all been convicted for grievous crimes and had carved the symbols of seven beasts onto their bodies. "
  }, 
  {
    "id": "https://www.whatchristianswanttoknow.com/what-are-the-seven-deadly-sins-and-their-meanings/", 
    "contents": "What are the seven deadly sins and why are they so deadly? What are the meanings of these seven deadly sins? "
  }, 
  {
    "id": "https://myanimelist.net/anime/23755/Nanatsu_no_Taizai", 
    "contents": "Looking for information on the anime Nanatsu no Taizai (The Seven Deadly Sins)? Find out more with MyAnimeList, the world's most active online anime and manga community and database. "
  }, 
  {
    "id": "http://www.netflix.com/title/80050063", 
    "contents": "Elizabeth, Hawk and the Seven Deadly Sins want a break after defeating the Holy Knights, but their adventures continue. "
  }, 
  {
    "id": "https://www.funimation.com/shows/the-seven-deadly-sins/", 
    "contents": "The Seven Deadly Sins. When Holy Knights arrest her family, Princess Elizabeth seeks out a group of legendary warriors known as the Seven Deadly Sins. "
  }, 
  {
    "id": "https://www.whatchristianswanttoknow.com/what-are-the-seven-deadly-sins-and-their-meanings/", 
    "contents": "What are the seven deadly sins and why are they so deadly? What are the meanings of these seven deadly sins? "
  }, 
  {
    "id": "https://www.britannica.com/topic/seven-deadly-sins", 
    "contents": "Seven deadly sins: Seven deadly sins, in Roman Catholic theology, the seven vices that spur other sins and further immoral behavior. They were first enumerated by Pope Gregory I in the 6th century and later elaborated by St. Thomas Aquinas. "
  }, 
  {
    "id": "https://www.jw.org/en/bible-teachings/questions/seven-deadly-sins/", 
    "contents": "Where did a list of 7 deadly sins come from? Identify 15 Bible examples of serious sin. Trace the origin of so-called cardinal or capital sins. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=tMjF_100onI", 
    "contents": "The Seven Deadly Sins were a list of psychological flaws first identified by Christianity in the 4th century. Christianity was wise in spotting the errors, b... "
  }, 
  {
    "id": "http://comicbook.com/anime/2018/01/18/seven-deadly-sins-season-2-netflix-watch-anime-simulcast/", 
    "contents": "It took a few years to finish, but The Seven Deadly Sins is back! This month, the anime returned with its long-awaited second season in Japan, but some U.S. fans were a bit confused when the anime did not show up on Netflix. "
  }, 
  {
    "id": "https://www.amazon.com/Seven-Deadly-Sins-Kevin-Vost/dp/162282234X", 
    "contents": "Seven Deadly Sins [Kevin Vost] on Amazon.com. *FREE* shipping on qualifying offers. The seven deadly sins are generals leading a vast and deadly army. The soldiers are a variety of sins and misdeeds "
  }, 
  {
    "id": "https://www.anime-planet.com/anime/the-seven-deadly-sins-revival-of-the-commandments", 
    "contents": "The Seven Deadly Sins: Revival of The Commandments anime info and recommendations. Only six of the Seven Deadly Sins have been l... "
  }, 
  {
    "id": "http://watch7deadlysins2.net/", 
    "contents": "Watch Nanatsu no Taizai / The Seven Deadly Sins Season 2 and Season 1 English Subbed and Dubbed in High Quality "
  }, 
  {
    "id": "https://simple.wikipedia.org/wiki/Seven_deadly_sins", 
    "contents": "Some followers of Christianity say that there are sins that are the causes of all others. There are seven sins that they call deadly.Although the Bible does not list the seven deadly sins, they are in the book The Divine Comedy. "
  }, 
  {
    "id": "https://www.urbandictionary.com/define.php?term=The%20Seven%20Deadly%20Sins", 
    "contents": "Seven things that are considered the worst things to do. 1. Greed - Wanting too much of something. 2. Gluttony - Similar to greed, but gluttony is the action of taking too much of something in. 3. "
  }, 
  {
    "id": "https://www.gotquestions.org/seven-deadly-sins.html", 
    "contents": "What are the seven deadly sins? Does the Bible teach that there are seven deadly sins? "
  }, 
  {
    "id": "https://www.anime-planet.com/anime/the-seven-deadly-sins", 
    "contents": "The Seven Deadly Sins anime info and recommendations. The kingdom of Liones is thrown into turmoil when ... "
  }, 
  {
    "id": "http://www.deadlysins.com/history", 
    "contents": "Information on the history of the Seven Deadly Sins, as well as cultural commentary, reading and resources on Sin and Virtue. Additional info on the Heavenly, Cardinal, and Theological Virtues. "
  }, 
  {
    "id": "https://www.sidereel.com/tv-shows/the-seven-deadly-sins", 
    "contents": "The \"Seven Deadly Sins,\" a group of evil knights who conspired to overthrow the kingdom of Britannia, were said to have been eradicated by the Holy Knights, although some claim that they still live. "
  }, 
  {
    "id": "https://kodanshacomics.com/series/seven-deadly-sins/", 
    "contents": "Official publisher site of The Seven Deadly Sins manga (Nanatsu no Taizai): graphic-novel release info, Chapter 1 preview, interviews, exclusive content. "
  }, 
  {
    "id": "http://nanatsu-no-taizai.wikia.com/wiki/The_Seven_Deadly_Sins_(Anime)", 
    "contents": "The Seven Deadly Sins「七つの大罪 Nanatsu no Taizai」 is a television anime adaptation of the manga series of the same name that is produced by A-1 Pictures and broadcasted by MBS and TBS. "
  }, 
  {
    "id": "https://www.kongregate.com/games/jorjeade/seven-deadly-sins", 
    "contents": "Kongregate free online game Seven Deadly Sins - Mild mannered Ed has been challenged to depart from his mild English ways and commit the seven.... Play Seven Deadly Sins "
  }, 
  {
    "id": "https://www.imdb.com/title/tt1492152/", 
    "contents": "The Seven Deadly Sins were once an active group of knights in the region of Britannia, who disbanded after they supposedly plotted to overthrow the Liones Kingdom. "
  }, 
  {
    "id": "https://www.anime-planet.com/anime/the-seven-deadly-sins", 
    "contents": "The Seven Deadly Sins anime info and recommendations. The kingdom of Liones is thrown into turmoil when ... "
  }, 
  {
    "id": "https://www.amazon.com/Seven-Deadly-Sins-Kevin-Vost/dp/162282234X", 
    "contents": "Seven Deadly Sins [Kevin Vost] on Amazon.com. *FREE* shipping on qualifying offers. The seven deadly sins are generals leading a vast and deadly army. The soldiers are a variety of sins and misdeeds "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/The_Seven_Deadly_Sins_(manga)", 
    "contents": "The Seven Deadly Sins (Japanese: 七つの大罪, Hepburn: Nanatsu no Taizai) is a Japanese fantasy manga series written and illustrated by Nakaba Suzuki.It has been serialized in Kodansha's Weekly Shōnen Magazine since October 2012, with the chapters collected into twenty-nine tankōbon volumes as of January 17, 2018. "
  }, 
  {
    "id": "https://myanimelist.net/manga/44485/Nanatsu_no_Taizai", 
    "contents": "Looking for information on the manga Nanatsu no Taizai (The Seven Deadly Sins)? Find out more with MyAnimeList, the world's most active online anime and manga community and database. "
  }, 
  {
    "id": "http://watch7deadlysins2.net/", 
    "contents": "Watch Nanatsu no Taizai / The Seven Deadly Sins Season 2 and Season 1 English Subbed and Dubbed in High Quality "
  }, 
  {
    "id": "http://www.dictionary.com/browse/seven--deadly--sins", 
    "contents": "Seven deadly sins definition, the seven sins of pride, covetousness, lust, anger, gluttony, envy, and sloth. See more. "
  }, 
  {
    "id": "http://www.holyspiritinteractive.net/features/thesevendeadlysins/thesevendeadlysins.asp", 
    "contents": "Everything you every wanted to know about the Seven Deadly Sins "
  }, 
  {
    "id": "https://www.imdb.com/title/tt1492152/", 
    "contents": "The Seven Deadly Sins were once an active group of knights in the region of Britannia, who disbanded after they supposedly plotted to overthrow the Liones Kingdom. "
  }, 
  {
    "id": "https://www.investigationdiscovery.com/tv-shows/deadly-sins/", 
    "contents": "Deadly Sins Official Site. Watch Full Episodes, Get Behind the Scenes, Meet the Cast, and much more. Stream Deadly Sins FREE with Your TV Subscription! "
  }, 
  {
    "id": "https://www.reference.com/world-view/symbols-seven-deadly-sins-3a88c9000bce447e", 
    "contents": "Full Answer. Pride is considered the greatest of all sins, and is symbolized by the lion, peacock, and horse. The color that it is associated with is violet, and the punishment for committing this sin is being broken on the wheel. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/The_Seven_Deadly_Sins_(manga)", 
    "contents": "The Seven Deadly Sins (Japanese: 七つの大罪, Hepburn: Nanatsu no Taizai) is a Japanese fantasy manga series written and illustrated by Nakaba Suzuki.It has been serialized in Kodansha's Weekly Shōnen Magazine since October 2012, with the chapters collected into twenty-nine tankōbon volumes as of January 17, 2018. "
  }, 
  {
    "id": "https://www.whats-on-netflix.com/news/the-seven-deadly-sins-returns-to-netflix-in-2018/", 
    "contents": "More episodes of The Seven Deadly Sins are planned for 2018 in a brand new season plus there’s also an anime movie also scheduled for 2018 too! We’ve got everything... "
  }, 
  {
    "id": "http://watchanimeonline.me/the-seven-deadly-sins-dub/", 
    "contents": "Watch The Seven Deadly Sins full episodes online English sub, English Dub. Other title: Nanatsu no Taizai Synopsis: In a world similar to the European Middle Ages, the feared yet revered Holy Knights of Britannia use immensely powerful magic to protect the region of Britannia and its kingdoms. "
  }, 
  {
    "id": "https://www.quotev.com/quiz/5369278/Which-of-the-Seven-Deadly-Sins-are-you", 
    "contents": "Are you the victim of envy, or the sleeping beauty that falls victim to the sin of sloth? Is your vanity going to be your downfall, just like Lucifer? Do you want more, more, more, more than you ever need, like the demon price Beelzebub? "
  }, 
  {
    "id": "https://www.barnesandnoble.com/w/seven-deadly-sins-corey-taylor/1101087872", 
    "contents": "Corey Taylor is the New York Times bestselling author of Seven Deadly Sins, A Funny Thing Happened on the Way to Heaven, and You're Making Me Hate You.Lead singer of rock bands Slipknot and Stone Sour, Taylor has earned 11 Platinum records, 43 Gold records, and a Grammy. "
  }, 
  {
    "id": "http://www.sho.com/7-deadly-sins", 
    "contents": "The official site of the SHOWTIME Original Series 7 Deadly Sins. Find out about new episodes, watch previews, go behind the scenes and more. "
  }, 
  {
    "id": "https://www.animenewsnetwork.com/encyclopedia/anime.php?id=17688", 
    "contents": "Plot Summary: Taken the kingdom of Leones back from Holy Knights, the Seven Deadly Sins, along with Elizabeth and Hawk, can finally enjoy peaceful lives they earned. . However, with premonitions of a new threat are looming, their happy, ordinary days are about to e "
  }, 
  {
    "id": "http://www.watchdub.co/english-dubbed/the-seven-deadly-sins/", 
    "contents": "Watch episode The Seven Deadly Sins online in english dubbed-subbed for free at Watchdub. Best site for streaming HD/HQ anime and cartoon english dub "
  }, 
  {
    "id": "https://mangarock.com/manga/mrs-serie-172761", 
    "contents": "The \"Seven Deadly Sins\", a group of evil knights who conspired to overthrow the kingdom of Britannia, were said to have been eradicated by the Holy Knights, although some claim that they still live. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=7gduMeR9-vw", 
    "contents": "Mix - Opening 2 nanatsu no taizai (MAN WITH A MISSION - Seven Deadly Sins) YouTube; Hiroyuki Sawano - Perfect Time ＜Version 2＞ ft. Mika Kobayashi & mpi ... "
  }, 
  {
    "id": "https://mangarock.com/manga/mrs-serie-172761", 
    "contents": "The \"Seven Deadly Sins\", a group of evil knights who conspired to overthrow the kingdom of Britannia, were said to have been eradicated by the Holy Knights, although some claim that they still live. "
  }, 
  {
    "id": "http://www.ewtnreligiouscatalogue.com/Home+Page/BOOKS/Catechism/THE+SEVEN+DEADLY+SINS.axd", 
    "contents": "THE SEVEN DEADLY SINS Dr. Kevin Vost unpacks the teachings of St. Thomas Aquinas in an engaging and accessible way. He unveils the hidden connections between common sins and shows how each gives birth to other thoughts and deeds that help it reach its sinful goals. "
  }, 
  {
    "id": "https://www.animenewsnetwork.com/encyclopedia/anime.php?id=16167", 
    "contents": "The Seven Deadly Sins Anime's New TV Spot Previews FLOW, GRANRODEO Song (Sep 21, 2014) The Seven Deadly Sins Anime's New TV Spot Previews Theme Song (Sep 14, 2014) Mamoru Miyano Joins The Seven Deadly Sins Anime's Cast (Sep 7, 2014) Jun Fukuyama Joins The Seven Deadly Sins Anime's Cast (Aug 31, 2014 ... "
  }, 
  {
    "id": "https://www.playstation.com/en-us/games/the-seven-deadly-sins-knights-of-britannia-ps4/", 
    "contents": "Get The Seven Deadly Sins: Knights of Britannia, Action,Adventure game for PS4 console from the official PlayStation website. Explore The Seven Deadly Sins: Knights of Britannia game detail, demo, images, videos, reviews. "
  }, 
  {
    "id": "https://www.whats-on-netflix.com/news/the-seven-deadly-sins-returns-to-netflix-in-2018/", 
    "contents": "More episodes of The Seven Deadly Sins are planned for 2018 in a brand new season plus there’s also an anime movie also scheduled for 2018 too! We’ve got everything... "
  }, 
  {
    "id": "https://goodconfession.com/the-seven-deadly-sins/", 
    "contents": "The seven deadly (or ‘capital’) sins are “deadly” in that they are the source from which other sins flow. All sin distances us from God, and the capital sins do it in serious ways. "
  }, 
  {
    "id": "http://www.crunchyroll.com/comics/manga/the-seven-deadly-sins/volumes", 
    "contents": "About the Series. When they were accused of trying to overthrow the monarchy, the feared warriors the Seven Deadly Sins were sent into exile. Princess Elizabeth discovers the truth—the Sins were framed by the king's guard, the Holy Knights—too late to prevent them from assassinating her father and seizing the throne! "
  }, 
  {
    "id": "https://bible.org/seriespage/4-seven-deadly-sins", 
    "contents": "SESSION 4Seven Deadly Sins If we desire to pursue integrity wholeheartedly, we must be willing to acknowledge sin’s presence in our lives. The next few sessions are designed to prompt honest assessment of where sin has taken root in us. "
  }, 
  {
    "id": "https://otakumode.com/shop/label/Seven%20Deadly%20Sins", 
    "contents": "Browse our Seven Deadly Sins selection! Earn TOM Points! Free shipping on qualifying orders and products. Shop now! We're awaiting your order! "
  }, 
  {
    "id": "https://www.atlantaopera.org/performance/seven-deadly-sins/", 
    "contents": "Learn more about the performances for The Seven Deadly Sins at the Atlanta Opera. "
  }, 
  {
    "id": "https://www.thoughtco.com/what-are-the-seven-deadly-sins-542102", 
    "contents": "Find the names and meanings of the seven deadly sins, the tendencies that cause us to commit all other sins. "
  }, 
  {
    "id": "https://patrickoben.com/what-are-the-seven-deadly-sins-7-cardinal/", 
    "contents": "The seven deadly sins, also called cardinal sins, are a group of sins that the early church considered to be deadly because they cannot be forgiven. Well, this is not true that God will not forgive these sins but the point is that ... "
  }, 
  {
    "id": "http://vocaloid.wikia.com/wiki/Seven_Deadly_Sins", 
    "contents": "The Seven Deadly Sins (七つの大罪 Nanatsu no Taizai ) series is a series of songs made by mothy, also known as Akuno-P. The series is composed by seven songs, all of them are released. "
  }, 
  {
    "id": "https://www.thoughtco.com/punishing-the-seven-deadly-sins-4123091", 
    "contents": "Gregory the Great created the definitive list of seven deadly sins: pride, envy, anger, dejection, avarice, gluttony and lust. "
  }, 
  {
    "id": "https://www.reddit.com/r/NanatsunoTaizai/", 
    "contents": "Reddit gives you the best of the internet in one place. Get a constantly updating feed of breaking news, fun stories, pics, memes, and videos just for you. Passionate about something niche? "
  }, 
  {
    "id": "http://watch7deadlysins2.net/the-seven-deadly-sins-signs-of-holy-war-episode-2-subbed/", 
    "contents": "Watch Seven Deadly Sins : Signs of Holy War Episode 1 Subbed in High Quality . "
  }, 
  {
    "id": "http://msaprilshowers.com/emotions/origins-of-the-seven-deadly-sins/", 
    "contents": "These definitions include the Latin name as well as the original colours and animals associated with each of the seven deadly sins. The famous 7 deadly sins list. "
  }, 
  {
    "id": "https://www.commonsensemedia.org/tv-reviews/the-seven-deadly-sins", 
    "contents": "Smart manga-inspired series has edgy sexual content, too. Read Common Sense Media's The Seven Deadly Sins review, age rating, and parents guide. "
  }, 
  {
    "id": "https://reelrundown.com/animation/Animes-like-Nanatsu-no-Taizai", 
    "contents": "Join the fun-filled adventure of facing uncertain perils and worldly mysteries side-by-side with Nanatsu no Taizai and the anime similar to it. "
  }, 
  {
    "id": "https://www.sidereel.com/tv-shows/the-seven-deadly-sins/season-1", 
    "contents": "Watch The Seven Deadly Sins Season 1 episodes online with help from SideReel. We connect you to show links, recaps, reviews, news and more. "
  }, 
  {
    "id": "http://www.stanneshrine.com/liturgy/confession/the-seven-deadly-sins-and-their-remedies/", 
    "contents": "The first of the seven deadly sins is pride, defined as inordinate self-esteem or self-importance. Pride is the prolific source of countless sins, including presumption, hypocrisy, disobedience to lawful superiors, hardheartedness to subordinates, acrimony, and boastfulness. "
  }, 
  {
    "id": "https://www.yidio.com/show/the-seven-deadly-sins", 
    "contents": "The Seven Deadly Sins is currently available to watch and stream on MBS. You can also stream, download, buy, rent The Seven Deadly Sins on demand at Amazon, Netflix online. "
  }, 
  {
    "id": "https://www.facebook.com/thesevendeadlysinsofficial", 
    "contents": "The Seven Deadly Sins. 581 likes · 2 talking about this. http://overthehedgemusic.com/ http://www.quietasamouseofficial.com/ "
  }, 
  {
    "id": "https://otakumode.com/shop/label/Seven%20Deadly%20Sins", 
    "contents": "Three light novels based on the series have also been published: The Seven Deadly Sins-Gaiden- The Seven Wishes of the Royal city from Old Times and The Seven Deadly Sins-Gaiden- The Seven Scars Left Behind by Shuka Matsuda, and The Seven Deadly Sins: Seven Days by Mamoru Iwasa. "
  }, 
  {
    "id": "https://www.tumblr.com/search/the%20seven%20deadly%20sins", 
    "contents": "The Seven Deadly Sins/Nanatsu no Taizai iPhone wallpapers #editingtime. So my fairy tail wallpapers were really enjoyed by you guys, and I thought it would be a good idea do the same thing for other series and here we are. "
  }, 
  {
    "id": "http://theevilliouschronicles.wikia.com/wiki/Seven_Deadly_Sins_Series", 
    "contents": "The Seven Deadly Sins Series, also known as the Deadly Sins of Evil series, is a multimedia series conceptualized and developed by Akuno-P. It belongs to mothy's larger Evillious Chronicles. "
  }, 
  {
    "id": "https://www.reference.com/world-view/symbols-seven-deadly-sins-3a88c9000bce447e", 
    "contents": "Quick Answer. The Seven Deadly Sins according to Christianity are: pride, symbolized by the lion, peacock and horse; envy, symbolized by a dog; anger, symbolized by a bear; sloth, symbolized by a goat; greed, symbolized by a frog; gluttony, symbolized by the pig; and lust, symbolized by the cow and snake. "
  }, 
  {
    "id": "http://www.catholicbible101.com/7deadlysins.htm", 
    "contents": "Catholic Bible 101 - 7 Deadly Sins ... The Capital Virtues, which are the opposite of the seven deadly sins, are as follows: Chastity - It overcomes the sin of lust. "
  }, 
  {
    "id": "https://myanimelist.net/manga/44485/Nanatsu_no_Taizai", 
    "contents": "Looking for information on the manga Nanatsu no Taizai (The Seven Deadly Sins)? Find out more with MyAnimeList, the world's most active online anime and manga community and database. "
  }, 
  {
    "id": "https://www.inquisitr.com/4372151/the-seven-deadly-sins-season-2-release-date-nanatsu-no-taizai-netflix-anime-movie-trailer-manga-meliodas-season-3/", 
    "contents": "July 17, 2017 ‘The Seven Deadly Sins’ Season 2 Release Date On Netflix Anime: ‘Nanatsu No Taizai: Imashime no Fukkats’ Trailer, Movie Confirmed [Manga Spoilers] "
  }, 
  {
    "id": "http://www.dictionary.com/e/religion/the-seven-deadly-sins/", 
    "contents": "Where does the seven deadly sins come from? While the concept of an inventory of moral offenses has roots in antiquity, Pope Gregory I first enumerated the seven deadly sins in the late sixth century. For his list, Gregory drew from the ideas of Evargius Ponticus, a fourth century Christian monk who ... "
  }, 
  {
    "id": "https://myanimelist.net/manga/44485/Nanatsu_no_Taizai", 
    "contents": "Looking for information on the manga Nanatsu no Taizai (The Seven Deadly Sins)? Find out more with MyAnimeList, the world's most active online anime and manga community and database. "
  }, 
  {
    "id": "https://www.inquisitr.com/4372151/the-seven-deadly-sins-season-2-release-date-nanatsu-no-taizai-netflix-anime-movie-trailer-manga-meliodas-season-3/", 
    "contents": "July 17, 2017 ‘The Seven Deadly Sins’ Season 2 Release Date On Netflix Anime: ‘Nanatsu No Taizai: Imashime no Fukkats’ Trailer, Movie Confirmed [Manga Spoilers] "
  }, 
  {
    "id": "http://www.ewtn.com/vexperts/showmessage.asp?number=362724", 
    "contents": "It is important to notice that five of the seven deadly sins latch onto a \"part\" or dimension of the soul called desire or eros, ... "
  }, 
  {
    "id": "http://justdubs.org/watch-seven-deadly-sins-english-dubbed", 
    "contents": "Watch The Seven Deadly Sins English dubbed, Stream The Seven Deadly Sins dub, The Seven Deadly Sins English dubbed download. Watch The Seven Deadly Sins online in high quality at JustDubs Online "
  }, 
  {
    "id": "https://www.etsy.com/market/seven_deadly_sins", 
    "contents": "You searched for: seven deadly sins! Etsy is the home to thousands of handmade, vintage, and one-of-a-kind products and gifts related to your search. No matter what you’re looking for or where you are in the world, our global marketplace of sellers can help you find unique and affordable options. "
  }, 
  {
    "id": "https://owlcation.com/humanities/Shakespeare-and-the-Seven-Deadly-Sins", 
    "contents": "Did you ever think Shakespeare used the 7 deadly sins as a basis for his plays? He could have. This article gives in depth analysis of the way he portrayed these sins without saying them directly. "
  }, 
  {
    "id": "https://www.atlantaopera.org/performance/seven-deadly-sins/", 
    "contents": "Learn more about the performances for The Seven Deadly Sins at the Atlanta Opera. "
  }, 
  {
    "id": "http://tvtropes.org/pmwiki/pmwiki.php/Manga/TheSevenDeadlySins", 
    "contents": "The Seven Deadly Sins (Nanatsu no Taizai) is a fantasy adventure manga of a land under a terrible tyranny... brought about by the Holy Knights, who have … "
  }, 
  {
    "id": "https://honeysanime.com/top-10-lethal-seven-deadly-sins-characters/", 
    "contents": "Today, we will list our Top 10 Lethal Seven Deadly Sins Characters. This is not to show who is the most powerful or the strongest, it is to show how dangerous and destructive they can be. "
  }, 
  {
    "id": "http://www.religionfacts.com/seven-deadly-sins", 
    "contents": "Seven Deadly Sins The Seven Deadly Sins are sins that characterize fallen humanity, so classified by traditional orthodox Christianity and especially held to, and taught by, the Roman Catholic Church since the early Middle Ages. "
  }, 
  {
    "id": "https://myenglisheffects.com/2017/03/27/an-inspector-call-and-the-seven-deadly-sins/", 
    "contents": "The seven deadly sins are also known as cardinal sins, or capital vices. These delightful characteristics are of Christian origin and concern the grouping of certain behaviours that have immorality as their bedfellow. They are: pride, greed, lust, envy, gluttony, wrath and sloth. "
  }, 
  {
    "id": "https://www.catholiccompany.com/content/7-Deadly-Sins.cfm", 
    "contents": "People have heard of and can recall the seven deadly sins, also known as the capital vices and cardinal sins. But, so often we cannot name the virtues which help us overcome these sins! "
  }, 
  {
    "id": "https://www.opptrends.com/seven-deadly-sins-season-3-release-date/", 
    "contents": "The Seven Deadly Sins Season 2 Was Not What Fans Expected Last year in August, the four-episode anime special called The Seven Deadly Sins: Signs of Holy War was launched. The four Nanatsu no Taizai episodes became what is known as Netflix’s The Seven Deadly Sins Season 2. "
  }, 
  {
    "id": "http://www.animelyrics.com/anime/7tsunotaizai/sevendeadlysins.htm", 
    "contents": "Seven Deadly Sins - Seven Deadly Sins, 2nd Opening Theme, Nanatsu no Taizai; The Seven Deadly Sins, lyrics,song lyrics,music lyrics,lyric songs,lyric search,words to song,song words,anime music,megumi hayashibara lyric "
  }, 
  {
    "id": "http://www.indepthinfo.com/articles/seven-deadly-sins.htm", 
    "contents": "As a group, lust, gluttony, greed, sloth, wrath, envy, and pride, are known as the seven deadly sins, or cardinal sins, or even capital vices. Often thought to be a Christian construct, the perception of sins or vices long predates Christianity. "
  }, 
  {
    "id": "http://www.behindthevoiceactors.com/tv-shows/The-Seven-Deadly-Sins/side-by-side/", 
    "contents": "Images of the voice actors and characters from The Seven Deadly Sins. "
  }, 
  {
    "id": "https://123moviesz.com/tvshows/90301-the-seven-deadly-sins/seasons/3/episodes/1", 
    "contents": "Watch The Seven Deadly Sins Season 3, Episode 1 online on 123Movies "
  }, 
  {
    "id": "http://charmed.wikia.com/wiki/Seven_Deadly_Sins", 
    "contents": "The Seven Deadly Sins are seven of the most vile sins of humanity that a person can commit, condensed into sin balls by the Source of All Evil. The sins are spread by demonic infectors, former humans who were turned into demons after being consumed by sin, who seek to place them in paragons of good. "
  }
]