[
  {
    "id": "https://www.healthline.com/nutrition/7-health-benefits-dark-chocolate", 
    "contents": "This article takes a detailed look at dark chocolate and its health benefits. It is actually loaded with antioxidants and beneficial nutrients. "
  }, 
  {
    "id": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/6-health-benefits-of-dark-chocolate.html", 
    "contents": "Dark chocolate has recently been discovered to have a number of healthy benefits. While eating dark chocolate can lead to the health benefits described below, remember that chocolate is also high in fat. Use FitDay to keep track of your calories and nutrition as you work towards your weight loss ... "
  }, 
  {
    "id": "https://draxe.com/benefits-of-dark-chocolate/", 
    "contents": "Chocolate can be good for you — really! Learn all about the health benefits of dark chocolate. Just make sure not to overdo it. "
  }, 
  {
    "id": "https://articles.mercola.com/sites/articles/archive/2016/02/08/amazing-health-benefits-dark-chocolate.aspx", 
    "contents": "Many studies have confirmed that cacao can benefit your heart, blood vessels, brain, nervous system, and helps combat conditions rooted in inflammation. "
  }, 
  {
    "id": "https://www.webmd.com/diet/news/20120424/pick-dark-chocolate-health-benefits", 
    "contents": "If you're eating chocolate for the health benefits -- and aren't we all? -- you must pick wisely, new research suggests. "
  }, 
  {
    "id": "https://www.mensjournal.com/food-drink/7-health-benefits-dark-chocolate", 
    "contents": "We’ll eat dark chocolate however we can get it—kisses, squares, bars… straight from a dessert fountain. Luckily, there are myriad reasons that make this treat nearly guilt-free (in moderation, of course). "
  }, 
  {
    "id": "https://www.nutritionadvance.com/dark-chocolate-health-benefits/", 
    "contents": "You may have heard that dark chocolate is a huge source of polyphenols, but that's far from the only reason to eat it. Here are 9 impressive health benefits. "
  }, 
  {
    "id": "https://www.alternet.org/food/14-health-benefits-dark-chocolate-according-science", 
    "contents": "It lowers blood pressure, improves brain function and it's delicious. Dark chocolate is not a guilty pleasure; it actually comes with many health benefits. Real dark chocolate—not processed and sweetened milk chocolate—is chock-full of incredible health benefits. "
  }, 
  {
    "id": "https://blog.paleohacks.com/health-benefits-of-dark-chocolate/", 
    "contents": "There are actually many health benefits of dark chocolate! Find out why you shouldn't be afraid to enjoy a morsel, and what makes dark chocolate so healthy. "
  }, 
  {
    "id": "http://time.com/3593624/benefits-of-dark-chocolate/", 
    "contents": "The experts have spoken and the dark chocolate benefits are rich. Dark chocolate is good for both your heart and stress levels "
  }, 
  {
    "id": "https://www.cnn.com/2017/10/06/health/dark-chocolate-healthy-food-drayer/index.html", 
    "contents": "Yes, dark chocolate consumption is linked to improved health, but if you eat too much, fat and sugar offset those benefits. "
  }, 
  {
    "id": "https://www.mensjournal.com/food-drink/7-health-benefits-dark-chocolate", 
    "contents": "We’ll eat dark chocolate however we can get it—kisses, squares, bars… straight from a dessert fountain. Luckily, there are myriad reasons that make this treat nearly guilt-free (in moderation, of course). "
  }, 
  {
    "id": "https://www.alternet.org/food/14-health-benefits-dark-chocolate-according-science", 
    "contents": "It lowers blood pressure, improves brain function and it's delicious. Dark chocolate is not a guilty pleasure; it actually comes with many health benefits. Real dark chocolate—not processed and sweetened milk chocolate—is chock-full of incredible health benefits. "
  }, 
  {
    "id": "https://articles.mercola.com/sites/articles/archive/2014/03/31/dark-chocolate-health-benefits.aspx", 
    "contents": "By Dr. Mercola. The health benefits of dark chocolate are all the rage right now, with increasing numbers of studies pointing to its rich concentrations of beneficial antioxidants and polyphenols. "
  }, 
  {
    "id": "https://www.medicalnewstoday.com/articles/270272.php", 
    "contents": "Who might once have thought that chocolate could be so much more than a delicious but ultimately naughty treat? Well, research continues to show that eating chocolate, especially the dark variety high in cocoa, can have many benefits, including stopping bad cholesterol and cognitive decline. "
  }, 
  {
    "id": "https://www.nutritionadvance.com/dark-chocolate-health-benefits/", 
    "contents": "You may have heard that dark chocolate is a huge source of polyphenols, but that's far from the only reason to eat it. Here are 9 impressive health benefits. "
  }, 
  {
    "id": "https://blog.paleohacks.com/health-benefits-of-dark-chocolate/", 
    "contents": "There are actually many health benefits of dark chocolate! Find out why you shouldn't be afraid to enjoy a morsel, and what makes dark chocolate so healthy. "
  }, 
  {
    "id": "https://www.womenshealthmag.com/health/g19925426/benefits-of-chocolate/", 
    "contents": "Chocolate is healthy. Here, the healh benefits of eating chocolate "
  }, 
  {
    "id": "https://www.verywellfit.com/health-benefits-of-chocolate-2223857", 
    "contents": "Research shows that antioxidants in dark chocolate protect your heart against aging, damage, and heart disease. Learn more. "
  }, 
  {
    "id": "https://www.livestrong.com/slideshow/1011272-12-clean-dark-chocolate-bars/", 
    "contents": "Eating small amounts of dark chocolate can be good for your health. Chocolate comes from a plant -- the bean of the cacao tree -- and, like certain teas,... "
  }, 
  {
    "id": "https://www.prevention.com/food-nutrition/a20501213/benefits-dark-chocolate/", 
    "contents": "Don't feel guilty about eating that chocolate square. Benefits of dark chocolate include reducing blood pressure for a healthy heart. "
  }, 
  {
    "id": "http://time.com/3593624/benefits-of-dark-chocolate/", 
    "contents": "The experts have spoken and the dark chocolate benefits are rich. Dark chocolate is good for both your heart and stress levels "
  }, 
  {
    "id": "https://www.naturalnewsblogs.com/dark-chocolate-health-benefits-much-dark-chocolate-healthy/", 
    "contents": "What are the most essential dark chocolate health benefits? "
  }, 
  {
    "id": "https://www.organicfacts.net/dark-chocolate.html", 
    "contents": "Dark chocolate rich in cocoa, maintains optimal blood pressure, lowers cholesterol, boosts immunity, cures depression, improves heart health & gives relief from anemia. "
  }, 
  {
    "id": "https://www.huffingtonpost.com/2015/08/12/chocolate-health-benefits_n_1383372.html", 
    "contents": "Take a look at some of the surprising health benefits below, ... One of the reasons dark chocolate is especially heart-healthy is its inflammation ... "
  }, 
  {
    "id": "https://www.rd.com/health/wellness/health-benefits-of-chocolate/", 
    "contents": "You can increase the health benefits of your dark chocolate by having some almonds for some added crunch and healthy fats, says Kelly. "
  }, 
  {
    "id": "https://www.wellandgood.com/good-food/healthy-chocolate-bars/", 
    "contents": "Compartés Vegan Zen Healthy Kale Dark Chocolate Bar. Yes, there is kale in this chocolate bar. ... This adaptogenic mushroom chai latte is a benefits-packed alternative. "
  }, 
  {
    "id": "https://www.naturalfoodseries.com/11-benefits-dark-chocolate/", 
    "contents": "Dark Chocolate health benefits includes boosting psychological health, supporting eye health, promoting blood circulation, works as an energy booster, support oral health, a good source of anti-oxidants, support cardiovascular health, treating cough, strengthening immune system, and enhancing your mood. "
  }, 
  {
    "id": "http://naturalsociety.com/dark-chocolate-health-benefits-surprisingly-healthy-superfood/", 
    "contents": "Chocolate can be extremely healthful and beneficial to your health, but before you get carried away with those common candy bars from childhood, understand that the superfood nutritional qualities come from cacao or cocoa, the bitter seeds from which chocolate is made. It’s best to select ... "
  }, 
  {
    "id": "https://www.telegraph.co.uk/health-fitness/nutrition/chocolate-10-health-reasons-you-should-eat-more-of-it/", 
    "contents": "Chocolate is the ultimate comfort food, a sure-fire stand-by in times of stress, a reliable source of consolation when life has let us down, and a mood-enhancer and romance-inducer in more positive circumstances. But is it at all healthy? If you scoff lots of it, obviously not. But there are a host ... "
  }, 
  {
    "id": "http://www.diabetescare.net/authors/clara-schneider/delicious-dark-chocolate-and-diabetes", 
    "contents": "Mouthwatering dark chocolate; could it be true that there are health benefits to eating it? Should someone with diabetes avoid the sheer pleasure of dark chocolate? Are there any precautions to take? What is the real story surrounding dark chocolate and diabetes? Last but not least DiabetesCare.net ... "
  }, 
  {
    "id": "http://naturalsociety.com/dark-chocolate-health-benefits-surprisingly-healthy-superfood/", 
    "contents": "Chocolate can be extremely healthful and beneficial to your health, but before you get carried away with those common candy bars from childhood, understand that the superfood nutritional qualities come from cacao or cocoa, the bitter seeds from which chocolate is made. It’s best to select ... "
  }, 
  {
    "id": "https://chopra.com/articles/the-health-benefits-and-risks-of-dark-chocolate", 
    "contents": "Dark chocolate is often lauded as the healthful darling of desserts. Although it boasts a list of perks, it also comes with some potential downsides. Learn the yin and yang of this semi-sweet treat so you can thoughtfully indulge. "
  }, 
  {
    "id": "https://www.runnersworld.com/news/a20795668/how-much-chocolate-do-you-need-to-eat-for-health-benefits/", 
    "contents": "But it matters what type of dark chocolate you nibble on. For the heart health benefits, reach for at least 70 percent cacao, which is fairly bitter without the added fat and sugar. "
  }, 
  {
    "id": "http://healthyeating.sfgate.com/benefits-risks-72-percent-dark-chocolate-5245.html", 
    "contents": "Dark chocolate can provide health benefits, as long as you consume it in moderation. In general, the darker the chocolate, the more nutritious it is, providing richer amounts of helpful compounds such as antioxidants. "
  }, 
  {
    "id": "https://www.cnn.com/2016/02/10/health/chocolate-health-benefits/index.html", 
    "contents": "Research has even backed up some of the more bizarre health benefits that have been ascribed to cocoa. ... It's usually sweeter than dark chocolate, ... "
  }, 
  {
    "id": "https://www.vox.com/science-and-health/2017/10/18/15995478/chocolate-health-benefits-heart-disease", 
    "contents": "Dark chocolate is now a health ... and not necessarily public health. Here at Vox, ... Mars’ initial focus on studying the health benefits of chocolate has shifted ... "
  }, 
  {
    "id": "https://allnaturalideas.com/chocolate-health-benefits/", 
    "contents": "Many of us reach for chocolate when we need comfort or a little treat. But, what's the best dark chocolate to consume for health benefits? "
  }, 
  {
    "id": "https://www.rd.com/health/wellness/health-benefits-of-chocolate/", 
    "contents": "Chocolate is not only delicious, it has surprising health benefits, especially if the concentration of cocoa is 70 percent or higher. "
  }, 
  {
    "id": "https://www.mensjournal.com/health-fitness/the-very-real-health-benefits-of-dark-chocolate-20140903/", 
    "contents": "In moderation, eating dark chocolate may even go as far as protecting against heart attack and stroke. "
  }, 
  {
    "id": "https://asweetlife.org/the-health-benefits-of-dark-chocolate/", 
    "contents": "According to a study in the American Journal of Clinical Nutrition, adding dark chocolate to your diet increases antioxidant capacity and lessens... "
  }, 
  {
    "id": "https://health.usnews.com/wellness/health-buzz/articles/2018-04-27/studies-dark-chocolate-lowers-your-stress-levels-offers-other-benefits", 
    "contents": "While dark chocolate has its health benefits, people still have to be wary of portion size to limit the fat, sugar and calories that come along with it. "
  }, 
  {
    "id": "https://www.scientificamerican.com/article/why-is-dark-chocolate-good-for-you-thank-your-microbes/", 
    "contents": "Why Is Dark Chocolate Good for You? ... the cardiovascular and other benefits from dark chocolate ... chocolate confers benefits even on the young and healthy. "
  }, 
  {
    "id": "https://wikihomenutrition.com/dark-chocolate-health-benefits/", 
    "contents": "This article sheds light on top 10 health benefits of dark chocolate and its nutrition facts, as well as warns you of some possible side effects... "
  }, 
  {
    "id": "http://www.heritageofcare.com/resources/blog/entry/dark-chocolate-health-benefits.html", 
    "contents": "Just about everyone loves chocolate. Anyone with a sweet tooth likely has a favorite chocolate treat or brand they most enjoy. Worldwide, more than $75 billion is spent on chocolate delights every year! "
  }, 
  {
    "id": "https://www.davidwolfe.com/dark-chocolate-health-benefits/", 
    "contents": "When it comes to health, there is a right kind of chocolate, and a wrong kind of chocolate. Dark chocolate is the way to go, but be forewarned: not all dark chocolate is created equal. "
  }, 
  {
    "id": "http://health.facty.com/food/nutrition/truly-amazing-health-benefits-of-dark-chocolate/", 
    "contents": "Chocolate is one of the most popular and well-loved types of food all over the world. But not all chocolates are equal. Among all of them, the healthiest variety happens to be dark chocolate. "
  }, 
  {
    "id": "https://niftybenefits.com/benefits-dark-chocolate/", 
    "contents": "This “food of the gods,” according to ancient civilizations, has built an impressive chart for itself. Here are the health benefits of dark chocolate. "
  }, 
  {
    "id": "https://iythealth.com/health-benefits-dark-chocolate/", 
    "contents": "The world likes chocolate. Americans eat 3 billion pounds of it every year. However US intake lags far behind that of the top chocolate-loving nations like Switzerland, Germany, and Great Britain. "
  }, 
  {
    "id": "https://www.consumerreports.org/chocolate-bars/milk-chocolate-health-benefits/", 
    "contents": "Consumer Reports takes a look at the research on the health benefits of milk chocolate vs. dark chocolate. "
  }, 
  {
    "id": "https://www.medscape.com/features/slideshow/chocolate", 
    "contents": "A look at the varied health benefits associated with dark chocolate consumption. "
  }, 
  {
    "id": "https://www.menshealth.com/nutrition/a19553597/dark-chocolate-health-benefits/", 
    "contents": "Love is in the air. I walked into a Walgreen’s store earlier and it was wall to wall Valentine’s Day \"stuff\" from Teddy Bears to balloons, cards and of course, aisles and aisles of … chocolate. "
  }, 
  {
    "id": "https://blackdoctor.org/514998/5-health-benefits-of-eating-dark-chocolate/", 
    "contents": "Dark chocolate isn’t just any sweet treat. According to research, it’s loaded with nutrients that can positively impact your health "
  }, 
  {
    "id": "https://niftybenefits.com/benefits-dark-chocolate/", 
    "contents": "This “food of the gods,” according to ancient civilizations, has built an impressive chart for itself. Here are the health benefits of dark chocolate. "
  }, 
  {
    "id": "https://www.healthlogus.com/dark-chocolate-health-benefits/", 
    "contents": "It is chocolate with no milk or low than milk chocolate.Dark chocolate can be eaten as is,used in cooking for amazing dark chocolate health benefits. "
  }, 
  {
    "id": "https://www.verywellhealth.com/how-much-dark-chocolate-should-i-eat-to-live-longer-2223572", 
    "contents": "If you love dark chocolate, you’re probably well aware of research that suggests it has important health benefits, mostly through improving heart health.It's a bonus to justify your chocolate addiction in the name of longevity. "
  }, 
  {
    "id": "https://info.dralexrinehart.com/articles/nutrition-benefits/health-benefits-of-dark-chocolate", 
    "contents": "What does dark chocolate have to do with apples, red wine, green tea, onions and cranberries? They share powerful chemicals called flavonoids.. Once you take a peek at the inner health benefits of dark chocolate, you will be pleased to know that not all nutrition news has to be disheartening for your palate. "
  }, 
  {
    "id": "https://spoonuniversity.com/lifestyle/the-actual-health-benefits-of-dark-chocolate", 
    "contents": "I'm a massive fan of dark chocolate. I have it every day, without exception. The best part is I don't even need to feel guilty, because dark chocolate actually has surprising health benefits. That's right. Dark chocolate contains something called flavanols. Flavanols have a positive effect on your ... "
  }, 
  {
    "id": "https://www.mapleholistics.com/blog/dark-chocolate-health-benefits/", 
    "contents": "What is Dark Chocolate? How good is it for your health? In this article, we take a look at the multiple uses of Dark Chocolate and all its benefits. "
  }, 
  {
    "id": "https://www.positivehealthwellness.com/diet-nutrition/12-proven-benefits-dark-chocolate-no-8-best/", 
    "contents": "Need proof that your daily ration of chocolate is a \"health decision\"? Here are some of the scientifically proven benefits of dark chocolate: 1. It's Delicious. "
  }, 
  {
    "id": "https://www.medscape.com/features/slideshow/chocolate", 
    "contents": "A look at the varied health benefits associated with dark chocolate consumption. "
  }, 
  {
    "id": "https://www.livestrong.com/article/471858-benefits-and-risks-of-72-dark-chocolate/", 
    "contents": "Dark chocolate offers more health benefits than milk or white chocolate. The higher concentration of cocoa means that dark chocolate contains more... "
  }, 
  {
    "id": "https://vegetarian-nutrition.info/dark-chocolate-health-benefits/", 
    "contents": "Cocoa is a good source of magnesium, phytosterols, and the potent health-promoting proanthocyanidins that are found also in blueberries and cranberries. Chocolate is a rich source of epicatechins which are believed to possess cardio-protective properties. "
  }, 
  {
    "id": "https://www.menshealth.com/health/a19523394/dark-chocolate-brain-health-benefits/", 
    "contents": "Dark chocolate may boost your memory, improve your cognition, and even decrease your risk for dementia, research shows. Are you eating enough? "
  }, 
  {
    "id": "https://www.psychologytoday.com/us/blog/the-resilient-brain/201410/dark-chocolate-good-your-brain", 
    "contents": "Dark chocolate - beneficial to your brain health and wellness. Go ahead indulge! "
  }, 
  {
    "id": "https://www.eatthis.com/best-dark-chocolate/", 
    "contents": "If you're an avid reader of Eat This, Not That! you probably know how much we rave about the benefits of dark chocolate. Now, at last: The official ETNT-approved guide to which dark chocolates will most effectively play a role in helping your health and which will just be something that makes you fatter. "
  }, 
  {
    "id": "http://hdcs.fullerton.edu/csa/WholePerson/documents/hearthealthybenefitsofdarkchocolate.pdf", 
    "contents": "Heart Healthy Benefits of Dark Chocolate 1. ... for health. 2. Dark chocolate is generally lower in calories than milk chocolate because of its lower sugar content. 3. "
  }, 
  {
    "id": "http://www.nutritionmyths.com/dark-chocolate-health-benefits/", 
    "contents": "Eating dark chocolate may decrease the risk of cardiovascular disease, helps to reduce inflammation, increase vasodilation, improve BP, inhibit platelet adhesion and improve lipid profile and is associated with potential benefits in infectious diseases and cancer, type 2 diabetes, central nervous system and skin protection. "
  }, 
  {
    "id": "https://food.ndtv.com/food-drinks/top-6-health-benefits-of-dark-chocolate-1240734", 
    "contents": "Here are 6 amazing health benefits of dark chocolate. If taste wasnt reason enough for you to gorge on perfectly shaped cubes of dark chocolate then here are six more. "
  }, 
  {
    "id": "https://www.healthymummy.com/9-health-benefits-of-chocolate/", 
    "contents": "Wow. Here are 9 AWESOME (and surprising) health benefits of dark chocolate. Here's how to indulge healthily... "
  }, 
  {
    "id": "https://drjohnday.com/the-top-10-benefits-of-dark-chocolate/", 
    "contents": "The top 10 benefits of dark chocolate are discussed. Dark chocolate is heart healthy but also has risks. The key is to eat it in moderation. "
  }, 
  {
    "id": "https://nutrineat.com/dark-chocolate-health-benefits", 
    "contents": "Who can resist a piece of sweet, rich and indulgent chocolate? The seemingly sinful dark chocolate which we always link with guilty pleasures, can actually be quite good for your health. "
  }, 
  {
    "id": "https://www.prevention.com/food-nutrition/a19133941/dark-chocolate-vs-milk-chocolate/", 
    "contents": "Dark Chocolate vs. Milk Chocolate: ... Nobody needs an excuse to eat more chocolate, but the fact that it's been shown to have health benefits sure is a good one. "
  }, 
  {
    "id": "http://www.arayachocolate.com/health-benefits-of-dark-chocolate/", 
    "contents": "7 Proven Health Benefits of Dark Chocolate: 1 -VERY NUTRITIOUS: A 100 gram bar of dark chocolate with 70-85% cocoa contains: 11 grams of fiber "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=1bZBfBBjZ9g", 
    "contents": "Eating dark chocolate can result in some incredible health benefits! What are they? Join Laci as she discusses why we should all be eating dark chocolate! "
  }, 
  {
    "id": "https://www.ambitiouskitchen.com/13-of-the-best-dark-chocolate-bars/", 
    "contents": "Here are the dark chocolate bars you should be eating. Plus, learn about a few health benefits of dark chocolate. "
  }, 
  {
    "id": "http://urbanwired.com/health/dark-chocolate-nutrition-facts/", 
    "contents": "Most of us enjoy chocolate for the taste and happiness but these amazing dark chocolate nutrition facts give it status of a Super food. "
  }, 
  {
    "id": "https://morellifit.com/dark-chocolate-health-benefits/", 
    "contents": "Milk chocolate is a highly sweetened, fatty confectionary that doesn’t do much for improving your health, except for making you feel a little happier. The same goes for white chocolate. "
  }, 
  {
    "id": "https://blog.bulletproof.com/is-chocolate-good-for-you-health-benefits/", 
    "contents": "Learn the health benefits of dark chocolate, how to source the best quality chocolate and the little-known compound that makes chocolate so good for you. "
  }, 
  {
    "id": "https://www.cbsnews.com/news/heart-health-benefits-of-chocolate/", 
    "contents": "Chocolate lovers in the current study ate more milk chocolate than dark chocolate, which suggests that the health benefits of chocolate aren't specific to dark, which is often touted for its health benefits because it contains a compound called flavonoids. "
  }, 
  {
    "id": "https://blackdoctor.org/446016/health-benefits-dark-chocolate/", 
    "contents": "All chocolate isn't bad for you. See why dark chocolate is good for your health. "
  }, 
  {
    "id": "http://mohrresults.com/dark-chocolate-health-benefits/", 
    "contents": "Dark chocolate has heart health properties. With Valentine’s Day around the corner and over $1 billion spent on chocolate for this holiday, people may wonder about the health benefits of chocolate. "
  }, 
  {
    "id": "http://doctormurray.com/chocolate/", 
    "contents": "One of the key benefits of chocolate consumption is its effect on cardiovascular disease. Learn more from the world's leading authority on Natural Medicine. "
  }, 
  {
    "id": "https://www.sciencedaily.com/releases/2018/04/180424133628.htm", 
    "contents": "Findings from two new studies show dark chocolate consumption reduces stress and inflammation, while improving memory, immunity and mood. New research shows there might be health benefits to eating certain types of dark chocolate. Findings from two studies being presented today at the Experimental ... "
  }, 
  {
    "id": "https://www.openhand.org/blog/hearth-healthy-chocolate-and-flavanols", 
    "contents": "Dark chocolate has been shown to be a good source of heart protective ... Hearth-healthy Chocolate and Flavanols. ... which may confer several heart healthy benefits. "
  }, 
  {
    "id": "http://urbanwired.com/health/dark-chocolate-nutrition-facts/", 
    "contents": "Most of us enjoy chocolate for the taste and happiness but these amazing dark chocolate nutrition facts give it status of a Super food. "
  }, 
  {
    "id": "https://morellifit.com/dark-chocolate-health-benefits/", 
    "contents": "Milk chocolate is a highly sweetened, fatty confectionary that doesn’t do much for improving your health, except for making you feel a little happier. The same goes for white chocolate. "
  }, 
  {
    "id": "https://www.top10homeremedies.com/kitchen-ingredients/top-10-health-benefits-dark-chocolate.html", 
    "contents": "Dark chocolate, also known as ‘black chocolate’, is made from the roasted cocoa beans of the cacao tree, fat and sugar. Unlike milk chocolate, dark chocolate has no milk or much less. "
  }, 
  {
    "id": "https://fitwirr.com/health/tips/dark-chocolate-health-benefits", 
    "contents": "We all know that fruits and veggies are healthy for us, but sometime not so obvious food like dark chocolate can be super healthy too, especially when you eat in moderation. "
  }, 
  {
    "id": "http://dailyhealthremedies.com/11-health-benefits-of-chocolate/", 
    "contents": "Dark chocolate has recently joined the ranks of superfoods, those fruits and vegetables renowned for their nutritive value. Fresh from the tree, cocoa seeds are rich in minerals and antioxidants, which confer many health benefits. "
  }, 
  {
    "id": "https://vegetarian-nutrition.info/dark-chocolate-health-benefits/", 
    "contents": "Cocoa is a good source of magnesium, phytosterols, and the potent health-promoting proanthocyanidins that are found also in blueberries and cranberries. Chocolate is a rich source of epicatechins which are believed to possess cardio-protective properties. "
  }, 
  {
    "id": "https://blackdoctor.org/446016/health-benefits-dark-chocolate/", 
    "contents": "All chocolate isn't bad for you. See why dark chocolate is good for your health. "
  }, 
  {
    "id": "http://mohrresults.com/dark-chocolate-health-benefits/", 
    "contents": "Dark chocolate has heart health properties. With Valentine’s Day around the corner and over $1 billion spent on chocolate for this holiday, people may wonder about the health benefits of chocolate. "
  }, 
  {
    "id": "https://health.howstuffworks.com/wellness/food-nutrition/facts/how-much-dark-chocolate-should-you-really-be-eating.htm", 
    "contents": "Once in a blue moon I'll hear some positive news on the healthy eating front and dark chocolate has time and time again come out on top. This along with the antioxidants in wine is enough to make you jump for joy. We know that this delectable sweet treat provides a wealth of health benefits, but how ... "
  }, 
  {
    "id": "https://www.openhand.org/blog/hearth-healthy-chocolate-and-flavanols", 
    "contents": "Dark chocolate has been shown to be a good source of heart protective ... Hearth-healthy Chocolate and Flavanols. ... which may confer several heart healthy benefits. "
  }, 
  {
    "id": "https://www.davidwolfe.com/dark-chocolate-health-benefits/", 
    "contents": "When it comes to health, there is a right kind of chocolate, and a wrong kind of chocolate. Dark chocolate is the way to go, but be forewarned: not all dark chocolate is created equal. "
  }, 
  {
    "id": "http://hdcs.fullerton.edu/csa/WholePerson/documents/hearthealthybenefitsofdarkchocolate.pdf", 
    "contents": "Heart Healthy Benefits of Dark Chocolate 1. ... for health. 2. Dark chocolate is generally lower in calories than milk chocolate because of its lower sugar content. 3. "
  }, 
  {
    "id": "https://mesothelioma.net/health-benefits-dark-chocolate-effect-cancer/", 
    "contents": "The natural compounds found in chocolate may provide a lot of helpful benefits for people with mesothelioma and other types of cancer. "
  }, 
  {
    "id": "https://caloriebee.com/nutrition/Chocolates-Top-Seven-Health-Benefits-Of-Dark-Chocolates", 
    "contents": "You feel good when you eat chocolate. Why? Chocolate is made mostly from cocoa beans and sugar. While sugar is not healthy, dark chocolate has numerous health benefits. "
  }, 
  {
    "id": "https://www.quora.com/How-many-grams-of-dark-chocolate-is-recommended-per-day", 
    "contents": "New evidence of dark chocolate’s benefits for a ... of evidence on the benefits of dark chocolate for heart health. ... % dark chocolate is recommended per ... "
  }
]