[
  {
    "id": "https://en.wikipedia.org/wiki/Wind_power", 
    "contents": "Wind power is the use of air flow through wind turbines to mechanically power generators for electricity.Wind power, as an alternative to burning fossil fuels, is plentiful, renewable, widely distributed, clean, produces no greenhouse gas emissions during operation, consumes no water, and uses little land. "
  }, 
  {
    "id": "https://www.energy.gov/eere/wind/how-do-wind-turbines-work", 
    "contents": "Instead of using electricity to make wind, like a fan, wind turbines use wind to make electricity. The wind turns the blades, which spin a shaft, which connects to a generator and makes electricity. "
  }, 
  {
    "id": "https://www.nationalgeographic.com/environment/global-warming/wind-power/", 
    "contents": "Wind power offers a sustainable option in the pursuit of renewable energy. "
  }, 
  {
    "id": "https://images.search.yahoo.com/search/images?p=wind+power", 
    "contents": "More Wind Power images "
  }, 
  {
    "id": "http://windeis.anl.gov/guide/basics/", 
    "contents": "Basic information on wind energy and wind power technology, resources, and issues of concern. "
  }, 
  {
    "id": "https://news.search.yahoo.com/search?p=wind+power&fr2=cosmos", 
    "contents": "More news for Wind Power "
  }, 
  {
    "id": "https://www.nytimes.com/topic/subject/wind-power", 
    "contents": "News about wind power. Commentary and archival information about wind power from The New York Times. "
  }, 
  {
    "id": "https://video.search.yahoo.com/search/video?p=wind+power", 
    "contents": "More Wind Power videos "
  }, 
  {
    "id": "https://www.homepower.com/wind-power", 
    "contents": "Practical articles on home-scale wind power (wind energy, wind turbine) systems including basics, design & installation, equipment & products and projects. "
  }, 
  {
    "id": "https://www.renewableenergyworld.com/wind-power/tech.html", 
    "contents": "Read breaking wind energy news, wind power, wind farm, wind turbine and wind generator information and articles - Renewableenergyworld.com "
  }, 
  {
    "id": "http://www.alternative-energy-news.info/technology/wind-power/", 
    "contents": "Wind Power. Wind power is produced by using wind generators to harness the kinetic energy of wind. It is gaining worldwide popularity as a large scale energy source, although it still only provides less than one percent of global energy consumption. "
  }, 
  {
    "id": "https://www.thewindpower.net/", 
    "contents": "The Wind Power is a comprehensive database of detailed raw statistics on the rapidly growing sphere of wind energy and its supporting markets. It containts data about wind farms, turbines, manufacturers, developers, operators, owners and also pictures and cartographical data "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=qSWm_nprfqE", 
    "contents": "Working of a wind turbine is illustrated in this video with the help of animation. The topic covered are blade design, use of brake, velocity sensor, ... "
  }, 
  {
    "id": "http://www.alternative-energy-news.info/technology/wind-power/", 
    "contents": "Wind Power. Wind power is produced by using wind generators to harness the kinetic energy of wind. It is gaining worldwide popularity as a large scale energy source, although it still only provides less than one percent of global energy consumption. "
  }, 
  {
    "id": "https://www.renewableenergyworld.com/wind-power/tech.html", 
    "contents": "Read breaking wind energy news, wind power, wind farm, wind turbine and wind generator information and articles - Renewableenergyworld.com "
  }, 
  {
    "id": "https://www.wholesalesolar.com/wind-generator-turbines", 
    "contents": "Small wind generators are a great supplement for solar power in areas with strong, steady winds. Be sure to check the start up speed of the wind turbine you want to buy! "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=Wlxz-KzebbQ", 
    "contents": "Hello World’s Ashlee Vance paid a recent visit to Iceland’s capital city of Reykjavik to see the next part of the green energy story. He found a start-up cal... "
  }, 
  {
    "id": "https://www.ge.com/renewableenergy/wind-energy/turbines", 
    "contents": "Wind turbine technology ranges from onshore to offshore turbines. View the wind turbine portfolio of GE, one of the leading suppliers of wind turbines. "
  }, 
  {
    "id": "https://www.motherearthnews.com/renewable-energy/wind-power/home-wind-power-zm0z13amzrob", 
    "contents": "Seeking residential wind power for energy self-sufficiency? Find out whether a home wind turbine is right for you. "
  }, 
  {
    "id": "https://www.thoughtco.com/pros-and-cons-of-wind-power-1204181", 
    "contents": "Wind power: what is it, how does it work, and what are the pros and cons? "
  }, 
  {
    "id": "https://www.thewindpower.net/", 
    "contents": "The Wind Power is a comprehensive database of detailed raw statistics on the rapidly growing sphere of wind energy and its supporting markets. It containts data about wind farms, turbines, manufacturers, developers, operators, owners and also pictures and cartographical data "
  }, 
  {
    "id": "https://www.ebay.com/sch/i.html?_nkw=wind+turbine", 
    "contents": "Find great deals on eBay for wind turbine. Shop with confidence. "
  }, 
  {
    "id": "http://bergey.com/", 
    "contents": "Why Bergey? Bergey Windpower is the oldest and most experienced manufacturer of residential-sized wind turbines in the world. Thirty years ago Bergey pioneered the radically-simple “Bergey design” that has proven to provide the best reliability, performance, service life, and value of all of the hundreds of competitive products that have ... "
  }, 
  {
    "id": "https://windexchange.energy.gov/what-is-wind", 
    "contents": "Wind power or wind energy describes the process by which the wind is used to generate mechanical power or electricity. Wind turbines convert the kinetic energy in the wind into mechanical power. "
  }, 
  {
    "id": "https://www.theguardian.com/environment/windpower", 
    "contents": "Letters: Whatever the WWF says, peak demand for gas-fired generation will be larger, says Steve Bolter, while Chris Underwood pours cold water on the IMechE’s hydrogen proposal "
  }, 
  {
    "id": "https://www.homedepot.com/p/Nature-Power-2000-Watt-Wind-Turbine-Power-Generator-70701/204334614", 
    "contents": "The wind turbine will produce more power up to 2000-Watt at 28 mph. If the wind dies down the turbine will continue to produce power in winds as low as 7 mph. This wind generator is used to charge 12-Volt batteries and mounts on any 1.5 in. Sch. 80 steel pipe. "
  }, 
  {
    "id": "https://www.awea.org/all-about-wind", 
    "contents": "Wind power captures the natural wind in our atmosphere and converts it into mechanical energy then electricity. People started using wind power centuries ago with windmills, which pumped water, ground grain, and did other work. "
  }, 
  {
    "id": "https://www.northerntool.com/shop/tools/category_alternative-renewable-energy+wind-turbines", 
    "contents": "Shop 21 Wind Turbines products at Northern Tool + Equipment "
  }, 
  {
    "id": "https://www.energymatters.com.au/components/wind-energy/", 
    "contents": "Because wind is a source of energy which is non-polluting and renewable, wind turbines create power without using fossil fuels, without producing greenhouse gases or radioactive or toxic waste. Wind turbine installation. Wind turbines can be installed on properties, on boats, or caravans. "
  }, 
  {
    "id": "https://www.britannica.com/science/wind-power", 
    "contents": "Wind power, form of energy conversion in which turbines convert the kinetic energy of wind into mechanical or electrical energy that can be used for power. Wind power is considered a renewable energy source. "
  }, 
  {
    "id": "https://www.walmart.com/c/kp/wind-turbines", 
    "contents": "You are eligible for a full refund if no ShippingPass-eligible orders have been placed.You cannot receive a refund if you have placed a ShippingPass-eligible order.In this case, the Customer Care team will remove your account from auto-renewal to ensure you are not charged for an additional year and you can continue to use the subscription ... "
  }, 
  {
    "id": "https://www.soinc.org/wind-power-c", 
    "contents": "Teams will build a blade assembly that consists of any kind of propeller/pinwheel/rotor attached to a CD which will be used to capture wind power. Students will also be tested on their knowledge relating to alternative energy. "
  }, 
  {
    "id": "https://www.dmme.virginia.gov/DE/WindPower2.shtml", 
    "contents": "Wind power is one of the fastest growing sources of new power generation. Modern wind turbines use moving air currents (wind) to turn rotor blades using the same principles as aircraft wings. The rotation of these blades turns a shaft connected to an electrical generator. "
  }, 
  {
    "id": "https://www.ebay.com/sch/i.html?_nkw=wind+turbine", 
    "contents": "Find great deals on eBay for wind turbine. Shop with confidence. "
  }, 
  {
    "id": "http://factsforkids.net/wind-power-facts-kids/", 
    "contents": "Wind power accounts for more than 30 percent of electricity generation in Denmark and it is the world's leading country to do so. Find out more! "
  }, 
  {
    "id": "https://www.energymatters.com.au/components/wind-energy/", 
    "contents": "A wind turbine involves converting wind energy into electricity by using wind turbines. Learn more about utilizing wind energy to power your home. "
  }, 
  {
    "id": "https://www.dmme.virginia.gov/DE/WindPower2.shtml", 
    "contents": "Wind power is one of the fastest growing sources of new power generation. Modern wind turbines use moving air currents (wind) to turn rotor blades using the same principles as aircraft wings. "
  }, 
  {
    "id": "https://www.sciencedaily.com/terms/wind_power.htm", 
    "contents": "Wind power is the conversion of wind energy into more useful forms, such as electricity, using wind turbines. At the end of 2006, worldwide capacity of wind-powered generators was 73.9 gigawatts; although it currently produces just over 1% of world-wide electricity use, it accounts for approximately 20% of electricity use in Denmark, 9% in ... "
  }, 
  {
    "id": "http://windenergyfoundation.org/wind-at-work/wind-consumers/wind-power-your-home/", 
    "contents": "The Wind Energy Foundation is a nonprofit dedicated to raising public awareness of wind as a clean energy source through communication, research and education. "
  }, 
  {
    "id": "https://www.triplepundit.com/special/energy-options-pros-and-cons/wind-power-pros-cons/", 
    "contents": "When we think of wind power, we generally think of those large high tech towers with slowly spinning blades that have sprung recently up on hilltops in many areas of the country. "
  }, 
  {
    "id": "https://www.amazon.com/Wind-Power-Revised-Renewable-Business/dp/1931498148", 
    "contents": "Wind Power, Revised Edition: Renewable Energy for Home, Farm, and Business [Paul Gipe] on Amazon.com. *FREE* shipping on qualifying offers. In the wake of mass blackouts and energy crises, wind power remains a largely untapped resource of renewable energy. "
  }, 
  {
    "id": "https://www.siemens.com/global/en/home/markets/wind.html", 
    "contents": "Siemens turns wind into an asset. Wind energy solutions along the onshore and offshore value chain help the industry lead the way to a sustainable future. "
  }, 
  {
    "id": "https://www.ucsusa.org/clean-energy/renewable-energy/environmental-impacts-wind-power", 
    "contents": "Wind power generates electricity without toxic pollution or global warming emissions, but it does have some environmental impacts that should be recognized and mitigated. "
  }, 
  {
    "id": "http://www.dictionary.com/browse/wind-power", 
    "contents": "Wind power definition, power derived from wind: used to generate electricity or mechanical power. See more. "
  }, 
  {
    "id": "https://www.renewableenergyworld.com/wind-power.html", 
    "contents": "Read breaking wind power news, wind turbine, wind farm, wind energy and wind generator information and articles - Renewableenergyworld.com "
  }, 
  {
    "id": "https://www.windpowerengineering.com/", 
    "contents": "Windpower Engineering & Development has windpower news, all aspects of wind energy and the issues that make the renewable industry function. "
  }, 
  {
    "id": "https://www.ucsusa.org/clean-energy/renewable-energy/how-wind-energy-works", 
    "contents": "How Wind Energy Works, part of the energy 101 series. Information on renewable energy, including wind and solar power; nuclear-power safety issues and work of the Union of Concerned Scientists to switch America to clean, safe, renewable, and affordable power. "
  }, 
  {
    "id": "https://www.amazon.com/Wind-Power-Revised-Renewable-Business/dp/1931498148", 
    "contents": "Wind Power, Revised Edition: Renewable Energy for Home, Farm, and Business [Paul Gipe] on Amazon.com. *FREE* shipping on qualifying offers. In the wake of mass blackouts and energy crises, wind power remains a largely untapped resource of renewable energy. "
  }, 
  {
    "id": "https://www.sciencedaily.com/terms/wind_power.htm", 
    "contents": "Wind power is the conversion of wind energy into more useful forms, such as electricity, using wind turbines. At the end of 2006, worldwide capacity of wind-powered generators was 73.9 gigawatts; although it currently produces just over 1% of world-wide electricity use, it accounts for approximately 20% of electricity use in Denmark, 9% in ... "
  }, 
  {
    "id": "https://www.windpowermonthly.com/", 
    "contents": "Find news, insight & analysis on wind power companies, policy, technology, O&M & project development on Windpower Monthly "
  }, 
  {
    "id": "http://www.ips.us/industries/wind-power/", 
    "contents": "IPS provides coast to coast wind turbine repair and service, including up-tower and on-site repair, in-shop repairs, generator rewinds, and product sales. "
  }, 
  {
    "id": "https://stateimpact.npr.org/oklahoma/tag/wind-energy/", 
    "contents": "Wind energy is expanding in Oklahoma, especially in western parts of the state. As a resource, Oklahoma’s wind ranks No. 9 in the nation, according to the American Wind Energy Association. Oklahoma has 3,134 megawatts of “installed wind capacity,” AWEA data show. In 2013, 14.8 percent of the ... "
  }, 
  {
    "id": "http://windenergyfoundation.org/what-is-wind-energy/", 
    "contents": "The Wind Energy Foundation is a nonprofit dedicated to raising public awareness of wind as a clean energy source through communication, research and education. "
  }, 
  {
    "id": "https://www.ebay.com/sch/i.html?_nkw=wind+power+generator", 
    "contents": "Find great deals on eBay for wind power generator. Shop with confidence. "
  }, 
  {
    "id": "https://www.magnet4sale.com/green-energy/wind-power/", 
    "contents": "Wind turbine and wind power blades magnet wire and energy savings wide variety of DIY wind power units at CMS Magnetics "
  }, 
  {
    "id": "http://windenergyfoundation.org/what-is-wind-energy/", 
    "contents": "The Wind Energy Foundation is a nonprofit dedicated to raising public awareness of wind as a clean energy source through communication, research and education. "
  }, 
  {
    "id": "https://www.windpowerexpo.org/", 
    "contents": "Exhibit Gain unmatched access to thousands of qualified buyers from every corner of the wind energy industry. A booth gives your company limitless opportunities to increase sales, reach new buyers, close deals, and strengthen your brand. "
  }, 
  {
    "id": "https://www.merriam-webster.com/dictionary/wind%20turbine", 
    "contents": "Other New England states such as Maine, Massachusetts and Rhode Island have access to stiff winds off the Atlantic Ocean that can reliably power wind turbines. — stephen singer, courant.com, \"Connecticut Seeks Boost For New London Port For Wind Turbine Equipment Transit,\" 29 May 2018 "
  }, 
  {
    "id": "http://energy.utah.gov/resource-areas/renewable-energy/resource-profile-wind-energy-utah/", 
    "contents": "Resource Profile: Wind Energy in Utah - Office of Energy | Four of the hundreds of wind turbines at First Wind's 306 MW Milford Wind Farm, in Millard County. "
  }, 
  {
    "id": "http://osceolaenergy.com/wind-power/", 
    "contents": "Is Wind Energy Right for You? A location assessment must be conducted before the integration of wind power; the location of your home or business is key to determining if a wind turbine is the right fit and will function optimally. "
  }, 
  {
    "id": "https://www.britannica.com/technology/wind-turbine", 
    "contents": "Wind turbine: Wind turbine, apparatus used to convert the kinetic energy of wind into electricity. Wind turbines come in several sizes, with small-scale models used for providing electricity to rural homes or cabins and community-scale models used for providing electricity to a small number of homes within a "
  }, 
  {
    "id": "https://www.sciencedaily.com/news/matter_energy/wind_energy/", 
    "contents": "Wind Energy Information. From offshore wind turbines to understanding wind turbulence, learn all about using the wind to our advantage. Also, wind testing buildings. "
  }, 
  {
    "id": "https://www.mass.gov/info-details/wind-turbines", 
    "contents": "Studies, financing, requirements and Technical assistance on siting wind turbines. Brought to you by the Massachusetts Department of Environmental Protection, The Department of Energy Resources, and the Massachusetts Clean Energy Center. August 2015 - Kingston Wind Independence Turbine Acoustical ... "
  }, 
  {
    "id": "http://www.dictionary.com/browse/wind-power", 
    "contents": "Wind power definition, power derived from wind: used to generate electricity or mechanical power. See more. "
  }, 
  {
    "id": "https://www.windpowerengineering.com/", 
    "contents": "Windpower Engineering & Development has windpower news, all aspects of wind energy and the issues that make the renewable industry function. "
  }, 
  {
    "id": "https://cleantechnica.com/world-wind-power/", 
    "contents": "World wind power has been growing fast in recent years. Here's info about wind power and why wind power is so popular. (We also dispel some big wind myths.) "
  }, 
  {
    "id": "https://www.irena.org/documentdownloads/publications/re_technologies_cost_analysis-wind_power.pdf", 
    "contents": "Renewable power generation can help countries meet their sustainable development goals through provision of access to clean, secure, reliable and affordable energy. "
  }, 
  {
    "id": "http://www.dec.ny.gov/energy/40966.html", 
    "contents": "Information about wind energy's development as an important component of New York's clean renewable energy initiative and the state's ability to achieve the RPS described above "
  }, 
  {
    "id": "https://www.scientificamerican.com/article/the-rise-of-wind-power-in-texas/", 
    "contents": "The Rise of Wind Power in Texas. Wind’s competitiveness in the Lone Star State has been helped by the expansion of transmission capacity and market reforms "
  }, 
  {
    "id": "https://whatis.techtarget.com/definition/wind-power", 
    "contents": "Wind power is the kinetic energy of wind, harnessed and redirected to perform a task mechanically or to generate electrical power. Sailing and similar activities are among the simplest, oldest and most direct applications of wind power. "
  }, 
  {
    "id": "http://www.hardysolar.com/wind-turbine/", 
    "contents": "Wind turbines for on and off grid electric systems. Top of the line US made South West Wind Power rock bottom prices "
  }, 
  {
    "id": "http://dnr.wi.gov/topic/Sectors/Wind.html", 
    "contents": "Wind power. The DNR fully supports the siting, development and use of clean and renewable energy facilities based on sound scientific information and in a manner that is sustainable for wildlife and other natural resources. "
  }, 
  {
    "id": "http://store.mwands.com/", 
    "contents": "Missouri Wind and Solar is a US company with a real brick and mortar store. We carry a wide variety of products, including wind turbines for residential and commercial use, solar panels, charge controllers, inverters, PV cable, Trojan batteries, and everything in between! "
  }, 
  {
    "id": "https://cleantechnica.com/world-wind-power/", 
    "contents": "World wind power has been growing fast in recent years. Here's info about wind power and why wind power is so popular. (We also dispel some big wind myths.) "
  }, 
  {
    "id": "http://dnr.wi.gov/topic/Sectors/Wind.html", 
    "contents": "Wind power. The DNR fully supports the siting, development and use of clean and renewable energy facilities based on sound scientific information and in a manner that is sustainable for wildlife and other natural resources. "
  }, 
  {
    "id": "https://whatis.techtarget.com/definition/wind-power", 
    "contents": "Wind power is the kinetic energy of wind, harnessed and redirected to perform a task mechanically or to generate electrical power. Sailing and similar activities are among the simplest, oldest and most direct applications of wind power. "
  }, 
  {
    "id": "http://www.hardysolar.com/wind-turbine/", 
    "contents": "Wind turbines for on and off grid electric systems. Top of the line US made South West Wind Power rock bottom prices "
  }, 
  {
    "id": "http://www.ips.us/industries/wind-power/", 
    "contents": "IPS provides coast to coast wind turbine repair and service, including up-tower and on-site repair, in-shop repairs, generator rewinds, and product sales. "
  }, 
  {
    "id": "http://store.mwands.com/", 
    "contents": "Missouri Wind and Solar is a US company with a real brick and mortar store. We carry a wide variety of products, including wind turbines for residential and commercial use, solar panels, charge controllers, inverters, PV cable, Trojan batteries, and everything in between! "
  }, 
  {
    "id": "https://orsted.com/en/Our-business/Wind-Power", 
    "contents": "Wind farms. We are the global leader in developing and building offshore wind farms. Find out about each location, the number of turbines, and how much energy each farm produces. "
  }, 
  {
    "id": "https://stateimpact.npr.org/oklahoma/tag/wind-energy/", 
    "contents": "Wind energy is expanding in Oklahoma, especially in western parts of the state. As a resource, Oklahoma’s wind ranks No. 9 in the nation, according to the American Wind Energy Association. Oklahoma has 3,134 megawatts of “installed wind capacity,” AWEA data show. In 2013, 14.8 percent of the ... "
  }, 
  {
    "id": "https://www.nrel.gov/wind/", 
    "contents": "NREL innovates to bring wind energy research, development, and deployment to market. "
  }, 
  {
    "id": "http://www.windenergy7.com/", 
    "contents": "WindEnergy7 Home Wind Turbines Kits for home use, Complete Wind Energy and Solar Panel Kits for home use. We are the inventors of the Home Wind and Solar Hybrid Kit with small wind turbine. "
  }, 
  {
    "id": "https://www.homepower.com/articles/wind-power/basics/what-wind-electricity", 
    "contents": "What is Wind Electricity? Wind energy is a dynamic if invisible resource—the energy available in a moving mass of air. From grain grinding by s "
  }, 
  {
    "id": "https://sustainabilityworkshop.autodesk.com/buildings/wind-power", 
    "contents": "Wind power uses wind to push a motor that generates electricity. Generators are usually called \"wind turbines\" but sometimes simply \"windmills.\" Wind power may be useful for locations that have very strong winds and do not have enough sunlight for photovoltaics. "
  }, 
  {
    "id": "https://ppp.worldbank.org/public-private-partnership/wind-power-energy", 
    "contents": "This section introduces laws and regulations in various jurisdictions as well as sample agreements related to wind power projects. "
  }, 
  {
    "id": "https://www.industry.siemens.com/verticals/global/en/wind-turbine/pages/default.aspx", 
    "contents": "Siemens supplies components and solutions for wind turbine systems and in turn secures maximum availability. The ruggedness and first-class quality of our products make them especially ideal for use under harsh ambient conditions. "
  }, 
  {
    "id": "http://www.altenergy.org/renewables/wind/", 
    "contents": "With today's technology, wind energy could provide 20% of America's electricity (or about the amount nuclear power provides) with turbines installed on less than 1% of its land area. "
  }, 
  {
    "id": "https://www.raeng.org.uk/publications/other/23-wind-turbine", 
    "contents": "Wind Turbine Power Calculations RWE npower renewables Mechanical and Electrical Engineering Power Industry INTRODUCTION RWE npower is a leading integrated UK energy "
  }, 
  {
    "id": "http://energy.utah.gov/resource-areas/renewable-energy/resource-profile-wind-energy-utah/", 
    "contents": "Resource Profile: Wind Energy in Utah - Office of Energy | Four of the hundreds of wind turbines at First Wind's 306 MW Milford Wind Farm, in Millard County. "
  }, 
  {
    "id": "http://www.atlantissolar.com/wind.html", 
    "contents": "wind turbine, Atlantis Wind Turbine, solar energy, green power, solar hot water, turbine energy, free energy, solar light, solar lights, solar street lights, solar airconditioner, solar ac, solar energy, solar power, solar heat, wind mills, carnot, air conditioner, ac, solar commercial lights, solar commercial lighting, commercial lighting, wind. "
  }, 
  {
    "id": "https://www.engineeringtoolbox.com/wind-power-d_1214.html", 
    "contents": "Generated Wind Energy. The energy generated over time depends on the wind mill potential power generation (as indicated above) - and how often, or how many hours the wind blows - or more scientifically - the \"wind speed frequency distribution\" at the actual location. "
  }, 
  {
    "id": "https://www.bluepacificsolar.com/hybrid-solar-wind.html", 
    "contents": "Remote Hybrid Solar Wind Power Kits. These engineered system uses advanced power electronics for small off-grid do-it-yourself (DIY) applications. "
  }, 
  {
    "id": "http://windenergy.wikia.com/wiki/Wind_turbine", 
    "contents": "A wind turbine is a rotating machine which converts the kinetic energy in wind into mechanical energy. If the mechanical energy is used directly by machinery, such as a pump or grinding stones, the machine is usually called a windmill. "
  }, 
  {
    "id": "http://www.windustry.org/pros_cons_wind_energy", 
    "contents": "Well – In the US, wind energy is highly subsidized. Contrary to what is written, nuclear and coal plants are not subsidized. I like wind turbines, but they won’t be enough on their own. "
  }, 
  {
    "id": "http://www.alliantenergykids.com/EnergyandTheEnvironment/RenewableEnergy/022397", 
    "contents": "Using the wind to create electricity has been around for a long time, you've probably seen windmills on farms. When the wind turns the blades of a windmill, it spins a turbine inside a small generator to produce electricity, just like a big coal power plant. "
  }, 
  {
    "id": "https://simple.wikipedia.org/wiki/Wind_power", 
    "contents": "Wind power is the conversion of the energy in wind into a more useful form of energy, like electricity. It is a renewable source of energy that helps to cut down on the pollution of earth's air. "
  }, 
  {
    "id": "http://www.newsweek.com/whats-true-cost-wind-power-321480", 
    "contents": "Financial advisory firm Lazard puts the cost of generating a megawatt-hour of electricity from wind at a range of $37 to $81. In reality, the true price tag is significantly higher. "
  }, 
  {
    "id": "https://www.theguardian.com/environment/2008/oct/17/wind-power-renewable-energy", 
    "contents": "For centuries, people have harnessed the wind's energy for electricity. But how did it develop into a clean, abundant and free solution to tackling global warming? "
  }, 
  {
    "id": "https://windexchange.energy.gov/maps-data/321", 
    "contents": "Share this resource. Share U.S. Installed and Potential Wind Power Capacity and Generation on Email ; Share U.S. Installed and Potential Wind Power Capacity and Generation on Facebook "
  }
]