[
  {
    "id": "https://www.imdb.com/title/tt0095953/", 
    "contents": "Directed by Barry Levinson. With Dustin Hoffman, Tom Cruise, Valeria Golino, Gerald R. Molen. Selfish yuppie Charlie Babbitt's father left a fortune to his savant brother Raymond and a pittance to Charlie; they travel cross-country. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Rain_Man", 
    "contents": "Rain Man is a 1988 American road comedy-drama film directed by Barry Levinson and written by Barry Morrow and Ronald Bass.It tells the story of an abrasive, selfish young wheeler-dealer Charlie Babbitt (), who discovers that his estranged father has died and bequeathed all of his multimillion-dollar estate to his other son, Raymond (Dustin ... "
  }, 
  {
    "id": "https://video.search.yahoo.com/search/video?p=rain+man", 
    "contents": "More Rain Man videos "
  }, 
  {
    "id": "https://www.rottentomatoes.com/m/rain_man/", 
    "contents": "I must have been about ten or eleven when Rain Man was released and I remember enough about this time that it was seemingly heralded as a modern classic. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=mlNwXuHUA8I", 
    "contents": "Rain Man Official Trailer #1 - Tom Cruise, Dustin Hoffman Movie (1988) HD Selfish yuppie Charlie Babbitt's father left a fortune to his savant brother ... "
  }, 
  {
    "id": "https://images.search.yahoo.com/search/images?p=rain+man", 
    "contents": "More Rain Man images "
  }, 
  {
    "id": "https://www.amazon.com/Rain-Man-Dustin-Hoffman/dp/0792833260", 
    "contents": "Product description. Rain Man is the kind of touching drama that Oscars are made for--and, sure enough, the film took Academy honors for best picture, director, screenplay, and actor (Dustin Hoffman) in 1988. "
  }, 
  {
    "id": "https://www.rogerebert.com/reviews/rain-man-1988", 
    "contents": "Is it possible to have a relationship with an autistic person? Is it possible to have a relationshbip with a cat? I do not intend the comparison to be demeaning to the autistic; I am simply trying to get at something. "
  }, 
  {
    "id": "https://www.netflix.com/pm-en/title/60029369", 
    "contents": "A fast-talking yuppie is forced to slow down when he meets the brother he never knew he had, an unusually gifted autistic savant named Raymond. Watch trailers & learn more. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=RW1qHA5Hqwc", 
    "contents": "Rain Man 16 December 1988 Director: Barry Levinson Cast: Dustin Hoffman Tom Cruise Valeria Golino Music: Hans Zimmer - Vegas/End Credits "
  }, 
  {
    "id": "https://www.commonsensemedia.org/movie-reviews/rain-man", 
    "contents": "Drama about autistic savant has profanity, mature themes. Read Common Sense Media's Rain Man review, age rating, and parents guide. "
  }, 
  {
    "id": "https://www.theguardian.com/world/2009/dec/22/kim-peek-rain-man-dies", 
    "contents": "Kim Peek stands on the steps at the Salt Lake City Library in Salt Lake City. Photograph: Barton Glasser/AP Kim Peek, the real Rain Man whose almost unimaginable powers of memory were coupled with severe disabilities and who inspired the Oscar-winning film role played by Dustin Hoffman, has died of ... "
  }, 
  {
    "id": "https://www.netflix.com/pm-en/title/60029369", 
    "contents": "A fast-talking yuppie is forced to slow down when he meets the brother he never knew he had, an unusually gifted autistic savant named Raymond. Watch trailers & learn more. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Rain_Man", 
    "contents": "Rain Man is a 1988 American road comedy-drama film directed by Barry Levinson and written by Barry Morrow and Ronald Bass.It tells the story of an abrasive, selfish young wheeler-dealer Charlie Babbitt (), who discovers that his estranged father has died and bequeathed all of his multimillion-dollar estate to his other son, Raymond (Dustin ... "
  }, 
  {
    "id": "https://www.commonsensemedia.org/movie-reviews/rain-man", 
    "contents": "Drama about autistic savant has profanity, mature themes. Read Common Sense Media's Rain Man review, age rating, and parents guide. "
  }, 
  {
    "id": "https://www.facebook.com/RainManMovie/", 
    "contents": "Behind the scenes: At the start of filming Rain Man, Dustin Hoffman was unsure of his own performance. He eventually won his second Academy Award for Best Actor. "
  }, 
  {
    "id": "https://onmovies.to/film/nY/Rain-Man", 
    "contents": "Rain Man is a psychological drama from director Barry Levinson USA. Aired in 1988, the film tells the story of Charlie Babbit, a selfish young man, narrow-minded and ha "
  }, 
  {
    "id": "https://www.urbandictionary.com/define.php?term=Rain%20Man", 
    "contents": "Alias for an individual of exceptional intelligence whose mental capacity far surpasses average joe or even fucking intelligent joe. Derived from Dustin Hoffman's depiction of Kim Peek in the 1988 film of the same title. "
  }, 
  {
    "id": "https://www.goodreads.com/book/show/237364.Rain_Man", 
    "contents": "Rain Man has 4,428 ratings and 60 reviews. Ahmad said: Rain man : a novel, Leonore FleischerCharlie Bebbitt thinks he will get a lot of money when his f... "
  }, 
  {
    "id": "https://www.rogerebert.com/reviews/rain-man-1988", 
    "contents": "\"Rain Man\" works so well within Raymond's limitations because it is a movie about limitations, particularly Charlie's own limited ability to love those in his life, or to see things from their point of view. "
  }, 
  {
    "id": "https://www.wisconsinmedicalsociety.org/professional/savant-syndrome/resources/articles/rain-man-the-movie-rain-man-real-life/", 
    "contents": "Raymond Babbitt, the main character in the movie Rain Man, has become the world’s best known savant due to Dustin Hoffman’s remarkably accurate and sensitive portrayal of Savant Syndrome in that film. That 1988 movie, in its first 101 days, accomplished more toward bringing Savant Syndrome to ... "
  }, 
  {
    "id": "https://ffilms.org/rain-man-1988/", 
    "contents": "Watch Full movie Rain Man (1988) Online Free.Selfish yuppie Charlie Babbitt's father left a fortune to his savant brother Raymond and a pittance to Charlie; they travel cross-country "
  }, 
  {
    "id": "https://www.britannica.com/topic/Rain-Man", 
    "contents": "Rain Man: Rain Man, American film (1988) starring Tom Cruise and Dustin Hoffman that won four Oscars. "
  }, 
  {
    "id": "https://www.goodreads.com/book/show/237364.Rain_Man", 
    "contents": "Rain Man has 4,428 ratings and 60 reviews. Ahmad said: Rain man : a novel, Leonore FleischerCharlie Bebbitt thinks he will get a lot of money when his f... "
  }, 
  {
    "id": "https://www.ebay.com/sch/i.html?_nkw=rain+man+dvd", 
    "contents": "Find great deals on eBay for rain man dvd. Shop with confidence. "
  }, 
  {
    "id": "https://dvd.netflix.com/Movie/Rain-Man/60029369", 
    "contents": "Rent Rain Man (1988) and other Movies & TV Shows on Blu-ray & DVD. 1-month free trial! Fast, free delivery. No late fees. "
  }, 
  {
    "id": "https://itunes.apple.com/us/movie/rain-man/id303821283", 
    "contents": "Watch trailers, read customer and critic reviews, and buy Rain Man directed by Barry Levinson for $14.99. "
  }, 
  {
    "id": "http://www.tvguide.com/movies/rain-man/127175", 
    "contents": "Watch Rain Man movie trailer and get the latest cast info, photos, movie review and more on TVGuide.com. "
  }, 
  {
    "id": "https://genius.com/Eminem-rain-man-lyrics", 
    "contents": "Rain Man Lyrics: Yeah / Definitely, definitely / Definitely dope / Definitely / Definitely K-Mart / Yeah, yeah / You find me offensive / I find you offensive for finding me offensive / Hence, if I "
  }, 
  {
    "id": "https://lol.gamepedia.com/The_Rain_Man", 
    "contents": "Christian \"The Rain Man\" Kahmann is a Twitch.tv streamer and YouTube content creator.He was the top laner for Team SoloMid between April 2011 and March 2012, being succeeded by Dyrus. "
  }, 
  {
    "id": "https://m.imdb.com/title/tt0095953/", 
    "contents": "Selfish yuppie Charlie Babbitt's father left a fortune to his savant brother Raymond and a pittance to Charlie; they travel cross-country. "
  }, 
  {
    "id": "http://www.dailymail.co.uk/tvshowbiz/article-1238386/Did-Dustin-Hoffman-exploit-rainman-After-death-week-father-makes-startling-accusation.html", 
    "contents": "A genius who knew 12,000 books by heart but didn't know how to dress himself, his incredible story inspired Rain Man - the role that made Dustin Hoffman millions. "
  }, 
  {
    "id": "https://m.imdb.com/title/tt0095953/", 
    "contents": "Selfish yuppie Charlie Babbitt's father left a fortune to his savant brother Raymond and a pittance to Charlie; they travel cross-country. "
  }, 
  {
    "id": "https://www.directv.com/movies/Rain-Man-VnIvY2gyNXY3RDUzajBHY3lQZkRHdz09", 
    "contents": "Watch Rain Man starring Dustin Hoffman in this Comedy on DIRECTV. It's available to watch on TV. "
  }, 
  {
    "id": "https://twitter.com/RainManLoL", 
    "contents": "The latest Tweets from The Rain Man (@RainManLoL). https://t.co/lq5qC1iwMk. Las Vegas, NV "
  }, 
  {
    "id": "https://movietoken.to/rain-man/", 
    "contents": "Watch free movies online in HD without registration or downloading on movietoken.to "
  }, 
  {
    "id": "http://www.metacritic.com/movie/rain-man", 
    "contents": "Rain Man movie reviews & Metacritic score: What begins with a cold-hearted attempt by one man to steal his autistic brother's inheritance evolves into a cros... "
  }, 
  {
    "id": "https://www.rottentomatoes.com/m/rain_man/quotes/", 
    "contents": "The Tomatometer score — based on the opinions of hundreds of film and television critics — is a trusted measurement of critical recommendation for millions of fans. "
  }, 
  {
    "id": "https://en.wiktionary.org/wiki/rain_man", 
    "contents": "From the 1988 film Rain Man, about an autistic man with the name Raymond, misinterpreted as “Rain man” by his brother in the childhood. Lovingly dubbed the Rain Man of Weed by her family, Heylia James is legendary in West Adams for being able to \"eyeball an ounce from outer space with her ... "
  }, 
  {
    "id": "http://quotegeek.com/quotes-from-movies/rain-man/", 
    "contents": "captivating quotations from movies, television, literature and people - curated by actual geeks. "
  }, 
  {
    "id": "http://www.metrolyrics.com/rain-man-lyrics-eminem.html", 
    "contents": "Lyrics to 'Rain Man' by Eminem. Yeah / (Definitely, definitely, definitely, dope, definitely, definitely K-mart) / Yeah, yeah / You find me offensive, I find "
  }, 
  {
    "id": "https://www.psychologytoday.com/us/blog/the-superhuman-mind/201303/the-brain-the-real-rain-man", 
    "contents": "The Brain Of The Real Rain Man New insights into the mechanism underlying extreme memory abilities. Posted Mar 17, 2013 "
  }, 
  {
    "id": "https://en.wikiquote.org/wiki/Rain_Man", 
    "contents": "Rain Man is a 1988 film about abrasive Charlie Babbitt, who discovers that his father has left all of his estate to an autistic savant brother, Raymond.. Directed by Barry Levinson. "
  }, 
  {
    "id": "http://www.movies.com/rain-man/m13172", 
    "contents": "Read the Rain Man movie synopsis, view the movie trailer, get cast and crew information, see movie photos, and more on Movies.com. "
  }, 
  {
    "id": "http://krewella.wikia.com/wiki/Rain_Man", 
    "contents": "Kris Trindl (born Dec 16th, 1987) better known by his stage name \"Rain Man\", is an American electronic dance music producer and former member of Krewella from Chicago, Illinois. "
  }, 
  {
    "id": "https://www.facebook.com/RainManLoL", 
    "contents": "The Rain Man. 62K likes. Hey dudes im The Rain Man. I do daily League of Legends streams at twitch.tv/therainman. "
  }, 
  {
    "id": "https://yesmovies.to/movie/rain-man-2434.html", 
    "contents": "Rain Man Charlie Babbit, a car dealer, is very surprising when his father suddenly dies and left most of his fortune to Raymond, his unknown mental-ill brother. "
  }, 
  {
    "id": "http://www.tv.com/shows/the-red-green-show/rain-man-583969/", 
    "contents": "Watch The Red Green Show - Season 15, Episode 16 - Rain Man: The Possum Lodge area is in the middle of a severe drought and Red resolves to try and make it rain using knowledge from... "
  }, 
  {
    "id": "https://www.walmart.com/ip/Rain-Man/2515393", 
    "contents": "Free 2-day shipping on qualified orders over $35. Buy Rain Man at Walmart.com "
  }, 
  {
    "id": "http://www.interactingwithautism.com/section/understanding/media/representations/details/38", 
    "contents": "Email Address. In the field below enter the email address where you received the invitation letter. Set & Continue "
  }, 
  {
    "id": "https://schoolworkhelper.net/rain-man-the-movie-analysis/", 
    "contents": "What conditions does Raymond suffer from? According to the movie Raymond is an autistic savant. Though somewhat mild, his autism has led to impaired social "
  }, 
  {
    "id": "https://www.twitch.tv/therainman", 
    "contents": "The Rain Man - Twitch "
  }, 
  {
    "id": "http://variety.com/1988/film/reviews/rain-man-2-1200427714/", 
    "contents": "One of the year's most intriguing film premises - a callow young hustler (Tom Cruise) must gain the confidence of his autistic brother (Dustin Hoffman) in order to pry away from him an enormous inheritance - is given uneven, slightly off-target treatment in UA's \"Rain Man.\" "
  }, 
  {
    "id": "https://guides.gamercorner.net/ffvi/monsters/rain-man", 
    "contents": "The monster statistics, drops, weaknesses and resistances, encounter locations, and spell and ability lists of Rain Man in Final Fantasy VI (FF3, FFIII, SNES, Super NES, FF6, FFVI, Anthology, PlayStation, PS, PS1, PSX) "
  }, 
  {
    "id": "http://eminem.wikia.com/wiki/Rain_Man", 
    "contents": "Rain Man is an Eminem song which appeared on his fifth album Encore. "
  }, 
  {
    "id": "http://www.netflix.com/search/Rain%20Man", 
    "contents": "Watch Netflix movies & TV shows online or stream right to your smart TV, game console, PC, Mac, mobile, tablet and more. "
  }, 
  {
    "id": "http://www.worldcat.org/title/rain-man/oclc/43428389", 
    "contents": "Get this from a library! Rain man. [Barry Morrow; Ronald Bass; Mark Johnson; Barry Levinson; Dustin Hoffman; Tom Cruise; Valeria Golino; John Seale; Stu Linder; Hans Zimmer; United Artists Corporation.; "
  }, 
  {
    "id": "http://dramatica.com/analysis/rain-man", 
    "contents": "The following analysis reveals a comprehensive look at the Storyform for Rain Man.Unlike most of the analysis found here—which simply lists the unique individual story appreciations—this in-depth study details the actual encoding for each structural item. "
  }, 
  {
    "id": "http://www.tvguide.com/movies/rain-man/tv-listings/127175/", 
    "contents": "Find out when and where you can watch Rain Man on tv with the full listings schedule at TVGuide.com. "
  }, 
  {
    "id": "http://www.widescreenings.com/rainman.html", 
    "contents": "Review of Rain Man, Oscar-winning film of Tom Cruise and Dustin Hoffman as Charlie and Raymond Babbitt, directed by Barry Levinson, based on the life of Kim Peek, in which a desperate hotshot car salesman kidnaps his autistic brother from Cincinnati's Wallbrook institution and drives to Los Angeles, stopping in Las Vegas to count cards, to ... "
  }, 
  {
    "id": "https://genius.com/artists/Rain-man", 
    "contents": "Get all the lyrics to songs by Rain Man and join the Genius community of music scholars to learn the meaning behind the lyrics. "
  }, 
  {
    "id": "http://www.great-quotes.com/quotes/movie/Rain+Man", 
    "contents": "171 quotes - Additionally, Great-Quotes has more than 2.5 million other easily searchable movie, proberbs, sayings and famous quotes. We have also selectively chosen a large collection of Inspirational, Life, Motivationa, Friendship, Graduation and Funny Quotes to help motivate and brighten your ... "
  }, 
  {
    "id": "http://www.tvguide.com/movies/rain-man/127175", 
    "contents": "Watch Rain Man movie trailer and get the latest cast info, photos, movie review and more on TVGuide.com. "
  }, 
  {
    "id": "https://yesmovies.to/movie/rain-man-2434.html", 
    "contents": "Rain Man Charlie Babbit, a car dealer, is very surprising when his father suddenly dies and left most of his fortune to Raymond, his unknown mental-ill brother. "
  }, 
  {
    "id": "http://tvtropes.org/pmwiki/pmwiki.php/Main/TheRainman", 
    "contents": "The Rain Man trope as used in popular culture. The Rainman has a Disability Superpower. Karmic law dictates that every mental birth defect has a compensating … "
  }, 
  {
    "id": "https://www.what-song.com/Movies/Soundtrack/220/Rain-Man", 
    "contents": "Rain Man Soundtrack, find all 25 songs from the Rain Man (1988) movie music soundtrack, with scene descriptions. Listen to and download the music, ost, score, list of songs and trailers. "
  }, 
  {
    "id": "https://www.directv.com/movies/Rain-Man-VnIvY2gyNXY3RDUzajBHY3lQZkRHdz09", 
    "contents": "Watch Rain Man starring Dustin Hoffman in this Comedy on DIRECTV. It's available to watch on TV. "
  }, 
  {
    "id": "http://www.metacritic.com/movie/rain-man/critic-reviews", 
    "contents": "Read what all the top critics had to say about Rain Man at Metacritic.com "
  }, 
  {
    "id": "https://www.themoviedb.org/movie/380-rain-man", 
    "contents": "My main man Charlie Babbitt. It is something of a great cinematic achievement that Rain Man became the great film it clearly is because the story surrounding it is interestingly Hollywood in itself. "
  }, 
  {
    "id": "https://m.youtube.com/playlist?list=PLiMxmCUQ9pVOQfn9tt8KrS9toA_H5j3Dn", 
    "contents": "Sign in now to see your channels and recommendations! Sign in. Watch Queue Queue "
  }, 
  {
    "id": "http://putlocker.co/watch-rain-man-online-free-putlocker.html", 
    "contents": "Watch Rain Man (1988) Online Free Full Movie Putlocker. Charles Sanford 'Charlie' Babbit is a self-centered Los Angeles-based automobile dealer/hustler/bookie who is at war with his own life. "
  }, 
  {
    "id": "http://autismmythbusters.com/general-public/home/portrayals-in-the-media/", 
    "contents": "Rain Man- Dustin Hoffman portraying autistic Raymond Babbitt For many people, one of the first things they think of when they hear the word "
  }, 
  {
    "id": "http://articles.latimes.com/keyword/rain-man", 
    "contents": "Rain Man News. Find breaking news, commentary, and archival information about Rain Man From The latimes "
  }, 
  {
    "id": "http://medhum.med.nyu.edu/view/10124", 
    "contents": "Dustin Hoffman and Barry Levinson won Academy Awards for Rain Man and the film won the Academy Award for best picture. "
  }, 
  {
    "id": "https://www.yidio.com/movie/rain-man/10634", 
    "contents": "Watch Rain Man Online. Rain Man the 1988 Movie Reviews, Trailers, Videos and more at Yidio. "
  }, 
  {
    "id": "http://autismmythbusters.com/general-public/home/portrayals-in-the-media/", 
    "contents": "Rain Man- Dustin Hoffman portraying autistic Raymond Babbitt For many people, one of the first things they think of when they hear the word "
  }, 
  {
    "id": "http://www.blu-ray.com/movies/Rain-Man-Blu-ray/18961/", 
    "contents": "Rain Man Blu-ray (1988): Starring Dustin Hoffman, Tom Cruise and Valeria Golino. Self-centred car exporter Charlie Babbitt attends his estranged father's funeral to collect his inheritance. "
  }, 
  {
    "id": "http://www.bookrags.com/Rain_Man/", 
    "contents": "Immediately download the Rain Man summary, chapter-by-chapter analysis, book notes, essays, quotes, character descriptions, lesson plans, and more - everything you need for studying or teaching Rain Man. "
  }, 
  {
    "id": "https://www.justwatch.com/us/movie/rain-man#!", 
    "contents": "Is Netflix, Amazon, Hulu, Crackle, iTunes, etc. streaming Rain Man? Find out where to watch movies online now! "
  }, 
  {
    "id": "https://twitter.com/the_rain_man", 
    "contents": "48.3K tweets • 402 photos/videos • 10.5K followers. \"La democrazia è quella cosa dove se ci sono 99 analfabeti e una persona colta vincerà sempre l'ignoranza\" "
  }, 
  {
    "id": "http://spiritspeakstruths.blogspot.com/2009/11/rain-man-in-music.html", 
    "contents": "“Rain Man” defined. Rain (noun) water that has fallen as rain, rain water, a heavy fall, descent of this water.(Verb) to send down rain, to fall as drops of water from clouds, to give or administer abundantly etc.. "
  }, 
  {
    "id": "https://www.songkick.com/artists/8453823-rain-man", 
    "contents": "Find out when Rain Man is next playing live near you. List of all Rain Man tour dates and concerts. "
  }, 
  {
    "id": "https://www.allmovie.com/movie/rain-man-v40134", 
    "contents": "Find trailers, reviews, synopsis, awards and cast information for Rain Man (1988) - Barry Levinson on AllMovie - Self-centered, avaricious Californian Charlie… "
  }, 
  {
    "id": "http://www.boxofficemojo.com/movies/?id=rainman.htm", 
    "contents": "Rain Man summary of box office results, charts and release information and related links. "
  }, 
  {
    "id": "http://creepypasta.wikia.com/wiki/The_rain_man", 
    "contents": "A dark rainy street, common for the Rain Man to show up here. Growing up your entire life, you have undoubtedly heard the line \"It was a dark and stormy night...\" "
  }, 
  {
    "id": "http://www.atgtickets.com/shows/rain-man/theatre-royal-brighton/", 
    "contents": "Buy here direct from the theatre for the best choice of seats. Rain Man Tickets from £13.90 "
  }, 
  {
    "id": "https://www.moviefone.com/movie/rain-man/16742/main/", 
    "contents": "Rain Man - When car dealer Charlie Babbitt (Tom Cruise) learns that his estranged father has died, he returns home to Cincinnati, where he discovers... "
  }, 
  {
    "id": "http://www.lyricsfreak.com/e/eminem/rain+man_10105643.html", 
    "contents": "Lyrics to Rain Man by Eminem: [Dre (Em)] / Yeah / Definitely, definitely, definitely, dope / Definitely, definitely K-mart *fart* / Yeah, "
  }, 
  {
    "id": "https://www.the-numbers.com/movie/Rain-Man", 
    "contents": "Financial analysis of Rain Man (1988) including budget, domestic and international box office gross, DVD and Blu-ray sales reports, total earnings and profitability. "
  }, 
  {
    "id": "https://dvd.netflix.com/Search?v1=rain+man", 
    "contents": "Search. Sign Up. Sign In; How It Works; Start Your Free Month; GENRES; New Releases; Netflix Top 100; ... Results for 'rain man' Get Help Help Center; Questions? Call ... "
  }, 
  {
    "id": "https://www.verywellhealth.com/the-rain-mans-disorder-savant-syndrome-2860421", 
    "contents": "Savant syndrome, a disorder popularized in the movie \"Rain Man\" is characterized by remarkable memory skills paired with developmental deficits. "
  }, 
  {
    "id": "https://mubi.com/films/rain-man", 
    "contents": "Angry that his inheritance has gone to an autistic brother he never knew he had, a self-involved workaholic attempts to swindle it away from him. Instead, he learns a thing or two about love and compassion. "
  }, 
  {
    "id": "http://www.blu-ray.com/movies/Rain-Man-Blu-ray/18961/", 
    "contents": "Rain Man Blu-ray (1988): Starring Dustin Hoffman, Tom Cruise and Valeria Golino. Self-centred car exporter Charlie Babbitt attends his estranged father's funeral to collect his inheritance. "
  }, 
  {
    "id": "http://grantland.com/hollywood-prospectus/remembering-rain-man-the-350-million-movie-that-hollywood-wouldnt-touch-today/", 
    "contents": "That’s producer Mark Johnson on Rain Man, his sixth collaboration with writer-director Barry Levinson. But Johnson wasn’t quite right. Twenty-five years ago, Rain Man — a talky drama about two very different brothers on a road trip — won the Academy Award for Best Picture and soon became the ... "
  }, 
  {
    "id": "http://medhum.med.nyu.edu/view/10124", 
    "contents": "Dustin Hoffman and Barry Levinson won Academy Awards for Rain Man and the film won the Academy Award for best picture. "
  }, 
  {
    "id": "http://articles.latimes.com/keyword/rain-man", 
    "contents": "Rain Man News. Find breaking news, commentary, and archival information about Rain Man From The latimes "
  }, 
  {
    "id": "http://www.worldcat.org/title/rain-man/oclc/43428389", 
    "contents": "Get this from a library! Rain man. [Barry Morrow; Ronald Bass; Mark Johnson; Barry Levinson; Dustin Hoffman; Tom Cruise; Valeria Golino; John Seale; Stu Linder; Hans Zimmer; United Artists Corporation.; "
  }, 
  {
    "id": "https://mikeaponte.com/entertainment/the-truth-about-rain-man/", 
    "contents": "The movie Rainman provided me with my first glimpse into the world of card counting. In Rain Man, Tom Cruise plays the slick, self-centered Charlie Babbit. Dustin Hoffman steals the show as Charlie’s autistic savant brother, Raymond Babbit. "
  }, 
  {
    "id": "http://www.funtrivia.com/en/Movies/Rain-Man-5403.html", 
    "contents": "53 questions and answers about 'Rain Man' in our 'Movies Q-T' category. Did you know these fun facts and interesting bits of information? "
  }, 
  {
    "id": "https://www.allmovie.com/movie/rain-man-v40134", 
    "contents": "Find trailers, reviews, synopsis, awards and cast information for Rain Man (1988) - Barry Levinson on AllMovie - Self-centered, avaricious Californian Charlie… "
  }
]