[
  {
    "id": "https://search.yahoo.com/local/s?p=land+surveyor&addr=Palo+Alto%2C+CA+94306&loc=woeid%3A12797284", 
    "contents": ""
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Surveying", 
    "contents": "Surveying or land surveying is the technique, profession, and science of determining the terrestrial or three-dimensional positions of points and the distances and angles between them. "
  }, 
  {
    "id": "https://www.homeadvisor.com/cost/architects-and-engineers/hire-a-land-surveyor/", 
    "contents": "How Much Does a Land Survey Cost? Homeowners report that the average land survey cost is $502.This is included in the cost to hire a land surveyor, which ranges from $337 and $669. "
  }, 
  {
    "id": "https://images.search.yahoo.com/search/images?p=land+surveyor", 
    "contents": "More Land Surveyor images "
  }, 
  {
    "id": "https://www.bls.gov/ooh/architecture-and-engineering/surveyors.htm", 
    "contents": "Surveyors make precise measurements to determine property boundaries. They provide data relevant to the shape and contour of the Earth’s surface for engineering, mapmaking, and construction projects. "
  }, 
  {
    "id": "http://www.landsurveyors.com/", 
    "contents": "Land Surveyors Website Featuring a Land Surveyor Directory. Comprehensive Resources About Land Surveys and Surveying Education, Jobs, Tools and More. "
  }, 
  {
    "id": "https://www.thumbtack.com/k/land-surveyors/near-me/", 
    "contents": "Here is the definitive list of land surveyors near your location as rated by your neighborhood community. Want to see who made the cut? "
  }, 
  {
    "id": "http://www.bpelsg.ca.gov/", 
    "contents": "The Board regulates the practices of engineering and land surveying in the state of California by evaluating the experience and administering examinations to prospective licensees and by enforcing the laws regulating licensed professional engineers and land surveyors. "
  }, 
  {
    "id": "http://www.flsurveys.com/", 
    "contents": "A leading San Francisco Bay Area Land Surveying firm. Specializing in ALTA, Boundary, Topographic, Site Surveys, Condominium Conversions, Subdivisions, Responsive, Experienced, Affordable "
  }, 
  {
    "id": "https://www.thumbtack.com/ca/san-francisco/land-surveyors/", 
    "contents": "Here is the definitive list of San Francisco's land surveyors as rated by the San Francisco, CA community. Want to see who made the cut? "
  }, 
  {
    "id": "https://porch.com/lafayette-ca/surveyors/cp", 
    "contents": "The most trusted surveyors in Lafayette, CA are on Porch. See costs, photos, licenses and reviews from friends and neighbors. Get the best info on local professional land surveying companies. "
  }, 
  {
    "id": "https://www.homeadvisor.com/tloc/San-Francisco-CA/Land-Surveyor/", 
    "contents": "Hire the Best Land Surveyors in San Francisco, CA on HomeAdvisor. Compare Homeowner Reviews from Top San Francisco Land Surveyor services. Get Quotes & Book Instantly. "
  }, 
  {
    "id": "https://www.monster.com/jobs/q-land-surveyor-jobs.aspx", 
    "contents": "Search for Land Surveyor jobs at Monster. Browse our collection of Land Surveyor job listings, including openings in full time and part time. "
  }, 
  {
    "id": "https://www.alifewithoutlimits.com.au/about-surveying/", 
    "contents": "What is a Land Surveyor; find out what Surveying is all about and what it's like to be in the Surveying industry "
  }, 
  {
    "id": "https://www.glassdoor.com/Salaries/land-surveyor-salary-SRCH_KO0,13.htm", 
    "contents": "89 Land Surveyor Salaries provided anonymously by employees. What salary does a Land Surveyor earn in your area? "
  }, 
  {
    "id": "https://www.indeed.com/q-Land-Surveyor-jobs.html", 
    "contents": "1,620 Land Surveyor jobs available on Indeed.com. Land Surveyor, Survey Engineer, Surveyor and more! "
  }, 
  {
    "id": "https://www.simplyhired.com/search?q=land+surveyor", 
    "contents": "1512 Land Surveyor jobs available. See salaries, compare reviews, easily apply, and get hired. New Land Surveyor careers are added daily on SimplyHired.com. The low-stress way to find your next Land Surveyor job opportunity is on Simply Hired. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=V_X3dqDRXhM", 
    "contents": "McElhanney Land Surveys Ltd. recruitment, career, and employment video about careers in Canadian Land Surveying. Rocky Mountain movie footage shot outside Br... "
  }, 
  {
    "id": "https://www.michigan.gov/documents/LandSurveyor_12761_7.pdf", 
    "contents": "MICHIGAN CIVIL SERVICE COMMISSION JOB SPECIFICATION LAND SURVEYOR JOB DESCRIPTION Employees in this job complete and oversee a variety of professional assignments to ... "
  }, 
  {
    "id": "https://www.payscale.com/research/US/Job=Land_Surveyor/Hourly_Rate", 
    "contents": "As of Jun 2018, the average pay for a Land Surveyor is $19.53 /hr or $61,021 annually. "
  }, 
  {
    "id": "https://www.merriam-webster.com/dictionary/surveyor", 
    "contents": "—sarah meehan, baltimoresun.com, \"How surveyors track high water marks throughout Maryland after flooding — and what that data is used for,\" 31 May 2018 "
  }, 
  {
    "id": "http://www.in.gov/pla/surveyor.htm", 
    "contents": "For State Specific Exam: completed applications must be postmarked two weeks prior to the scheduled quarterly state exam. The state exam occurs on the same day as the scheduled Board meeting. Please see the posted meeting dates for the next available exam. Effective December 1, 2009, the Indiana ... "
  }, 
  {
    "id": "http://surveyors.homeblue.com/pros/land-surveyors.aspx?hbb=1&hbc=25166744&hbg=1143444694", 
    "contents": "We match you to local land surveyors. Receive free cost estimates from local pros. "
  }, 
  {
    "id": "http://www.jobhero.com/resume-samples/land-surveyor", 
    "contents": "Find the best Land Surveyor resume samples to help you improve your own resume. Each resume is hand-picked from our large database of real resumes "
  }, 
  {
    "id": "https://www.landsurveyorscenter.com/", 
    "contents": "Looking for free Land Surveyor quotes? Get up to 3 estimates now! "
  }, 
  {
    "id": "https://encyclopedia2.thefreedictionary.com/land+surveyor", 
    "contents": "In the early years, when each Dominion Land surveyor received his commission, he was given a three-foot yardstick made of pine with which he was to verify the length of his field chains, which were usually 66-foot steel link chains. "
  }, 
  {
    "id": "https://learn.org/articles/What_Does_a_Land_Surveyor_Do.html", 
    "contents": "Land surveyors determine property boundaries and prepare maps and survey plots accordingly. Read on to learn more about the job duties and working... "
  }, 
  {
    "id": "http://www.bpelsg.ca.gov/", 
    "contents": "The Board regulates the practices of engineering and land surveying in the state of California by evaluating the experience and administering examinations to prospective licensees and by enforcing the laws regulating licensed professional engineers and land surveyors. "
  }, 
  {
    "id": "https://www.glassdoor.com/Job/land-surveyor-jobs-SRCH_KO0,13.htm", 
    "contents": "Search Land Surveyor jobs with company reviews & ratings. 5,541 open jobs for Land Surveyor. Average Salary: $59,350. "
  }, 
  {
    "id": "http://www.costowl.com/home-improvement/other-hire-land-surveyor-cost.html", 
    "contents": "Learn all about land surveyor costs. Read general land surveyor prices, tips and get free surveying estimates. CostOwl.com "
  }, 
  {
    "id": "https://www.bls.gov/oes/current/oes171022.htm", 
    "contents": "Occupational Employment and Wages, May 2017 17-1022 Surveyors. Make exact measurements and determine property boundaries. Provide data relevant to the shape, contour, gravitation, location, elevation, or dimension of land or land features on or near the earth's surface for engineering, mapmaking, mining, land evaluation, construction, and other ... "
  }, 
  {
    "id": "http://txls.texas.gov/", 
    "contents": "Next Board Meeting The next meeting of the Texas Board of Professional Land Surveying will be held on August 24, 2018, at 9 am, at the TCEQ Complex, 12100 Park 35 Circle, Bldg E, Room 201, Austin, TX 78753. "
  }, 
  {
    "id": "https://www.thefreedictionary.com/surveyor", 
    "contents": "Rebecca flew down over the hill to get a last pail of spring water, and as she lifted the bucket from the crystal depths and looked out over the glowing beauty of the autumn landscape, she saw a company of surveyors with their instruments making calculations and laying lines that apparently crossed Sunnybrook at the favorite spot where Mirror ... "
  }, 
  {
    "id": "https://study.com/land_surveyor_education.html", 
    "contents": "Prospective students who searched for land surveyor education found the links, articles, and information on this page helpful. "
  }, 
  {
    "id": "https://collegegrad.com/careers/surveyors", 
    "contents": "Surveyors make precise measurements to determine property boundaries. They provide data relevant to the shape and contour of the Earth's surface. "
  }, 
  {
    "id": "http://www.uwyo.edu/civil/landsurvey/", 
    "contents": "The Land Surveying Program offers a 30 hour Cadastral Surveying Certificate and a Minor in Land Surveying, both of which meet the Wyoming Board of Registration for Professional Engineers and Professional Land Surveyors surveying specific education necessary for the Land Surveyor in Training certification. "
  }, 
  {
    "id": "http://surveyors.com/land-surveyors/", 
    "contents": "Land Surveyors | useful information about land and practices of surveyors "
  }, 
  {
    "id": "https://www.tn.gov/commerce/regboards/surveyors.html", 
    "contents": "The mission of the Tennessee Board of Examiners for Land Surveyors is to serve the citizens of Tennessee by efficiently and effectively providing a fair, flexible, and positive regulatory environment for consumer service industries. Our goal is to assure that every licensee has met the minimum ... "
  }, 
  {
    "id": "https://www.improvenet.com/r/costs-and-prices/land-survey-cost-estimator", 
    "contents": "The average land survey cost is about $456, with a range between $350 and nearly $490. See the price factors and how to find a land surveyor near you. "
  }, 
  {
    "id": "http://www.acsnsw.com.au/content/231/what-is-a-land-surveyor.aspx", 
    "contents": "What is a Land Surveyor? There are many different types of Surveyors. Members of ACS NSW are Land Surveyors, which means that they determine property boundaries and prepare maps and survey plots accordingly. "
  }, 
  {
    "id": "http://www.dictionary.com/browse/surveyor", 
    "contents": "Surveyor definition, a person whose occupation is surveying. See more. "
  }, 
  {
    "id": "http://galandsurveyor.com/", 
    "contents": "GaLandSurveyor.com is an expert in coordinating and expediting Land Surveying services in the Metro Atlanta Area. We provide quick turnaround, professional service, and economical prices for Land Surveying services. "
  }, 
  {
    "id": "https://ksbtp.ks.gov/professions/surveyors", 
    "contents": "License application, renewal and information for engineers,surveyors,architects,geologists,landscape architects and associated businesses in Kansas "
  }, 
  {
    "id": "https://www.onetonline.org/link/summary/17-1022.00", 
    "contents": "Summary Report for: 17-1022.00 - Surveyors. Make exact measurements and determine property boundaries. Provide data relevant to the shape, contour, gravitation, location, elevation, or dimension of land or land features on or near the earth's surface for engineering, mapmaking, mining, land evaluation, construction, and other purposes. "
  }, 
  {
    "id": "https://www.michigan.gov/lara/0,4601,7-154-72600_72602_72731_72872---,00.html", 
    "contents": "MI Department of Licensing and Regulatory Affairs - Professional Surveyors "
  }, 
  {
    "id": "https://www.wikihow.com/Become-a-Certified-Land-Surveyor", 
    "contents": "How to Become a Certified Land Surveyor. Land surveyors have very exciting and rewarding careers. No two days are the same, and you can find yourself working across a huge number of industries, so you'll never be bored. "
  }, 
  {
    "id": "https://www.thumbtack.com/p/land-survey-cost", 
    "contents": "The average cost for a Land Surveyor is $2400. To hire a Land Surveyor to survey your land, you are likely to spend between $1800 and $2400 total. The price of a Land Surveyor can vary depending on your area. "
  }, 
  {
    "id": "http://www.bdp.ri.gov/surveyors/", 
    "contents": "Professional Land Surveyors Notice - Individual Professional Land Surveyors Registration - Not Enough. Important Reminder to Registered Professional Land Surveyors - Each entity that practices or offers to practice land surveying in Rhode Island must hold a current Certificate of Authorization. "
  }, 
  {
    "id": "https://www.angieslist.com/articles/surveying-your-property-worth-cost.htm", 
    "contents": "Don't trust fences or estimates. Before you buy or build, hire a land surveyor to make sure your property is properly measured. "
  }, 
  {
    "id": "http://www.calapprenticeship.org/programs/surveyors_apprenticeship.php", 
    "contents": "Frequently Asked Questions Career Worksheet. Air Conditioning & Refrigeration; Asbestos; Automotive; Boilermaker; Bricklayer; Carpenter; Cement Masons; Communications Technicians "
  }, 
  {
    "id": "http://www.landsurveyors.com/california-land-surveyor/", 
    "contents": "Chris Nelson and Associates Inc. tel: 818.991.1040 fax: 818.991.0614 address: 31238 Via Colinas Suite 'C', Westlake Village 91362, California email: info@chrisnelsonassociates.com web: www.chrisnelsonassociates.com "
  }, 
  {
    "id": "http://www.dol.wa.gov/business/engineerslandsurveyors/surveyors.html", 
    "contents": "Engineers, land surveyors, and on-site; Engineers. How to get your license; How to renew your license; How to update your license; Exams; Land surveyors. How to get your license "
  }, 
  {
    "id": "https://www1.salary.com/Land-Surveyor-I-salary.html", 
    "contents": "View salary range, bonus & benefits information for Land Surveyor I jobs in the United States or search by specific US and Canadian cities and towns. View open positions, job Descriptions and other statistics related to Land Surveyor I jobs. "
  }, 
  {
    "id": "http://gmonsurveying.com/", 
    "contents": "Land Surveying is one of the oldest professions in the United States and the world. There have been four presidents considered Surveyors, and by coincidence, have been carved into Mount Rushmore. "
  }, 
  {
    "id": "https://www.fema.gov/information-surveyors", 
    "contents": "This page provides resource links and other information about the National Flood Insurance Program that are especially useful for Surveyors. To receive NFIP e-mail updates "
  }, 
  {
    "id": "https://www.linkedin.com/jobs/land-surveyor-jobs", 
    "contents": "Today's top 1569 Land Surveyor jobs in United States. Leverage your professional network, and get hired. New Land Surveyor jobs added daily. "
  }, 
  {
    "id": "https://dot-job-descriptions.careerplanner.com/LAND-SURVEYOR.cfm", 
    "contents": "Job description and jobs for LAND SURVEYOR. Over 12,000 other Job Titles and Job Descriptions. Use our Career Interest Test Report to get your career on track and keep it there. "
  }, 
  {
    "id": "https://learn.org/articles/Land_Surveyor_Become_a_Land_Surveyor_in_5_Steps.html", 
    "contents": "Research what it takes to become a land surveyor. Learn about education requirements, job duties, median wages and job outlook to find out if this... "
  }, 
  {
    "id": "http://www.op.nysed.gov/prof/pels/lsurvlic.htm", 
    "contents": "License Requirements Land Surveying. General Requirements | Fee Schedule | Partial Refunds | Education and Experience Requirements | Examination Requirements | Certification as an Intern Land Surveyor | Interim Practice of Land Surveying "
  }, 
  {
    "id": "https://study.com/land_surveyor_training.html", 
    "contents": "Prospective students searching for land surveyor training found the links, articles, and information on this page helpful. "
  }, 
  {
    "id": "https://www.naukrigulf.com/land-surveyor-jobs", 
    "contents": "Looking for Land Surveyor Jobs? Apply to 584 vacancies for Land Surveyor Jobs, 302 in UAE, 112 in Qatar, 75 in Saudi Arabia. Apply Without Registration. "
  }, 
  {
    "id": "https://www.monster.com/jobs/q-surveyor-jobs.aspx", 
    "contents": "Search for Surveyor jobs at Monster. Browse our collection of Surveyor job listings, including openings in full time and part time. "
  }, 
  {
    "id": "https://www.monster.com/jobs/q-surveyor-jobs.aspx", 
    "contents": "Search for Surveyor jobs at Monster. Browse our collection of Surveyor job listings, including openings in full time and part time. "
  }, 
  {
    "id": "https://www.naukrigulf.com/land-surveyor-jobs", 
    "contents": "Looking for Land Surveyor Jobs? Apply to 584 vacancies for Land Surveyor Jobs, 302 in UAE, 112 in Qatar, 75 in Saudi Arabia. Apply Without Registration. "
  }, 
  {
    "id": "https://nationalcareersservice.direct.gov.uk/job-profiles/land-surveyor", 
    "contents": "Land surveyors measure the shape of the land, and gather data for civil engineering and construction projects. "
  }, 
  {
    "id": "http://appcrawlr.com/ios-apps/best-apps-land-surveyor", 
    "contents": "Discover the top 100 best land surveyor apps for ios free and paid. Top ios apps for land surveyor in AppCrawlr! "
  }, 
  {
    "id": "https://www.nysapls.org/default.aspx?page=1", 
    "contents": "It's IN YOUR INTEREST TO CONTACT A SURVEYOR IF : You are Selling Property.. You may have to provide the buyer with an up-to-date survey of your property in order to: "
  }, 
  {
    "id": "https://www.mckissock.com/land-surveyor/", 
    "contents": "McKissock offers high-quality Continuing Education Land Surveyor Courses. Complete your continuing education courses with an education provider you can trust. "
  }, 
  {
    "id": "https://www.thefreedictionary.com/Land+surveying", 
    "contents": "1. (Surveying) the study or practice of measuring altitudes, angles, and distances on the land surface so that they can be accurately plotted on a map "
  }, 
  {
    "id": "http://kyboels.ky.gov/Getting-Licensed/Pages/Land-Surveying-License-Process.aspx", 
    "contents": "Please note that passage of the Principles & Practice of Land Surveying exam does not guarantee licensure as a Professional Land Surveyor (PLS). "
  }, 
  {
    "id": "https://colorado.gov/pacific/dora/AES", 
    "contents": "State Board of Licensure for Architects, Professional Engineers and Professional Land Surveyors 1560 Broadway, Suite 1350 "
  }, 
  {
    "id": "http://work.chron.com/land-surveyor-vs-construction-surveyor-20133.html", 
    "contents": "For much of recorded history, humans have sought to own or possess land, and they've typically established boundaries denoting their possession. In fact, land surveying was developed specifically to help people determine the size and shape of a piece of land using mathematical measurements. "
  }, 
  {
    "id": "https://www.truity.com/career-profile/surveyor", 
    "contents": "Surveyors held about 42,400 jobs in 2012. Although most worked for private surveying or engineering firms, some worked for state and local governments. "
  }, 
  {
    "id": "http://owenslandsurveying.com/", 
    "contents": "The Company. Owens Land Surveying was founded in June 2000 by registered land surveyor Frank Owens, RPLS #5387, a land surveyor with over three decades experience. "
  }, 
  {
    "id": "http://www.myplan.com/careers/surveyors/description-17-1022.00.html", 
    "contents": "MyPlan.com is unquestionably the best resource on the Internet for career and college information. Their long list of free services includes career profiles, career videos, salary data, college profiles, information on majors and degrees, financial aid advice, and career assessment tests. "
  }, 
  {
    "id": "http://www.squiresholdensurveyors.com/", 
    "contents": "Licensed and certified. Over 100 years in business. Land surveying, engineering services, site plans, and land planning. Call 631-283-0412. 46 Jagger Ln. "
  }, 
  {
    "id": "https://www.careers.govt.nz/jobs-database/construction-and-infrastructure/architectural-technical-design/surveyor/", 
    "contents": "Surveyors map the Earth's surface, including sea, river and lake beds. They determine boundaries, locations, topographic features and man-made structures. "
  }, 
  {
    "id": "http://realestate.sandpoint.com/Surveyors.asp?CMD=List&CatId=29", 
    "contents": "Looking for licensed land surveyors in Sandpoint and North Idaho? Review our list of professional land surveyors who can help you find your property lines or corner markers. "
  }, 
  {
    "id": "http://www.chrisnelsonassociates.com/", 
    "contents": "As a Professional Corporation in business since 1993, Chris Nelson and Associates, Inc. offers southern California and surrounding area with a wide variety of surveying services. "
  }, 
  {
    "id": "https://www.michigan.gov/lara/0,4601,7-154-72600_72602_72731_72872---,00.html", 
    "contents": "MI Department of Licensing and Regulatory Affairs - Professional Surveyors "
  }, 
  {
    "id": "http://www.sso.nebraska.gov/", 
    "contents": "Nebraska State Surveyor's Office 555 North Cotner Blvd. Lincoln, NE 68505 (402) 471-2566 Casey C. Sherlock - State Surveyor "
  }, 
  {
    "id": "http://exactasurvey.com/", 
    "contents": "Accurate & Professional Land Surveying Services. Exacta Land Surveying is one of Ohio’s premier land surveying firms. Our professional staff is committed to delivering accurate and timely surveying services to meet the needs of our clients. "
  }, 
  {
    "id": "http://www.myplan.com/careers/surveyors/description-17-1022.00.html", 
    "contents": "MyPlan.com is unquestionably the best resource on the Internet for career and college information. Their long list of free services includes career profiles, career videos, salary data, college profiles, information on majors and degrees, financial aid advice, and career assessment tests. "
  }, 
  {
    "id": "https://dmv.ny.gov/plates/land-surveyors", 
    "contents": "When the language select box is closed press of up and down arrow will automatically translate this page to the selected language. "
  }, 
  {
    "id": "https://www.homeadvisor.com/tloc/Dallas-TX/Land-Surveyor/", 
    "contents": "Hire the Best Land Surveyors in Dallas, TX on HomeAdvisor. Compare Homeowner Reviews from 2 Top Dallas Land Surveyor services. Get Quotes & Book Instantly. "
  }, 
  {
    "id": "http://www.acrelandsurveyor.com/", 
    "contents": "Welcome to ACRE Engineers and Land Surveyors! Feel free to use the contact form to obtain a quote, offer comments or ask questions.. You may also call 215-752-2000 to contact us directly. "
  }, 
  {
    "id": "http://thelandsurveyor.com/", 
    "contents": "License Land Surveyor in the State of California. Provides quality, accurate, professional, and timely land surveying services to our clients at reasonable prices. "
  }, 
  {
    "id": "https://twitter.com/landsurveyorsU", 
    "contents": "The latest Tweets from Land Surveyors United (@LandSurveyorsU). River of #Surveying Jobs & Open Discussion and Social Land Survey Education Globally since 2007 - Everyday is a Surveyor Conference in our community!. "
  }, 
  {
    "id": "https://www.truity.com/career-profile/surveyor", 
    "contents": "Surveyors held about 42,400 jobs in 2012. Although most worked for private surveying or engineering firms, some worked for state and local governments. "
  }, 
  {
    "id": "http://landsurveyorsunited.com/", 
    "contents": "Global Land Surveyor Community preparing the next generation of land surveyors for the field and supporting surveyors worldwide. "
  }, 
  {
    "id": "https://dsps.wi.gov/pages/Professions/LandSurveyorProfessional/Default.aspx", 
    "contents": "Receive a bachelor's degree in civil engineering of not less than 4 years from a college or university approved by the state where the college or university is located with at least 24 semester credits in courses concentrating on legal principles and technical aspects of land surveying and 2 years of satisfactory professional land surveying ... "
  }, 
  {
    "id": "https://www.malsce.org/", 
    "contents": "MALSCE is a non-profit corporation dedicated to promoting technical and procedural standards for the practice of Land Surveying and Civil Engineering in the Commonwealth. "
  }, 
  {
    "id": "http://www.meyersurvey.com/", 
    "contents": "Meyer Surveying is focused on providing accurate and reliable surveys that meet your needs and are delivered on time, and within budget. "
  }, 
  {
    "id": "http://www.surveyors.org/", 
    "contents": "The Competency Maintenance Organization dedicated to enhancing public safety & trust in the profession of Land Surveying & Mapping. "
  }, 
  {
    "id": "http://www.chrisnelsonassociates.com/", 
    "contents": "As a Professional Corporation in business since 1993, Chris Nelson and Associates, Inc. offers southern California and surrounding area with a wide variety of surveying services. "
  }, 
  {
    "id": "http://www.squiresholdensurveyors.com/", 
    "contents": "Licensed and certified. Over 100 years in business. Land surveying, engineering services, site plans, and land planning. Call 631-283-0412. 46 Jagger Ln. "
  }, 
  {
    "id": "http://www.bpelsg.ca.gov/consumers/lic_lookup.shtml", 
    "contents": "The Board regulates the practices of engineering and land surveying in the state of California by evaluating the experience and administering examinations to prospective licensees and by enforcing the laws regulating licensed professional engineers and land surveyors. "
  }, 
  {
    "id": "http://realestate.sandpoint.com/Surveyors.asp?CMD=List&CatId=29", 
    "contents": "Looking for licensed land surveyors in Sandpoint and North Idaho? Review our list of professional land surveyors who can help you find your property lines or corner markers. "
  }, 
  {
    "id": "https://twitter.com/whsurveyors", 
    "contents": "The latest Tweets from WhiteHorse Surveyors (@whsurveyors). As the UK's largest independent surveying company, we have RICS surveyors local to you. Call us on 01249 569010 for a free quote!. "
  }, 
  {
    "id": "https://www.psls.org/", 
    "contents": "The Next Generation of Surveyors Amy Hopkins, PLS, recently participated in career day at University Park Elementary School in Monroeville, PA. "
  }
]