[
  {
    "id": "http://mentalfloss.com/article/27637/presidential-middle-names", 
    "contents": "Test your knowledge with amazing and interesting facts, trivia, quizzes, and brain teaser games on MentalFloss.com. "
  }, 
  {
    "id": "http://qa.answers.com/Q/What_are_the_middle_names_of_all_the_US_presidents", 
    "contents": "We have had 24 US presidents who have had a middle name. (middle names were very rare in the US before the 1800's. "
  }, 
  {
    "id": "http://crosswordheaven.com/clues/presidential-middle-name", 
    "contents": "Find answers for the crossword clue: Presidential middle name. We have 6 answers for this clue. "
  }, 
  {
    "id": "https://www.crosswordnexus.com/clue/presidential-middle-name", 
    "contents": "Presidential middle name -- Find potential answers to this crossword clue at crosswordnexus.com "
  }, 
  {
    "id": "https://www.npr.org/2013/05/31/187052663/presidential-middle-names", 
    "contents": "Can you guess the Simpsons character whose first name is a Presidential middle name? In this game, Jonathan Coulton spices up the names of U.S. Presidents by \"expanding\" their middle names to include other famous people or characters. "
  }, 
  {
    "id": "https://www.sporcle.com/games/g/presidential_middle_names", 
    "contents": "Can you name the middle names of these United States Presidents? "
  }, 
  {
    "id": "https://video.search.yahoo.com/search/video?p=presidential+middle+names", 
    "contents": "More Presidential Middle Names videos "
  }, 
  {
    "id": "https://crossword365.com/clue/presidential-middle-name", 
    "contents": "On this page you will be able to find Presidential middle name crossword clue answer , last seen on Thomas Joseph on September 28, 2016 . Visit our site for more popular crossword clues updated daily "
  }, 
  {
    "id": "https://www.fitpregnancy.com/baby/baby-names/presidential-baby-names", 
    "contents": "Presidential Baby Names. ... Great Presidential middle names: To pay tribute to your favorite President without being too obvious, consider using his middle name! "
  }, 
  {
    "id": "http://crosswordtracker.com/clue/presidential-middle-name/", 
    "contents": "Clue: Presidential middle name. Presidential middle name is a crossword puzzle clue that we have spotted over 20 times. There are related clues (shown below "
  }, 
  {
    "id": "https://answers.yahoo.com/question/index?qid=20080913010126AAkdcTU&p=presidential%20middle%20names", 
    "contents": "This question is dedicated to people who are so bored they have nothing better to do than get people's questions removed...you know who you are...(giggle) So does anyone care to answer? "
  }, 
  {
    "id": "http://www.funtrivia.com/en/World/Middle-Names-of-Presidents-22137.html", 
    "contents": "17 questions and answers about 'Middle Names of Presidents' in our 'Presidential Trivia' category. Did you know these fun facts and interesting bits of information? "
  }, 
  {
    "id": "http://krvs.org/post/presidential-middle-names", 
    "contents": "JONATHAN COULTON: Well, this game is called Presidential Middle Names. And we are going to spice up the names of U.S. presidents by expanding their middle names to include other famous people or characters. So what we're looking for is the full expanded presidential name. "
  }, 
  {
    "id": "http://crosswordquizanswers.com/presidential-middle-name-4/", 
    "contents": "Below is the solution for Presidential middle name crossword clue. This clue was last seen on Apr 21 2018 in the Thomas Joseph crossword puzzle. While searching our database we found 1 possible solution matching the query “Presidential middle name”. "
  }, 
  {
    "id": "https://www.reference.com/history/full-name-president-chronological-order-e5817091f88356af", 
    "contents": "No middle names were given to any of the first five Presidents of the United States. Continuing in chronological order, full names of the next Presidents include John Quincy Adams, Andrew Jackson, Martin Van Buren, William Henry Harrison and John Tyler. "
  }, 
  {
    "id": "https://newyorktimescrossword.net/presidential-middle-name-2/", 
    "contents": "On this particular page you will find the solution to Presidential middle name crossword clue. This clue was last seen on New York Times Crossword on November 18 2017 In case the clue doesn’t fit or there’s something wrong please contact us! "
  }, 
  {
    "id": "http://www.braingle.com/trivia/29699/presidential-middle-names.html", 
    "contents": "You are most likely familiar with the first names of the Presidents of the United States. How many of their middle names do you know? "
  }, 
  {
    "id": "https://nytcrosswordanswers.com/tag/presidential-middle-name/", 
    "contents": "Please find below all Presidential middle name crossword clue answers and solutions "
  }, 
  {
    "id": "https://www.snopes.com/fact-check/presidential-s-say/", 
    "contents": "Claim: The middle name of President Harry Truman was just the letter ‘S.’ S. Truman, the 33rd President of the United States, came into the world on 8 May 1884. His parents, John Anderson Truman and Martha Ellen Truman, couldn’t decide on a suitable name for their bouncing baby boy, and when ... "
  }, 
  {
    "id": "https://www.babynames.com/lists/presidents-names.php", 
    "contents": "Looking for a presidential name for your baby? Consider these presidential names. "
  }, 
  {
    "id": "http://editions.lib.umn.edu/smartpolitics/2011/09/26/the-presidential-name-game-fli/", 
    "contents": "The Presidential Name Game: ... the actual tally is seven presidents who did not go by their birth name, of which five of these were known by their middle name. "
  }, 
  {
    "id": "https://www.rd.com/culture/presidential-middle-names-quiz/", 
    "contents": "How well do you know presidential middle names? Test your smarts here. "
  }, 
  {
    "id": "https://www.sporcle.com/games/MADZattack/who-was-hiram", 
    "contents": "Can you name the US Presidents known by their middle names, not their first (birth) names? "
  }, 
  {
    "id": "http://www.funtrivia.com/playquiz/quiz333470262cf18.html", 
    "contents": "Take the Quiz: Presidential Middle Names. What do you know about the middle names of some United States Presidents? "
  }, 
  {
    "id": "http://nytimescrossword.org/presidential-middle-name/", 
    "contents": "On this page you will find the solution to Presidential middle name crossword clue. This clue was last seen on November 18 2017 on New . New York Times Crossword Answers. "
  }, 
  {
    "id": "http://mentalfloss.com/quizzes/13955/presidential-middle-names", 
    "contents": "Besides Harry Truman and his standalone \"S\" middle initial, 25 other U.S. presidents have had middle names. How many of these can you name in ten minutes? "
  }, 
  {
    "id": "https://www.snopes.com/fact-check/presidential-s-say/", 
    "contents": "Claim: The middle name of President Harry Truman was just the letter ‘S.’ S. Truman, the 33rd President of the United States, came into the world on 8 May 1884. His parents, John Anderson Truman and Martha Ellen Truman, couldn’t decide on a suitable name for their bouncing baby boy, and when ... "
  }, 
  {
    "id": "http://thomasjosephcrossword.com/presidential-middle-name/", 
    "contents": "Crossword lovers, on this page you will find the solution to Presidential middle name crossword clue. This clue was last seen on Thomas Joseph, April 21 2018 Crossword. "
  }, 
  {
    "id": "http://crosswordheaven.com/search/result?clue=Presidential+middle+name", 
    "contents": "Vice-presidential middle name: WILSON: Presidential middle name or last name: ANN: Popular middle name: ARON: Elvis's middle name: ELIAS: Walt Disney's middle name: MAE: "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Barack_Obama", 
    "contents": "He introduced two initiatives that bore his name: ... The Barack Obama Presidential ... List of international presidential trips made by Barack Obama; Middle Class ... "
  }, 
  {
    "id": "https://www.babycenter.com/0_baby-names-inspired-by-american-presidents-and-first-ladies_10305380.bc", 
    "contents": "The names of American presidents and first ladies provide a rich tapestry of potential baby names – ... I need a middle name for my baby girl Samantha. "
  }, 
  {
    "id": "https://www.englishcrosswords.com/presidential-middle-name-2/", 
    "contents": "Crosswords are a great way to keep your mind working, it has proven to be an excellent learning process for both kids and adults. Solving a crossword a day can keep your brain healthy by keeping it challenged. "
  }, 
  {
    "id": "https://www.creators.com/read/answer-man-andy-seamans/10/07/presidential-middle-initials", 
    "contents": "Let's take a look at the middle names and initials of U.S. presidents. 1. Name the first U.S. president who had a middle name. 2. What was Harry Truman's middle name? "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/James_A._Garfield", 
    "contents": "The story broke in July 1872, in the middle of the presidential campaign. ... Name Term; President: James A. Garfield: 1881: Vice President: Chester A. Arthur: "
  }, 
  {
    "id": "https://www.jetpunk.com/user-quizzes/74928/presidential-middle-names", 
    "contents": "Enter answers in the area marked \"Enter answer here\". You can enter any answer, at any time - they don't have to be in order. Punctuation and capitalization don't matter on JetPunk. "
  }, 
  {
    "id": "https://nytcrosswordanswers.com/63871/presidential-middle-name-2/", 
    "contents": "Here are the answers for Presidential middle name crossword clue of the daily New York Times Crossword Puzzle. Visit our site for all solutions "
  }, 
  {
    "id": "https://www.spelling-words-well.com/support-files/free-pbl-cw-puzzles-presidential-middle-names.pdf", 
    "contents": "www.spelling-words-well.com All Rights Reserved. Presidential Middle Names Many U.S. presidents had/have some interesting middle names. Some apparently had not middle "
  }, 
  {
    "id": "http://qa.answers.com/Q/What_Presidents_had_no_middle_name", 
    "contents": "George Washington, the first US president, did not have a middle name. Limelight05. 842 Contributions. Who is the president with the middle name of delano? "
  }, 
  {
    "id": "http://www.namenerds.com/uucn/pres.html", 
    "contents": "President's and First Ladies' Names Alphabetically: Presidents' First Names Presidents' Middle Names Presidents' Last Names First Ladies' First Names "
  }, 
  {
    "id": "https://www.babycenter.com/0_baby-names-inspired-by-american-presidents-and-first-ladies_10305380.bc", 
    "contents": "The names of American presidents and first ladies provide a rich tapestry of potential baby names – ... I need a middle name for my baby girl Samantha. "
  }, 
  {
    "id": "https://www.nytimes.com/2014/07/13/fashion/theyre-dropping-like-middle-initials.html", 
    "contents": "They’re Dropping Like Middle Initials. ... Middle names first began to appear in Europe in the late Middle ... A string of seven consecutive presidents, ... "
  }, 
  {
    "id": "https://www.spelling-words-well.com/support-files/free-pbl-cw-puzzles-presidential-middle-names.pdf", 
    "contents": "www.spelling-words-well.com All Rights Reserved. Presidential Middle Names Many U.S. presidents had/have some interesting middle names. Some apparently had not middle "
  }, 
  {
    "id": "http://crosswordquizanswers.com/presidential-middle-name-3/", 
    "contents": "Below is the solution for Presidential middle name crossword clue. This clue was last seen on Nov 18 2017 in the New York Times crossword puzzle. While searching our database we found 1 possible solution matching the query “Presidential middle name”. "
  }, 
  {
    "id": "http://dailycrosswordsolver.com/presidential-middle-name/", 
    "contents": "Greetings! First of all we appreciate the fact that you chose our site for your daily dosage of crossword clues solutions! Searching our database for: Presidential middle name crossword clue answers and solutions. "
  }, 
  {
    "id": "http://abcnews.go.com/Politics/2016-presidential-game/story?id=34530146", 
    "contents": "Why presidential hopefuls are sticking to their first names. "
  }, 
  {
    "id": "https://www.nytimes.com/2014/07/13/fashion/theyre-dropping-like-middle-initials.html", 
    "contents": "They’re Dropping Like Middle Initials. ... Middle names first began to appear in Europe in the late Middle ... A string of seven consecutive presidents, ... "
  }, 
  {
    "id": "http://www.answers.com/Q/What_are_the_middle_names_of_the_Vice_Presidents", 
    "contents": "Tompkins: D. (just D.) Calhoun: Caldwell R. Johnson: Mentor Dallas: Mifflin King: Rufus Breckenridge: Cabell Wheeler: Almon Arthur: Alan Hendricks:. "
  }, 
  {
    "id": "http://www.americanlastnames.us/usapresidents.html", 
    "contents": "Pilgrims names; Presidents names; Middle names; ... USA Presidents names ... Our purpose here is to see how well our Presidents' last names faired in the modern ... "
  }, 
  {
    "id": "http://www.historybyzim.com/2011/08/presidential-first-names/", 
    "contents": "Six presidents have “James” as their first name, more than any other first name: James Madison (4th President) James Monroe (5th President) James K. Polk (11th President) "
  }, 
  {
    "id": "http://crosswordtracker.com/search/?answer=&clue=presidential+middle+name", 
    "contents": "Search the crossword puzzle database with a clue and even partial answers. ... Presidential middle name after Abram; Presidential middle name between Rudolph and Wilson; "
  }, 
  {
    "id": "http://www.slate.com/articles/news_and_politics/explainer/2011/01/why_do_so_many_assassins_have_three_names.html", 
    "contents": "Is there a reason so many murderers use their middle names? ... presidential assassin with only two names in ... three names are used to ... "
  }, 
  {
    "id": "http://crosswordtracker.com/search/?answer=&clue=presidential+middle+name", 
    "contents": "Search the crossword puzzle database with a clue and even partial answers. ... Presidential middle name after Abram; Presidential middle name between Rudolph and Wilson; "
  }, 
  {
    "id": "http://www.globalclue.com/clue/Presidential_middle_name", 
    "contents": "Presidential middle name - Crossword clues, answers and solutions - Global Clue website "
  }, 
  {
    "id": "https://www.englishcrosswords.com/presidential-middle-name/", 
    "contents": "Crosswords are a great way to keep your mind working, it has proven to be an excellent learning process for both kids and adults. Solving a crossword a day can keep your brain healthy by keeping it challenged. "
  }, 
  {
    "id": "http://www.slate.com/articles/news_and_politics/explainer/2011/01/why_do_so_many_assassins_have_three_names.html", 
    "contents": "The three most famous political assassins in U.S. history used their middle names, but many others did not. For example, of the 12 people who have made legitimate attempts to kill a U.S. president, former president, or president-elect, only Booth, Oswald, and would-be Ford assassin Sara Jane Moore are commonly referred to by three names. "
  }, 
  {
    "id": "http://eugenesheffercrosswordanswers.com/presidential-middle-name/", 
    "contents": "CROSSWORD CLUE: Presidential middle name SOLUTION: DELANO DATE: April 21 2018. Did you solved Presidential middle name? Check the other clues of Thomas Joseph Crossword April 21 2018 Answers. "
  }, 
  {
    "id": "https://nameberry.com/blog/presidents-day-names-the-mighty-middles-quincy-knox-and-gamaliel", 
    "contents": "On previous Presidents’ Days, we’ve looked at the first and last names of the Chief Executives, their wives and their children’s appellations. So what’s left? Their middle names! And in this era of middle-name mania, we think they merit our attention. Many of the early people in this ... "
  }, 
  {
    "id": "https://crosswordguru.com/clue/presidential-middle-name.html", 
    "contents": "Here is Presidential middle name crossword clue answer which was seen today at Thomas Joseph April 21 2018. "
  }, 
  {
    "id": "https://chamblee54.wordpress.com/2008/02/29/presidential-middle-names/32/", 
    "contents": "Presidential Middle Names Posted in Uncategorized by chamblee54 on February 29, 2008 With the current controversy about the Middle name of Barack Hussein Obama, perhaps it is time for a look at the lessons of history. "
  }, 
  {
    "id": "http://www.firstladies.org/blog/the-original-chosen-names-of-first-ladies-what-these-reveal-of-their-identity/", 
    "contents": "The Original & Chosen Names of First ... Neither did she use the middle name ... out her given middle name of Catherine. It seems that presidential spouses in the ... "
  }, 
  {
    "id": "http://www.answers.com/Q/President_went_by_his_middle_name", 
    "contents": "Andrew Johnson . William McKinley . Theodore Roosevelt Grover Cleveland, Woodrow Wilson and Calvin Coolidge went by their middle names and dropped their given first names. Ulysses Grant went by his middle name, dropped his first name and added a middle initial. Harry S. Truman was given only a middle initial and had no other middle name. "
  }, 
  {
    "id": "https://www.englishcrosswords.com/presidential-middle-name/", 
    "contents": "CLUE: Presidential middle name Answer: ABRAM. Done with Presidential middle name? Go back and see the other crossword clues for New York Times Crossword November 26 2016 Answers. "
  }, 
  {
    "id": "https://www.jetpunk.com/user-quizzes/30947/presidential-middle-names/stats", 
    "contents": "Presidential Middle Names - Stats. This quiz has been taken 16,896 times (7,339 since last reset) The average score is 12 of 26. go to quiz >>> Your scores ... "
  }, 
  {
    "id": "https://www.funscrape.com/games-solution/presidential-middle-names-red-herring/", 
    "contents": "Get answers and solutions of Presidential Middle Names red herring for popular game Red Herring Daily. "
  }, 
  {
    "id": "http://www.slate.com/articles/news_and_politics/politics/2008/05/vote_for_barry_obama.html", 
    "contents": "Why it's hard to run for president with an unusual name. ... Should we give him some other middle name?\" If the argument seems a bit disingenuous, ... "
  }, 
  {
    "id": "http://www.globalclue.com/clue/Presidential_middle_name", 
    "contents": "Presidential middle name - Crossword clues, answers and solutions - Global Clue website "
  }, 
  {
    "id": "https://www.genealogybank.com/newsletter-archives/201401/using-middle-names-your-family-history-searches", 
    "contents": "Another U.S. president, George H. W. (Herbert Walker) Bush, reminds us of another point about middle names: some people have more than one. Is It a Middle Name or First Name? "
  }, 
  {
    "id": "https://www.quora.com/Is-it-normal-to-not-have-a-middle-name", 
    "contents": "However, the mayor of New York, Bill de Blasio (born Warren Wilhelm, Jr.) doesn't, and never did, have a middle name, unless the uncapitalized de counts, and it would be better poetic justice for his middle name to be Duh. After all, Austin Powers's middle name is Danger. *Harry S. Truman had a middle initial but not a middle name. "
  }, 
  {
    "id": "https://www.unmc.edu/news.cfm?match=7726", 
    "contents": "Truman's middle initial Truman did not have a middle name, but only a middle initial. It was a common practice in southern states, including Missouri, to use initials rather than names. Truman said the initial was a compromise between the names of his grandfathers, Anderson Shippe Truman and Solomon Young. "
  }, 
  {
    "id": "http://trumanlibrary.org/speriod.htm", 
    "contents": "In recent years the question of whether to use a period after the \"S\" in Harry S. Truman's name has become a subject of controversy, especially among editors. "
  }, 
  {
    "id": "http://gwpapers.virginia.edu/history/faq/washington/", 
    "contents": "Q: Was Washington born at Mount Vernon? A: No. He was born February 11, 1732, near Bridges Creek, on an estate later called Wakefield (probably named by Washington’s nephew William Augustine Washington), in Westmoreland County, Virginia, about forty miles south of Mount Vernon. "
  }, 
  {
    "id": "https://gizmodo.com/president-harry-s-trumans-middle-name-is-just-the-lett-1608392825", 
    "contents": "When Harry Truman was born in 1884 his parents couldn't decide on a middle name, so they simply went with the letter S. Their goal was to honor both Truman's paternal grandfather (Shippe) and his maternal grandfather (Solomon). Frustratingly for Truman, it actually led to some confusion during his ... "
  }, 
  {
    "id": "https://www.quora.com/What-are-the-most-common-first-names-of-U-S-Presidents", 
    "contents": "What are the most common first names of U.S. Presidents? ... What are the most common first names for Caucasian ... Note that Donald Trump’s middle name is also ... "
  }, 
  {
    "id": "https://clue-crossword.com/presidential-middle-name-5/", 
    "contents": "Todays crossword puzzle clue is a quick one: Presidential middle name. We will try to find the right answer to this particular crossword clue. Here are the poss "
  }, 
  {
    "id": "http://www.nydailynews.com/news/politics/h-president-elect-barack-obama-middle-shortened-inauguration-rehearsal-article-1.424798", 
    "contents": "President-elect Barack Obama's middle name - Hussein - was shortened to the initial \"H\" for inauguration rehearsals on Sunday, but officials said his full name will be used during the real thing Jan. 20. "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=QOJwv5x5rNY", 
    "contents": "Can you state the middle names of all the presidents? Try it...then watch this video to help fill in the blanks. :) Find the Pursuit of History on Facebook: ... "
  }, 
  {
    "id": "https://crosswordguru.com/clue/middle-name-of-20th-us-president.html", 
    "contents": "Below you will be able to find all Middle name of 20th U.S. president crossword clue answers.CrosswordGuru.com is the biggest database with all crossword clues solutions "
  }, 
  {
    "id": "http://redstatewatcher.com/trivia.asp?id=10", 
    "contents": "Are you ready to call Donald Trump your president? ... What is Donald Trump's middle name? Choose an answer. Joseph. Edward. John. Jude. William. Jorge "
  }, 
  {
    "id": "https://millercenter.org/president/cleveland", 
    "contents": "Professor Bob Bruner looks at how presidents including Grover Cleveland handled economic crises in this essay for the First Year Project. ... Slavery by Another Name: ... "
  }, 
  {
    "id": "https://www.trumanlittlewhitehouse.com/key-west/president-truman-biography.htm", 
    "contents": "Expand your knowledge of presidential history with our facts on President Harry S Truman. ... Did you know that Harry S. Truman actually had no middle name? "
  }, 
  {
    "id": "https://www2.ed.gov/programs/psp/index.html", 
    "contents": "The U.S. Presidential Scholars Program was established in 1964, by executive order of the President, to recognize and honor some of our nation's most distinguished graduating high school seniors. "
  }, 
  {
    "id": "http://redstatewatcher.com/trivia.asp?id=10", 
    "contents": "Are you ready to call Donald Trump your president? ... What is Donald Trump's middle name? Choose an answer. Joseph. Edward. John. Jude. William. Jorge "
  }, 
  {
    "id": "https://www.trumanlittlewhitehouse.com/key-west/president-truman-biography.htm", 
    "contents": "Expand your knowledge of presidential history with our facts on President Harry S Truman. ... Did you know that Harry S. Truman actually had no middle name? "
  }, 
  {
    "id": "https://www2.ed.gov/programs/psp/index.html", 
    "contents": "The U.S. Presidential Scholars Program was established in 1964, by executive order of the President, to recognize and honor some of our nation's most distinguished graduating high school seniors. "
  }, 
  {
    "id": "https://www.trumanlibrary.org/speriod.htm", 
    "contents": "In recent years the question of whether to use a period after the \"S\" in Harry S. Truman's name has become a subject of controversy, especially among editors. "
  }, 
  {
    "id": "http://www.clarkscript.com/List-of-presidents.pdf", 
    "contents": "List of Presidents of the United States of America ... presidents' names in groups related to each line. Then amaze everyone with your great memory feat "
  }, 
  {
    "id": "https://www.genealogybank.com/newsletter-archives/201401/using-middle-names-your-family-history-searches", 
    "contents": "Another U.S. president, George H. W. (Herbert Walker) Bush, reminds us of another point about middle names: some people have more than one. Is It a Middle Name or First Name? "
  }, 
  {
    "id": "http://crosswordpuzzleanswers.net/clue/Presidential-middle-name", 
    "contents": "Today's clue from the New York Times crossword puzzle is : Presidential middle name First let's look and see if we can find any hints in the New York Times crossword puzzle. "
  }, 
  {
    "id": "https://quizlet.com/202083/all-vice-presidents-full-names-flash-cards/", 
    "contents": "Start studying All Vice Presidents' full names. Learn vocabulary, terms, and more with flashcards, games, and other study tools. "
  }, 
  {
    "id": "https://www.triviacountry.com/215-President-Trivia.htm", 
    "contents": "US Presidents Trivia Quiz Questions . President Dwight Eisenhower's middle name was what? A: David. President Herbert Hoover's middle name was what? "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Gerald_Ford", 
    "contents": "Gerald Ford; 38th President of the ... he also used a more conventional spelling of his middle name. ... Ford often declined to mention President Nixon by name, ... "
  }, 
  {
    "id": "http://crosswordpuzzleanswers.net/clue/Presidential-middle-name", 
    "contents": "Today's clue from the New York Times crossword puzzle is : Presidential middle name First let's look and see if we can find any hints in the New York Times crossword puzzle. "
  }, 
  {
    "id": "http://www.woodrowwilson.org/about/biography", 
    "contents": "Thomas Woodrow Wilson, 28th president of the United States, ... Now going by his middle name Woodrow, Wilson began his teaching career at Bryn Mawr College. "
  }, 
  {
    "id": "http://www.imdb.com/name/nm0874288/bio", 
    "contents": "Harry S. Truman was born on May 8, ... President Harry S. Truman President Truman : Height: ... both argued over whose would be the child's middle name. "
  }, 
  {
    "id": "https://www.ducksters.com/biography/uspresidents/franklinpierce.php", 
    "contents": "Franklin Pierce was the 14th president of the United States. ... He had no middle name. He was the first president to put a Christmas tree in the White House. "
  }, 
  {
    "id": "https://www.education.com/slideshow/u-s-presidents-matching-game/", 
    "contents": "Help your middle school student review her knowledge of the US Presidents with this series of printable matching worksheets. "
  }, 
  {
    "id": "http://althistory.wikia.com/wiki/List_of_Australian_Presidents_(Referendum_to_Republic)", 
    "contents": "List of Australian Presidents (Referendum to Republic) ... Name (Birth–Death) ... Lowered minor taxes on the middle class. "
  }, 
  {
    "id": "http://www.rocketswag.com/biography/leader/george-washington/index.html", 
    "contents": "George washington facts - What is george washington middle name? :George Washington, the foremost American president was born on 22 February 1732. He was brought up by his elder brother as his father died when he was just 11 years old. "
  }, 
  {
    "id": "https://www.unmc.edu/news.cfm?match=7726", 
    "contents": "He is the only President to have a letter as a middle name. Robin Jaeckel. February 25, 2011 at 8:28 AM. Harry Truman s middle name really was just \"S.\" "
  }, 
  {
    "id": "http://gwpapers.virginia.edu/history/faq/washington/", 
    "contents": "Q: Was Washington born at Mount Vernon? A: No. He was born February 11, 1732, near Bridges Creek, on an estate later called Wakefield (probably named by Washington’s nephew William Augustine Washington), in Westmoreland County, Virginia, about forty miles south of Mount Vernon. "
  }
]