[
  {
    "id": "https://www.bls.gov/ooh/healthcare/occupational-therapists.htm", 
    "contents": "Occupational therapists treat injured, ill, or disabled patients through the therapeutic use of everyday activities. They help these patients develop, recover, improve, as well as maintain the skills needed for daily living and working. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Occupational_therapy", 
    "contents": "Occupational therapy (OT) is the use of assessment and intervention to develop, recover, or maintain the meaningful activities, or occupations, of individuals, groups, or communities. "
  }, 
  {
    "id": "https://www.aota.org/About-Occupational-Therapy.aspx", 
    "contents": "What Is Occupational Therapy? Occupational therapy practitioners ask, \"What matters to you?\" not, \"What's the matter with you?\" In its simplest terms, occupational therapists and occupational therapy assistants help people across the lifespan participate in the things they want and need to do through the therapeutic use of everyday activities ... "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Occupational_therapist", 
    "contents": "An occupational therapist works with a client to help them achieve a fulfilled and satisfied state in life through the use of \"purposeful activity or interventions ... "
  }, 
  {
    "id": "https://money.usnews.com/careers/best-jobs/occupational-therapist", 
    "contents": "Find out more about the average occupational therapist salary and learn where the best-paying metropolitan areas are for a occupational therapist across the country. "
  }, 
  {
    "id": "https://www.indeed.com/salaries/Occupational-Therapist-Salaries,-San-Francisco-CA", 
    "contents": "Average Occupational Therapist salary: $85,830 per year. Data comes from 150 real salaries collected directly from employees and jobs on Indeed. "
  }, 
  {
    "id": "https://www.ithaca.edu/hshp/depts/ot/faqs/whatisot/", 
    "contents": "What is occupational therapy and what do occupational therapists do? Occupational therapy is a health and rehabilitation profession. Occupational therapists work with people of all ages who need specialized assistance to lead independent, productive, and satisfying lives due to physical, developmental, social, or emotional problems. "
  }, 
  {
    "id": "https://www.healthgrades.com/occupational-therapy-directory/ca-california/san-francisco", 
    "contents": "Find and research local Occupational Therapists in San Francisco, CA including ratings, contact information, and more. "
  }, 
  {
    "id": "https://explorehealthcareers.org/career/occupational-therapy/occupational-therapist/", 
    "contents": "Occupational therapists help people fully engage in daily life, from work and play to activities of daily living like dressing, cooking, eating and driving. "
  }, 
  {
    "id": "https://search.yahoo.com/local/s?p=occupational+therapist&addr=Palo+Alto%2C+CA+94306&loc=woeid%3A12797284", 
    "contents": ""
  }, 
  {
    "id": "https://www.thebalancecareers.com/occupational-therapist-526048", 
    "contents": "What does an occupational therapist do? Get a job description including information about earnings, education and licensing requirements, and job outlook. "
  }, 
  {
    "id": "https://www.bls.gov/ooh/healthcare/mobile/occupational-therapists.htm", 
    "contents": "Occupational therapists treat injured, ill, or disabled patients through the therapeutic use of everyday activities. They help these patients develop, recover, improve, as well as maintain the skills needed for daily living and working. "
  }, 
  {
    "id": "https://www.occupationaltherapy.com/", 
    "contents": "Hundreds of Occupational Therapy Continuing Education Courses. AOTA and NBCOT Approved. Online Courses in Video, Live Webinar, Text and Audio Formats. "
  }, 
  {
    "id": "https://collegegrad.com/careers/occupational-therapists", 
    "contents": "Occupational therapists treat injured, ill, or disabled patients through the therapeutic use of everyday activities. "
  }, 
  {
    "id": "http://kidshealth.org/en/parents/occupational-therapy.html", 
    "contents": "Occupational therapy can help improve kids' cognitive, physical, and motor skills and enhance their self-esteem and sense of accomplishment. "
  }, 
  {
    "id": "https://www.indeed.com/q-Occupational-Therapist-jobs.html", 
    "contents": "19,535 Occupational Therapist jobs available on Indeed.com. Search for jobs at University of Washington Medical Center, Massachusetts General Hospital, Fairview Health Services and more! "
  }, 
  {
    "id": "https://www.monster.com/jobs/q-occupational-therapist-jobs.aspx", 
    "contents": "Search for Occupational Therapist jobs at Monster. Browse our collection of Occupational Therapist job listings, including openings in full time and part time. "
  }, 
  {
    "id": "https://www.merriam-webster.com/dictionary/occupational%20therapy", 
    "contents": "These example sentences are selected automatically from various online news sources to reflect current usage of the word 'occupational therapy.' Views expressed in the examples do not represent the opinion of Merriam-Webster or its editors. Send us feedback ... "
  }, 
  {
    "id": "https://study.com/articles/Occupational_Therapist_How_Do_I_Become_an_Occupational_Therapy_Professional.html", 
    "contents": "Students searching for How to Become an Occupational Therapy Professional found the following related articles and links useful. "
  }, 
  {
    "id": "https://www.payscale.com/research/US/Job=Occupational_Therapist_(OT)/Hourly_Rate", 
    "contents": "As of Jun 2018, the average pay for an Occupational Therapist (OT) is $36.45 /hr or $64,962 annually. "
  }, 
  {
    "id": "https://www.truity.com/career-profile/occupational-therapist", 
    "contents": "Occupational therapists held about 113,200 jobs in 2012. The industries that employed the most occupational therapists in 2012 were as follows: "
  }, 
  {
    "id": "https://www1.salary.com/Occupational-Therapist-Salary.html", 
    "contents": "View salary range, bonus & benefits information for Occupational Therapist jobs in the United States or search by specific US and Canadian cities and towns. View open positions, job Descriptions and other statistics related to Occupational Therapist jobs. "
  }, 
  {
    "id": "https://www.webmd.com/add-adhd/childhood-adhd/occupational-therapy-for-children-with-adhd", 
    "contents": "Find out from WebMD how an occupational therapist can help children with ADHD improve their skills in everyday tasks. "
  }, 
  {
    "id": "http://www.otcareerpath.com/how-to-become-an-occupational-therapist", 
    "contents": "Learn how to become an occupational therapist assistant in 2 years and an occupational therapist in 5 years or less...Step one: earn a bachelor's degree... "
  }, 
  {
    "id": "https://www.youtube.com/watch?v=709DlMuPkRg", 
    "contents": "In our latest Day in the Life, Lani shares how positivity, creativity and play can help children in therapy. For more information about Occupational Therapy ... "
  }, 
  {
    "id": "https://childmind.org/article/occupational-therapists-what-do-they-do/", 
    "contents": "When kids show delays in developing skills, Occupational Therapists are often the first called in to evaluate symptoms and offer solutions. "
  }, 
  {
    "id": "https://www.glassdoor.com/Salaries/occupational-therapist-salary-SRCH_KO0,22.htm", 
    "contents": "7,075 Occupational Therapist Salaries provided anonymously by employees. What salary does a Occupational Therapist earn in your area? "
  }, 
  {
    "id": "https://money.usnews.com/careers/best-jobs/occupational-therapist/salary", 
    "contents": "Salary information and advice for occupational therapist at US News Best Jobs. "
  }, 
  {
    "id": "https://www.masters-in-special-education.com/faq/occupational-therapist/", 
    "contents": "If you are considering a career in occupational therapy to treat injured, ill, and disabled patients to improve the skills needed for daily living, then it is important to be aware of the steps needed to become an occupational therapist. "
  }, 
  {
    "id": "https://otaonline.stkate.edu/blog/fields-occupational-therapy-and-physical-therapy-whats-difference/", 
    "contents": "The fields of occupational therapy and physical therapy are often confused. Though both provide hands-on rehabilitative care to help individuals perform tasks independently, the two fields vary more than you might think. "
  }, 
  {
    "id": "https://study.com/occupational_therapist_training.html", 
    "contents": "Students searching for occupational therapist training found the following related articles and links useful. "
  }, 
  {
    "id": "https://www.monster.com/jobs/q-occupational-therapy-jobs.aspx", 
    "contents": "Search for Occupational Therapy jobs at Monster. Browse our collection of Occupational Therapy job listings, including openings in full time and part time. "
  }, 
  {
    "id": "https://www.understood.org/en/learning-attention-issues/treatments-approaches/therapies/occupational-therapy-what-you-need-to-know", 
    "contents": "What is occupational therapy? Find out how OT works and how children may qualify for free occupational therapy services in school. "
  }, 
  {
    "id": "https://twu.edu/occupational-therapy/", 
    "contents": "TWU's School of Occupational Therapy offers master's and doctoral degrees in occupational therapy from its Dallas campus. "
  }, 
  {
    "id": "https://labor.ny.gov/stats/olcny/occupational-therapist.shtm", 
    "contents": "Occupational Therapist Description: Occupational therapists are licensed rehabilitation care professionals who work to restore or improve physical abilities, promote behavioral changes, adapt surroundings, and teach new skills; the goal is to have the individual achieve her or his best physical and/or mental functioning in daily life tasks. "
  }, 
  {
    "id": "https://www.otplan.com/articles/how-to-obtain-your-occupational-therapy-degree.aspx", 
    "contents": "How to obtain your Occupational Therapy (OT) Degree? read how to get your OT degree at your state and become an Occupational Therapist "
  }, 
  {
    "id": "https://www.webmd.com/brain/autism/benefits-of-occupational-therapy-for-autism", 
    "contents": "WebMD examines the role of occupational therapy in a treatment plan for autism. "
  }, 
  {
    "id": "https://www.csudh.edu/university-catalog/2016-2017/occupational-therapy/", 
    "contents": "Graduate studies in Occupational Therapy prepare students for a professional career focused on helping people achieve skills and utilize resources to live independent and meaningful lives. The Master of Science in Occupational Therapy degree is offered in consecutive trimesters and requires ... "
  }, 
  {
    "id": "https://www.allalliedhealthschools.com/physical-therapy/occupational-therapy-degree/", 
    "contents": "Choose an occupational therapy degree. Find out what you need to know before you apply to occupational therapist schools. "
  }, 
  {
    "id": "https://mn.gov/boards/occupational-therapy/", 
    "contents": "The Minnesota Board of Occupational Therapy Practice's mission is to protect the public through effective licensure and enforcement of the statutes and rules governing the practice of occupational therapy to reasonably ensure a standard of competent and ethical practice. "
  }, 
  {
    "id": "https://www.otaus.com.au/about/what-do-occupational-therapists-do", 
    "contents": "What do occupational therapists do? Here are some examples of the kinds of work that occupational therapists do: Working with children: Helping children achieve their developmental milestones such as fine motor skills and hand-eye coordination. "
  }, 
  {
    "id": "https://en.wikipedia.org/wiki/Occupational_therapist", 
    "contents": "Occupational therapists (OTs) help people of all ages to improve their ability to perform tasks in their daily living and working environments. "
  }, 
  {
    "id": "https://medical-dictionary.thefreedictionary.com/occupational+therapy", 
    "contents": "occupational [ok″u-pa´shun-al] 1. pertaining to a vocation or source of livelihood. 2. pertaining to the skills a person needs to live independently and carry on a desired ... "
  }, 
  {
    "id": "https://mn.gov/boards/occupational-therapy/", 
    "contents": "The Minnesota Board of Occupational Therapy Practice's mission is to protect the public through effective licensure and enforcement of the statutes and rules governing the practice of occupational therapy to reasonably ensure a standard of competent and ethical practice. "
  }, 
  {
    "id": "https://psychcentral.com/lib/occupational-therapy-and-mental-health/", 
    "contents": "The mental health treatment journey requires a collaborative effort by many people -- the individual, his or her caregivers, support providers, doctors, nurses, "
  }, 
  {
    "id": "https://www.glassdoor.com/Job/occupational-therapist-jobs-SRCH_KO0,22.htm", 
    "contents": "Search Occupational Therapist jobs with company reviews & ratings. 21,589 open jobs for Occupational Therapist. Average Salary: $79,647. "
  }, 
  {
    "id": "https://www.otaus.com.au/about/what-do-occupational-therapists-do", 
    "contents": "What do occupational therapists do? Here are some examples of the kinds of work that occupational therapists do: Working with children: Helping children achieve their developmental milestones such as fine motor skills and hand-eye coordination. "
  }, 
  {
    "id": "https://www.livescience.com/42923-occupational-therapy.html", 
    "contents": "Occupational therapy is focused on the activities that give daily life meaning, from self-care to leisure to work. Occupational therapists work in hospitals, rehabilitation facilities and schools. "
  }, 
  {
    "id": "https://occupationaltherapyot.com/", 
    "contents": "An Occupational therapy Blog by the Occupational Therapists. This site can be referred as OT resources for therapists, educators, special needs teachers, and parents/caregivers and other health care professionals. "
  }, 
  {
    "id": "https://labor.ny.gov/stats/olcny/occupational-therapist.shtm", 
    "contents": "Occupational Therapist Description: Occupational therapists are licensed rehabilitation care professionals who work to restore or improve physical abilities, promote behavioral changes, adapt surroundings, and teach new skills; the goal is to have the individual achieve her or his best physical and/or mental functioning in daily life tasks. "
  }, 
  {
    "id": "https://www.nbcot.org/", 
    "contents": "NBCOT provides initial and renewal certification for occupational therapy in the United States. "
  }, 
  {
    "id": "https://www.glassdoor.com/Job/occupational-therapist-jobs-SRCH_KO0,22.htm", 
    "contents": "Search Occupational Therapist jobs with company reviews & ratings. 21,589 open jobs for Occupational Therapist. Average Salary: $79,647. "
  }, 
  {
    "id": "https://psychcentral.com/lib/occupational-therapy-and-mental-health/", 
    "contents": "The mental health treatment journey requires a collaborative effort by many people -- the individual, his or her caregivers, support providers, doctors, nurses, "
  }, 
  {
    "id": "http://www.nhs.uk/conditions/occupational-therapy/Pages/introduction.aspx", 
    "contents": "NHS Choices - occupational therapy "
  }, 
  {
    "id": "https://www.snagajob.com/job-descriptions/occupational-therapist/", 
    "contents": "Do you want to help people in pain? Are you interested in working to help ease the suffering of others, but aren't necessarily interested in medicine? You might be ready for a career as an occupational therapist. "
  }, 
  {
    "id": "http://salarybystate.org/healthcare/occupational-therapist-salary-by-state", 
    "contents": "Google Trend graph of the interest in an Occupational Therapist has been pretty constant over the last 8 years with a small peak in 2010 showing up. The Occupational Therapy interest definitely has a built in cyclical reoccurance you can see from the interest graph below. "
  }, 
  {
    "id": "https://www.usnews.com/best-graduate-schools/top-health-schools/occupational-therapy-rankings", 
    "contents": "See the top ranked occupational therapy programs at US News. Use the best occupational therapy school rankings to prepare you for a career as an occupational therapist. "
  }, 
  {
    "id": "https://www.tuskegee.edu/programs-courses/colleges-schools/sonah/occupational-therapy", 
    "contents": "Occupational Therapy. OT Job Opportunities. Occupational Therapy (OT) is a health/rehabilitation profession whose practitioners work in a wide variety of settings including acute care hospitals, rehabilitation centers, psychiatric hospitals, community mental health facilities, schools, and nursing homes, to name a few. "
  }, 
  {
    "id": "https://www.pr.mo.gov/octherapy.asp", 
    "contents": "The Missouri Division of Professional Registration is comprised of 38 professional boards that are responsible for safeguarding public health, safety and welfare. "
  }, 
  {
    "id": "http://www.chop.edu/pages/occupational-therapy-internship", 
    "contents": "The Occupational Therapy Department at The Children's Hospital of Philadelphia (CHOP) offers an exciting and challenging internship for prospective Level I and Level II interns. "
  }, 
  {
    "id": "http://www.nbcot.org/", 
    "contents": "NBCOT provides initial and renewal certification for occupational therapy in the United States. "
  }, 
  {
    "id": "http://www.chop.edu/pages/occupational-therapy-internship", 
    "contents": "The Occupational Therapy Department at The Children's Hospital of Philadelphia (CHOP) offers an exciting and challenging internship for prospective Level I and Level II interns. "
  }, 
  {
    "id": "http://www.otjobs.com/occupational-therapy-jobs/ot/", 
    "contents": "Job Title Job Location Job Category; Occupational Therapist. Oak Park, Illinois "
  }, 
  {
    "id": "https://www.aic.edu/school-of-health-sciences/program/occupational-therapy/", 
    "contents": "Get an Occupational Therapy degree at American International College and start making an impact helping people at risk for medical/psychological problems. "
  }, 
  {
    "id": "https://www.michigan.gov/lara/0,4601,7-154-72600_72603_27529_27545---,00.html", 
    "contents": "MI Department of Licensing and Regulatory Affairs - information about the occupational therapist licensing process in Michigan "
  }, 
  {
    "id": "https://www.caot.ca/site/aboutot/whatisot?nav=sidebar", 
    "contents": "CAOT, Canadian Association of Occupational Therapists | Association canadienne des ergothérapeutes, "
  }, 
  {
    "id": "https://www.prospects.ac.uk/job-profiles/occupational-therapist", 
    "contents": "Discover what it takes to be a Occupational therapist. Find out expected salary, working hours, qualifications and more. "
  }, 
  {
    "id": "https://www.sokanu.com/careers/occupational-therapist/", 
    "contents": "An occupational therapist is someone who treats patients with injuries, illnesses, or disabilities through the therapeutic use of everyday activities. They help these patients develop, recover, and improve the skills needed for daily living and working. "
  }, 
  {
    "id": "http://www.op.nysed.gov/prof/ot/otlic.htm", 
    "contents": "Fees. The fee for licensure as an occupational therapist is $294. The fee for a limited permit as an occupational therapist is $70. The fee for licensure as an occupational therapy assistant is $147. "
  }, 
  {
    "id": "http://www.uthscsa.edu/academics/health-professions/departments/occupational-therapy", 
    "contents": "Learn about the Occupational Therapy master's program at UT Health San Antonio. "
  }, 
  {
    "id": "https://www.linkedin.com/title/occupational-therapist/", 
    "contents": "Check out Occupational Therapist profiles, job listings & salaries. Review & learn skills to be a Occupational Therapist. "
  }, 
  {
    "id": "https://www.livescience.com/42923-occupational-therapy.html", 
    "contents": "Occupational therapy is focused on the activities that give daily life meaning, from self-care to leisure to work. Occupational therapists work in hospitals, rehabilitation facilities and schools. "
  }, 
  {
    "id": "https://www.fscj.edu/academics/areas-of-study/health-human-services/Occupational-Therapy-Assistant", 
    "contents": "The A.S. in Occupational Therapy includes general education and professional occupational therapy courses to be an occupational therapist assistant. "
  }, 
  {
    "id": "https://www.accreditedschoolsonline.org/vocational-trade-school/occupational-therapy/", 
    "contents": "Occupational therapy is a growing field, and occupational therapy schools are available. Search for occupational therapy programs. "
  }, 
  {
    "id": "http://work.chron.com/occupational-therapist-education-requirements-12937.html", 
    "contents": "If you're looking for an opportunity to make a difference in other people's lives while enjoying solid career prospects and wages, you might find it in occupational therapy. "
  }, 
  {
    "id": "http://www.ksbha.org/professions/OT.shtml", 
    "contents": "occupational therapist (O.T.) Occupational Therapy: \"The therapeutic use of purposeful and meaningful occupations (goal-directed activities) to evaluate and treat, pursuant to the referral, supervision, order or direction of a physician, a licensed podiatrist, a licensed dentist, a licensed physician assistant, or a licensed advanced practice ... "
  }, 
  {
    "id": "https://www.diffen.com/difference/Occupational_Therapy_vs_Physical_Therapy", 
    "contents": "What's the difference between Occupational Therapy and Physical Therapy? While physical therapy aims to increase mobility and function, occupational therapy is focused on helping people live as independently as possible. "
  }, 
  {
    "id": "https://go.umhb.edu/graduate/occupational-therapy/home", 
    "contents": "Welcome to the sparkling new UMHB Department of Occupational Therapy! I am both honored and humbled to be the founding director of this exci "
  }, 
  {
    "id": "https://www.linkedin.com/jobs/occupational-therapist-jobs", 
    "contents": "Today's top 25384 Occupational Therapist jobs in United States. Leverage your professional network, and get hired. New Occupational Therapist jobs added daily. "
  }, 
  {
    "id": "http://www.wfot.org/AboutUs/AboutOccupationalTherapy/DefinitionofOccupationalTherapy.aspx", 
    "contents": "World Federation of Occupational Therapists is the official representative of occupational therapy and occupational therapists worldwide. "
  }, 
  {
    "id": "https://www.uwlax.edu/grad/occupational-therapy/", 
    "contents": "“The University of Wisconsin-La Crosse Occupational Therapy program graduates entry level occupational therapist leaders who are committed to providing excellent ... "
  }, 
  {
    "id": "http://www.lewisu.edu/academics/msoccuptherapy/index.htm", 
    "contents": "Working professionals develop advanced skills to treat individuals experiencing physical, cognitive, psychological, and sensory performance issues. "
  }, 
  {
    "id": "https://healthprofessions.missouri.edu/occupational-therapy/", 
    "contents": "Occupational Therapy. The mission of the Department of Occupational Therapy at University of Missouri is to improve the health and well-being of society by assisting people to optimize their participation in everyday life occupations. "
  }, 
  {
    "id": "https://www.nationwidechildrens.org/specialties/occupational-therapy", 
    "contents": "Occupational Therapy is a skilled treatment that focuses on facilitating development, enhancing function and maximizing independence in all daily life activities. For children, the word \"occupation\" refers to play, self-care, school work and other activities that occupy a child's time. "
  }, 
  {
    "id": "http://www.op.nysed.gov/prof/ot/otpifaq.htm", 
    "contents": "Answer: Occupational therapy assistants are defined in Education Law, Article 156, Section 7906(6), as exempt from licensure in occupational therapy and, therefore, may practice anything within the scope of practice of occupational therapy. "
  }, 
  {
    "id": "https://www.healthychildren.org/English/health-issues/conditions/developmental-disabilities/Pages/Occupational-Therapy.aspx", 
    "contents": "Occupational therapists often can help with these issues. Occupational Therapy (OT) Evaluation An OT evaluates the child’s fine motor skills and sensory processing development and prepares strategies for learning tasks of daily living. "
  }, 
  {
    "id": "http://www.uthscsa.edu/academics/health-professions/departments/occupational-therapy", 
    "contents": "Learn about the Occupational Therapy master's program at UT Health San Antonio. "
  }, 
  {
    "id": "http://www.bates.ctc.edu/OTA", 
    "contents": "Occupational therapy assistants work under the direction of occupational therapists to provide services to persons whose lives have been challenged due to injury, illness, developmental deficits or aging. "
  }, 
  {
    "id": "http://steinhardt.nyu.edu/ot/definition", 
    "contents": "Occupational therapy is a health profession whose goal is to help people achieve independence, meaning and satisfaction in all aspects of their lives. Occupational therapists: Apply their specific knowledge to enable people to engage in activities of daily living that have personal meaning and value "
  }, 
  {
    "id": "http://www.ascseniorcare.com/occupational-therapy-for-seniors/", 
    "contents": "Occupational therapy for seniors offers several important benefits. Read our latest blog post to find out more about Occupational Therapy. "
  }, 
  {
    "id": "https://www.utc.edu/occupational-therapy/index.php", 
    "contents": "The occupational therapy doctorate is designed to develop leaders in occupational therapy. "
  }, 
  {
    "id": "https://intermountainhealthcare.org/services/occupational-medicine/services/occupational-therapy/", 
    "contents": "Occupational therapy also evaluates and treats pain, weakness, and range of motion in the joints. However, occupational therapy places focus more on fine motor ability, cognitive (reasoning) skills, activities of daily living, and problems with processing senses. "
  }, 
  {
    "id": "http://www.tnstate.edu/ot/", 
    "contents": "Occupational Therapy \"Living Life to Its Fullest\" The TSU Occupational Therapy program is fully accredited by the Accreditation Council for Occupational Therapy Education (ACOTE), c/o: American Occupational Therapy Association, 4720 Montgomery Lane, Suite 200, Bethesda, MD, 20814-3449 (301) 652-2682 ext 2914. "
  }, 
  {
    "id": "https://www.umflint.edu/graduateprograms/occupational-therapy", 
    "contents": "The University of Michigan-Flint is proud to have the first entry-level Doctor of Occupational Therapy (OTD) in the state of Michigan. The OTD program is a professional (or clinical) doctorate, which is the highest level of academic preparation that an entry-level occupational therapist can obtain. "
  }, 
  {
    "id": "https://www.avera.org/services/therapy-rehabilitation/occupational-therapy/", 
    "contents": "Get expert occupational therapy and extensive rehabilitation services at Avera locations across the Upper Midwest. "
  }, 
  {
    "id": "http://www.philau.edu/ot/", 
    "contents": "Philadelphia University offers undergraduate and graduate degree programs in more than 40 areas of study. "
  }, 
  {
    "id": "https://pmi.edu/programs/associate/occupational-therapy-assistant", 
    "contents": "Occupational therapy assistants help patients of all ages and with all different types of disabilities and challenges to participate in everyday life activities. They are patient, reliable and compassionate individuals. "
  }, 
  {
    "id": "https://www.rcot.co.uk/about-occupational-therapy/what-is-occupational-therapy", 
    "contents": "Occupational therapy provides practical support to empower people to facilitate recovery and overcome barriers preventing them from doing the activities (or occupations) that matter to them. This support increases people's independence and satisfaction in all aspects of life. "
  }, 
  {
    "id": "http://www.healthcaresalaryonline.com/occupational-therapist-job-description.html", 
    "contents": "Occupational Therapist Job Description: Occupational therapists (OTs) help people improve their ability to perform tasks in their daily living and working environments. They work with individuals who have conditions that are mentally, physically, developmentally, or emotionally disabling. "
  }, 
  {
    "id": "https://www.hopkinsmedicine.org/physical_medicine_rehabilitation/services/rehab-therapy/occupational/index.html", 
    "contents": "Occupational therapists at Johns Hopkins help patients participate in meaningful daily activities and practice habits they may need for work and recreation. "
  }
]